       IDENTIFICATION DIVISION.                                         00000100
       PROGRAM-ID.    D681PD01.                                         00000200
       INSTALLATION.  AUL.                                              00000300
       DATE-WRITTEN.  MAY, 1990.                                        00000400
       DATE-COMPILED.                                                   00000500
                                                                        00000600
      *REMARKS.     THIS PROGRAM CONTROLS THE ID PAYMENT RELEASE SCREEN.00000700
      *                                                                 00000800
      *             EACH SCREEN HAS ONE DE RECORD ASSOCIATED TO IT.     00000900
      *                                                                 00001000
      *************  P R O G R A M   U P D A T E   L O G  **************00001100
      *                                                                *00001200
      * DATE     PRG LVL VR SMR      REASON                            *00001300
      *                                                                *00001400
      * 06/03/91     182 C0          ACTS IMPLEMENATION                *00001500
      *                                                                *00001600
      * 09/06/91 SLT 184 C1 ACTS0288 NOT ALL ADMN VALUES ARE BEING     *00001700
      *                                BROUGHT OVER FROM THE ASPR REC  *00001800
      *                                                                *00001900
      * 12/31/91 SLT 185 C2 ACTS0352 CHANGE \EFAULT INTEREST % FROM    *00002000
      *                                6.25% TO 6.00%                  *00002100
      *                                                                *00002200
      * 03/13/92 BKS 187 C3 ACTS0239 MM/HS EOB - VALID WORKSHEET CODES *00002300
      *                                                                 00002400
      * 06/26/92 SLT 193 C4 ACTS0323 INCREASE THE SIZE OF THE PRS REC  *00002500
      *                                IN THE TRX REGISTER FILE        *00002600
      *                     ACTS0019 FIELD NAMES INCORRECT FOR ADJ     *00002700
      *                              **  COBOL II  **                  *00002800
      *                                                                *00002900
      * 09/04/92 BKS 201 C5 ACTS0085 DO NOT ALLOW NEGATIVE COVERAGE TYP*00003000
      *                                TO BE RELEASED AS SEPERATE PYMT *00003100
      *                                AND DO NOT ALLOW ZERO COVERAGE  *00003200
      *                                TO BE RELEASED TO ASBN AND      *00003300
      *                                PREVENT COVERAGE FROM DISPLAYING*00003400
      *                                TWICE                           *00003500
      *                     ACTS0423 REMOVE WORKSHEET MESSAGE FIELDS   *00003600
      *                                FROM ASPD (ID) AND MOVE TO ASBD *00003700
      *                     ACTS0426 ID EOB: EXPAND BP FROM 325 TO 525 *00003800
      *                                                                *00003900
      * 10/09/92 SLT 202 C6 ACTS0434 ALLOW PROCESSING OF MSL POLICIES  *00004000
      *                                                                *00004100
      * 01/01/93 SLT 203 C7 ACTS0526 CHANGE DEFAULT INTEREST % FROM    *00004200
      *                                6.00% TO 5.00%                  *00004300
      *                                                                *00004400
      * 01/03/94 BKS 204 C8 ACTS0669 CHANGE DEFAULT INTEREST % FROM    *00004500
      *                                5.00% TO 4.50%                  *00004600
      *                                                                *00004700
      * 12/31/94 SLT 206 C9 ACTS0740 EDUCATOR'S MUTUAL                 *00004800
      *                                                                *00004900
      * 02/23/95 SLT 209 C0 ACTS0753 GROUP EDUCATOR'S MUTUAL           *00005000
      *                     ACTS0546 ABEND IF PF9 PRESSED BEFORE PF6   *00005100
      *                                                                *00005200
      * 03/07/95 SLT 210 C1 ACTS0758 SKIP VALIDATION FOR MSL CLAIMS    *00005300
      *                                PAYING LIENREF ONLY             *00005400
      *                                                                *00005500
      * 00/00/00 BKS 211 C2 ACTS0754 LANMARK INTERFACE (ANNUITY)       *00005600
      *                                                                *00005700
      * 01/01/96 SLJ 212 C3 ACTS0805 CHANGE DEFAULT INTEREST % FROM    *00005800
      *                                4.50% TO 4.00%                  *00005900
      *                                                                *00006000
      * 08/15/96 SLJ 213 C5 ACTS0618 ADD REVERSAL REASON CODES         *00006100
      *                                                                *00006200
      * 06/00/97 RMR 000 C6 ACTS0838 ADD CV-DENIED CHECK AND INITIALIZE*00006300
      *                              IN PARA 1112B-.                   *00006400
      *                                                                *00006500
      * 06/16/98 EAB     XX ACTS0881 MADE CHANGES TO INCOOPORATE STATE *00006600
      *                              LIFE, UL, AND VUL.  THIS IS DONE  *00006700
      *                              IN ADDITION TO CONVERSION TO Y2K. *00006800
      *                                                                *00006900
      * 08/17/00 JGP 216 C6 ACTS0914 FIXED ANNUITIES ON CYBERLIFE      *00007000
      *                                                                *00007100
      * 08/22/01 BKS     C8 ACTS0926 NEW SL TREM ON CL / ISL CONV TO CL*00007200
      *                                                                *00007300
      * 12/31/02 PAM     C8 ACTS0992 CHANGE DEFAULT INTEREST % FROM    *00007400
      *                                4.00% TO 3.50%                  *00007500
      *                                                                *00007600
      * 02/21/03 BKS     C6 ACTS0982 SEND CORRECT INITIALS TO GSYS     *00007700
      *                               BY CHECKING CL-BASIC             *00007800
      *                              PROCESS CANNOT BE REVERSED/ADJUSTD*00007900
      *                               SO THERE IS NO NEED TO ADD GSYS  *00008000
      *                               REV AND ADJ ACCOUNTING LIKE PYMTS*00008100
      *                              BUILD DEBIT ACCOUNTING TO STATELIFE00008200
      *                               FOR PLANCODE SLT10, SLT15, SLT15P*00008300
      *                               SLT20, SLT20P                    *00008400
      *                                                                *00008500
      * 03/04/03 BKS     C5 ACTS1000 STOP GSYS ACCOUNTING  SLU POLICIES*00008600
      *                              - CREATE ACCOUNTING FOR SLA & SLT *00008700
      *          PAM     C5 ACTS1005 ADD LOGIV FOR SLUNI, STATE LIFE   *00008800
      *                              - UNIMASTER                       *00008900
      * 04/21/03 PAM        ACTS1009 ADD SLCOI FOR WS-VALID-NON-COV    *00009000
      * 04/22/03 PAM        ACTS1004 ENHANCE DOC FOR WS-COVERAGES      *00009100
      *                                                                *00009200
AC1033* 12/11/03 BKS        ACTS1033 INTEREST % DEFAULT CHG TO 3.0%    *00009300
AC1033*                              --CHANGE ALSO REQUIRED IN D681BN00*00009400
AC1033*                              --USE SAME % FOR ALL COMPANIES    *00009500
AC1033*                              --IND CLAIMS WILL MAKE CHANGES    *00009600
AC1033*                                BASED ON COMPANY REQUIREMENTS   *00009700
AC1043*                                                                *00009800
AC1043* 06/15/04 BKS        ACTS1043 CL PRODUCTS PREVIOUSLY ON ALIS    *00009900
AC1043*                                                                *00010000
#7549 * 10/05/07 BKS        #7549 CHANGE GSYS 105 ACCOUNT TO 108       *00010100
AC8838*                                                                *00010200
AC8838* 02/12/09 RWL        CHECK RECOD CODE BEFORE ALLOWING DELETE    *00010300
AC9430*                                                                *00010400
AC9430* 05/20/10 BKS  PROJ00002519-AC9430 LIFE PRO CONVERSION TO CL    *00010500
AC9430*                                   ALLOW COMPANY PML ON ACTS    *00010600
AC9430*                                                                *00010700
A11017* 06/04/13 BKS  PROJ00007835-AC11017 CHRONIC/TERMINAL ILLNESS    *00010800
A11017*                                   ALLOW NON COVERAGE PLANS     *00010900
A11017*                                                                *00011000
A11064* 07/19/13 BKS  PROJ00009657-AC11064 CHG INT DEFAULT TO 0.80%    *00011100
A11064*                              --CHANGE ALSO REQUIRED IN D681BN00*00011200
A11064*                                                                *00011300
A11065* 08/05/13 BKS  PROJ00009658-AC11065 ALLOW ANNUITY INTEREST      *00011400
A11065*                                                                *00011500
A11313* 04/07/14 BKS  PROJ00009867-AC11313 WARNING MESSAGE FBRSTAT=49  *00011600
A11313*                                     ADMNSTSI = 'AN'            *00011700
A11313*                                                                *00011800
A11641* 04/28/15 BKS  PROJ00011772-AC11641 CHG INT DEFAULT TO 0.50%    *00011900
A11641*                              --CHANGE ALSO REQUIRED IN D681BN00*00012000
A11641*                                                        M684RP10*00012100
A11641*                                                                *00012200
A12612* 09/22/17 SEC CHG0039890-AC12612   ADD PUA AS WS-VALID-NON-COV  *00012300
A13016* 10/15/18 DLC PROJ00013780 A13016  INIT NEW TAX FIELDS ON BP REC*00012400
A13126* 12/27/18 AMS CHG0048137 - REQ0090181 CHG INT DEFAULT TO 1.00%  *00012500
A13126*                              --CHANGE ALSO REQUIRED IN D681BN00*00012600
A13126*                                                        M684RP10*00012700
A13126*                                                                *00012800
Q16162* 07/07/22 NIA  CHG0071446 - Q16162 ACTS DEATH CLAIM MODIFICATION*00012900
Q16162*                                   REMOVE U107 TRANSACTIONS THAT*00013000
Q16162*                                   ACTS SENDS TO CL THRU BATCH  *00013100
Q16162*                                   FOR FIXED ANNUITIES          *00013200
Q17189*                                                                 00013300
Q17189* 06/21/25 SHA  PRJ0124109 - Q17189 - ADDED IF CONDITION TO AVOID*00013500
Q17189*               OUT OF RANGE ABEND.                              *00013600
      *************  P R O G R A M   U P D A T E   L O G  **************00013700
                                                                        00013800
       ENVIRONMENT DIVISION.                                            00013900
                                                                        00014000
       DATA DIVISION.                                                   00014100
                                                                        00014200
       WORKING-STORAGE SECTION.                                         00014300
                                                                        00014400
       01  FILLER                             PIC X(38)  VALUE          00014500
           'WORKING STORAGE STARTS HERE - D681PD01'.                    00014600
                                                                        00014700
      *  SYMBOLIC MAPS                                                  00014800
       COPY D682TIT.                                                    00014900
                                                                        00015000
       COPY D682HDR.                                                    00015100
                                                                        00015200
       COPY D682PFK.                                                    00015300
                                                                        00015400
       COPY D682HLP.                                                    00015500
                                                                        00015600
       COPY D682PD1.                                                    00015700
                                                                        00015800
       COPY D682PD7.                                                    00015900
       EJECT                                                            00016000
      *  RECORD LAYOUTS                                                 00016100
       COPY D685AK00.                                                   00016200
                                                                        00016300
       COPY D685BN00.                                                   00016400
                                                                        00016500
       COPY D685BP00.                                                   00016600
                                                                        00016700
       COPY D685CL00.                                                   00016800
                                                                        00016900
       COPY D685CT00.                                                   00017000
                                                                        00017100
       COPY D685CV00.                                                   00017200
                                                                        00017300
       COPY D685DE00.                                                   00017400
                                                                        00017500
       COPY D685DI00.                                                   00017600
                                                                        00017700
       COPY D685PR00.                                                   00017800
                                                                        00017900
       COPY D685PC00.                                                   00018000
                                                                        00018100
       COPY D685MSGF.                                                   00018200
                                                                        00018300
       COPY D685PI00.                                                   00018400
       EJECT                                                            00018500
      * GSYS RECORD LAYOUT                                              00018600
       COPY D686GSYS.                                                   00018700
                                                                        00018800
      * VALID REMARK/WORKSHEET CODES                                    00018900
       COPY D686MSGD.                                                   00019000
                                                                        00019100
      *  VALIDATION WS AREA                                             00019200
       COPY D686VALD.                                                   00019300
                                                                        00019400
      *  PLAN CODE PROGRAM CALLING AREA                                 00019500
       COPY D686PLAN.                                                   00019600
                                                                        00019700
      *  POLICY NUMBER DIVIDE                                           00019800
       COPY D686PDIV.                                                   00019900
                                                                        00020000
      *  HELP SCREEN FIELDS                                             00020100
       COPY D686HELP.                                                   00020200
                                                                        00020300
      *  REPORT LAYOUTS                                                 00020400
       COPY D686TRXG.                                                   00020500
                                                                        00020600
       COPY D686TRXU.                                                   00020700
                                                                        00020800
       COPY D686TRXP.                                                   00020900
                                                                        00021000
      *  THERE ARE 18 TRX HOLD QUEUES BECAUSE THERE ARE 18 POSSIBLE     00021100
      *    TRX REG RECORDS                                              00021200
       01  WS-TRX-HOLD-QUEUE.                                           00021300
           05  WS-TRX-HOLD-NUM               PIC S9(4)  COMP            00021400
                                             VALUE +0.                  00021500
           05  WS-TRX-HOLD                   PIC X(210)                 00021600
                                             OCCURS 18 TIMES.           00021700
       EJECT                                                            00021800
      *  CICS WORKING FIELDS                                            00021900
       COPY D686CICS.                                                   00022000
       01  WS-PLCD-LENGTH                     PIC S9(4) COMP            00022100
                                              VALUE +80.                00022200
                                                                        00022300
      *  PF KEYS                                                        00022400
       COPY DFHAID.                                                     00022500
                                                                        00022600
      *  ATTRIBUTES AND COLORS                                          00022700
       COPY D686ATTR.                                                   00022800
                                                                        00022900
      *  MESSAGE FIELDS                                                 00023000
       COPY D686MSGS.                                                   00023100
                                                                        00023200
      *  MESSAGE LITERALS                                               00023300
       COPY D686MSGX.                                                   00023400
                                                                        00023500
       EJECT                                                            00023600
      *  FLAGS                                                          00023700
       COPY D686FLAG.                                                   00023800
       01  WS-FIRST-PYMT-FLAG                PIC X VALUE 'Y'.           00023900
           88  WS-FIRST-PYMT                 VALUE 'Y'.                 00024000
       01  WS-REBUILD-FLAG                   PIC X VALUE ' '.           00024100
           88  WS-REBUILD                    VALUE 'Y'.                 00024200
       01  WS-COV-EXISTS-FLAG                PIC X VALUE ' '.           00024300
           88  WS-COV-EXISTS                 VALUE 'Y'.                 00024400
       01  WS-END-1-FLAG                     PIC X VALUE ' '.           00024500
           88  WS-END-1                      VALUE 'Y'.                 00024600
                                                                        00024700
       01  WS-WORK-AREA.                                                00024800
           05  WS-WORK-YEAR                 PIC 9(3).                   00024900
           05  WS-ZERO-COV-AMT-FLAG         PIC X.                      00025000
               88  WS-ZERO-COV-AMT          VALUE 'Y'.                  00025100
           05  WS-DI-AK-CLM-NUM.                                        00025200
               10  WS-DI-CT-NUM             PIC X(8).                   00025300
               10  FILLER                   PIC X(5)                    00025400
                                            VALUE '00000'.              00025500
           05  WS-FIELD-RESULT-SWITCH        PIC 9 VALUE 0.             00025600
               88  FIELD-IS-VALID            VALUE 0.                   00025700
               88  FIELD-HAS-INVALID-FORMAT  VALUE 1.                   00025800
               88  FIELD-IS-NOT-NUMERIC      VALUE 2.                   00025900
           05  WS-SL-GROUP-LIFE-SWITCH       PIC X(1)  VALUE SPACES.    00026000
               88  WS-SL-GROUP-LIFE                    VALUE 'Y'.       00026100
           05  WS-GSYS-DIVIDE-BY             PIC S9(3).                 00026200
           05  WS-GSYS-EXTRA-CENTS           PIC S9(3)V9(2).            00026300
           05  WS-ACTS-AMOUNT                PIC S9(9)V9(2).            00026400
           05  WS-GSYS-SPLIT-AMOUNT          PIC S9(9)V9(2).            00026500
           05  WS-GSYS-TOTAL-BEN             PIC S9(9)V9(2).            00026600
           05  WS-GSYS-H04-COUNT             PIC S9(3).                 00026700
           05  WS-AMOUNT-IN-AREA             PIC X(14) JUST RIGHT.      00026800
           05  FILLER                                                   00026900
               REDEFINES WS-AMOUNT-IN-AREA.                             00027000
               10  WS-AMOUNT-IN-1            PIC 999.                   00027100
               10  FILLER                    PIC X.                     00027200
               10  WS-AMOUNT-IN-2            PIC 999.                   00027300
               10  FILLER                    PIC X.                     00027400
               10  WS-AMOUNT-IN-3            PIC 999.                   00027500
               10  FILLER                    PIC X.                     00027600
               10  WS-AMOUNT-IN-4            PIC 99.                    00027700
           05  FILLER                                                   00027800
               REDEFINES WS-AMOUNT-IN-AREA.                             00027900
               10  WS-AMOUNT-IN-SINGLE       PIC X                      00028000
                                             OCCURS 14 TIMES.           00028100
           05  WS-AMOUNT-ONLY-DECIMAL.                                  00028200
               10  WS-AMOUNT-OD-1            PIC 999.                   00028300
               10  WS-AMOUNT-OD-2            PIC 999.                   00028400
               10  WS-AMOUNT-OD-3            PIC 999.                   00028500
               10  FILLER                    PIC X.                     00028600
               10  WS-AMOUNT-OD-4            PIC 99.                    00028700
           05  WS-AMOUNT-NO-COMMAS-SIGNED    PIC S9(9)V99               00028800
                                             VALUE +0.                  00028900
           05  WS-AMOUNT-NO-COMMAS           PIC 9(9)V99.               00029000
           05  FILLER                                                   00029100
               REDEFINES WS-AMOUNT-NO-COMMAS.                           00029200
               10  WS-AMOUNT-1               PIC 999.                   00029300
               10  WS-AMOUNT-2               PIC 999.                   00029400
               10  WS-AMOUNT-3               PIC 999.                   00029500
               10  WS-AMOUNT-4               PIC 99.                    00029600
           05  FILLER                                                   00029700
               REDEFINES WS-AMOUNT-NO-COMMAS.                           00029800
               10  WS-AMOUNT-SINGLE          PIC X                      00029900
                                             OCCURS 11 TIMES.           00030000
           05  WS-COMPARE-DT-1.                                         00030100
               10  WS-COMPARE-YR-1           PIC 9999.                  00030200
               10  WS-COMPARE-MO-1           PIC 99.                    00030300
               10  WS-COMPARE-DY-1           PIC 99.                    00030400
           05  WS-COMPARE-DT-2.                                         00030500
               10  WS-COMPARE-YR-2           PIC 9999.                  00030600
               10  WS-COMPARE-MO-2           PIC 99.                    00030700
               10  WS-COMPARE-DY-2           PIC 99.                    00030800
           05  WS-DE-SUB                     PIC 9(02) VALUE ZEROES.    00030900
           05  WS-LOINTRF-AMT                PIC 9(09)V99 COMP-3        00031000
                                                  VALUE ZEROES.         00031100
                                                                        00031200
      *  OUTPUT FORMAT FIELDS                                           00031300
       01  WS-FORMAT-FIELDS.                                            00031400
           05  WS-DATE-FORMAT.                                          00031500
               10  WS-DATE-FORMAT-1          PIC XX.                    00031600
               10  FILLER                    PIC X     VALUE '-'.       00031700
               10  WS-DATE-FORMAT-2          PIC XX.                    00031800
               10  FILLER                    PIC X     VALUE '-'.       00031900
               10  WS-DATE-FORMAT-3          PIC X(4).                  00032000
           05  WS-AMOUNT-9-2                 PIC ZZZ,ZZZ,ZZ9.99.        00032100
           05  WS-AMOUNT-9-2-SIGNED          PIC ZZZ,ZZZ,ZZ9.99-.       00032200
                                                                        00032300
       01  WS-SCREEN-TITLE.                                             00032400
           05  FILLER                        PIC X(10)                  00032500
                                             VALUE SPACES.              00032600
           05  FILLER                        PIC X(26)                  00032700
               VALUE 'ID PROCEEDS         AS OF '.                      00032800
           05  WS-AS-OF-DATE.                                           00032900
               10  WS-AS-OF-MO               PIC 99.                    00033000
               10  FILLER                    PIC X VALUE '-'.           00033100
               10  WS-AS-OF-DY               PIC 99.                    00033200
               10  FILLER                    PIC X VALUE '-'.           00033300
               10  WS-AS-OF-YR               PIC 9999.                  00033400
           10  FILLER                        PIC X(11)                  00033500
                                             VALUE SPACES.              00033600
                                                                        00033700
       01  WS-RECORD.                                                   00033800
           05  WS-RECORD-AREA.                                          00033900
               10  WS-RECORD-KEY             PIC X(37)                  00034000
                                             VALUE SPACES.              00034100
               10  WS-RECORD-INFO            PIC X(4531)                00034200
                                             VALUE SPACES.              00034300
                                                                        00034400
       01  WS-ORG-RECORD-CL.                                            00034500
           05  WS-ORG-RECORD-CL-KEY          PIC X(37)                  00034600
                                             VALUE SPACES.              00034700
           05  WS-ORG-RECORD-CL-INFO         PIC X(493)                 00034800
                                             VALUE SPACES.              00034900
       01  WS-ORG-RECORD-DE.                                            00035000
           05  WS-ORG-RECORD-DE-KEY          PIC X(37)                  00035100
                                             VALUE SPACES.              00035200
           05  WS-ORG-RECORD-DE-INFO         PIC X(663)                 00035300
                                             VALUE SPACES.              00035400
                                                                        00035500
       01  WS-CUR-RECORD-CL.                                            00035600
           05  WS-CUR-RECORD-CL-KEY          PIC X(37)                  00035700
                                             VALUE SPACES.              00035800
           05  WS-CUR-RECORD-CL-INFO         PIC X(493)                 00035900
                                             VALUE SPACES.              00036000
       01  WS-CUR-RECORD-DE.                                            00036100
           05  WS-CUR-RECORD-DE-KEY          PIC X(37)                  00036200
                                             VALUE SPACES.              00036300
           05  WS-CUR-RECORD-DE-INFO         PIC X(663)                 00036400
                                             VALUE SPACES.              00036500
                                                                        00036600
       01  WS-COMMAREA.                                                 00036700
           05  WS-PYMT-PROT-FLAG                 PIC X  VALUE SPACES.   00036800
               88  WS-PYMT-PROT                  VALUE 'Y'.             00036900
           05  WS-DISPLAY-TOTAL                  PIC S9(4)   COMP.      00037000
           05  WS-DISPLAYED-RECORD-KEY           PIC X(37).             00037100
           05  FILLER REDEFINES WS-DISPLAYED-RECORD-KEY.                00037200
               10  FILLER                        PIC X(34).             00037300
               10  WS-DISPLAYED-REC-NUM          PIC XXX.               00037400
           05  WS-HELP-SCREEN-FIRST-REC-KEY      PIC X(12).             00037500
           05  WS-HELP-SCREEN-LAST-REC-KEY       PIC X(12).             00037600
           05  WS-HELP-SCREEN-RECORD.                                   00037700
               10  WS-HELP-SCREEN-ITEM-NUM       PIC S9(4) COMP         00037800
                                                 VALUE +0.              00037900
           05  WS-DISPLAY-RECORD.                                       00038000
               10  WS-DISPLAY-ITEM-NUM           PIC S9(4) COMP         00038100
                                                 VALUE +0.              00038200
               10  WS-DISPLAY-RECORD-LENGTH      PIC S9(4) COMP         00038300
                                                 VALUE +960.            00038400
           05  WS-MSG-RECORD.                                           00038500
               10  WS-MSG-ITEM-NUM               PIC S9(4) COMP         00038600
                                                 VALUE +0.              00038700
               10  WS-MSG-RECORD-LENGTH          PIC S9(4) COMP         00038800
                                                 VALUE +258.            00038900
           05  WS-HOLD-SCREEN-RECORD.                                   00039000
               10  WS-HOLD-SCREEN-ITEM-NUM       PIC S9(4) COMP         00039100
                                                 VALUE +0.              00039200
               10  WS-HOLD-SCREEN-RECORD-LENGTH  PIC S9(4) COMP         00039300
                                                 VALUE +850.            00039400
           05  WS-BN-RECORD.                                            00039500
               10  WS-BN-ITEM-NUM                PIC S9(4) COMP         00039600
                                                 VALUE +0.              00039700
               10  WS-BN-RECORD-LENGTH           PIC S9(4) COMP         00039800
                                                 VALUE +110.            00039900
           05  WS-BP-RECORD.                                            00040000
               10  WS-BP-ITEM-NUM                PIC S9(4) COMP         00040100
                                                 VALUE +0.              00040200
               10  WS-BP-RECORD-LENGTH           PIC S9(4) COMP         00040300
                                                 VALUE +525.            00040400
           05  WS-CL-RECORD.                                            00040500
               10  WS-CL-ITEM-NUM                PIC S9(4) COMP         00040600
                                                 VALUE +0.              00040700
               10  WS-CL-RECORD-LENGTH           PIC S9(4) COMP         00040800
                                                 VALUE +530.            00040900
           05  WS-CT-RECORD.                                            00041000
               10  WS-CT-ITEM-NUM                PIC S9(4) COMP         00041100
                                                 VALUE +0.              00041200
               10  WS-CT-RECORD-LENGTH           PIC S9(4) COMP         00041300
                                                 VALUE +450.            00041400
           05  WS-CV-RECORD.                                            00041500
               10  WS-CV-ITEM-NUM                PIC S9(4) COMP         00041600
                                                 VALUE +0.              00041700
               10  WS-CV-RECORD-LENGTH           PIC S9(4) COMP         00041800
                                                 VALUE +550.            00041900
           05  WS-DE-RECORD.                                            00042000
               10  WS-DE-ITEM-NUM                PIC S9(4) COMP         00042100
                                                 VALUE +0.              00042200
               10  WS-DE-RECORD-LENGTH           PIC S9(4) COMP         00042300
                                                 VALUE +700.            00042400
           05  WS-DI-RECORD.                                            00042500
               10  WS-DI-ITEM-NUM                PIC S9(4) COMP         00042600
                                                 VALUE +0.              00042700
               10  WS-DI-RECORD-LENGTH           PIC S9(4) COMP         00042800
                                                 VALUE +190.            00042900
           05  WS-PR-RECORD.                                            00043000
               10  WS-PR-ITEM-NUM                PIC S9(4) COMP         00043100
                                                 VALUE +0.              00043200
               10  WS-PR-RECORD-LENGTH           PIC S9(4) COMP         00043300
                                                 VALUE +690.            00043400
           05  WS-PI-RECORD.                                            00043500
               10  WS-PI-ITEM-NUM                PIC S9(4) COMP         00043600
                                                 VALUE +0.              00043700
               10  WS-PI-RECORD-LENGTH           PIC S9(4) COMP         00043800
                                                 VALUE +350.            00043900
                                                                        00044000
       01  WS-TS-QUEUE.                                                 00044100
           05  WS-TS-SYS-ID                  PIC XXXX                   00044200
                                             VALUE 'ACTS'.              00044300
           05  WS-TERM-ID                    PIC XXXX.                  00044400
                                                                        00044500
       01  WS-DISPLAY-AREA.                                             00044600
           05  WS-DISPLAY-LINE               OCCURS 16 TIMES.           00044700
               10  WS-DISPLAY-OCCUR          PIC S999  COMP.            00044800
               10  WS-DISPLAY-SELECTED       PIC X.                     00044900
                   88  WS-DISPLAY-SEL        VALUE 'X'.                 00045000
               10  WS-DISPLAY-NEW-COV        PIC XXX.                   00045100
               10  WS-DISPLAY-STS            PIC XX.                    00045200
               10  WS-DISPLAY-COVERAGE       PIC X(15).                 00045300
               10  WS-DISPLAY-PLAN-CODE      PIC X(7).                  00045400
               10  WS-DISPLAY-AMT            PIC S9(9)V99  COMP-3.      00045500
               10  WS-DISPLAY-REV            PIC S9(9)V99  COMP-3.      00045600
               10  WS-DISPLAY-RC             PIC XX.                    00045700
                                                                        00045800
       01  WS-EDIT-FIELDS.                                              00045900
           05  WS-EDIT-RC                    PIC XX.                    00046000
               88  WS-VALID-RC               VALUES 'A' 'D' 'E'         00046100
                                                    'F' 'G' ' '         00046200
                                                    'H' 'K' 'L'         00046300
                                                    'M' 'N' 'O'         00046400
                                                    'S'.                00046500
           05  WS-EDIT-CLM-STS               PIC XX.                    00046600
               88  WS-VALID-CLM-STS          VALUES  'DN' 'IV' 'LT'     00046700
                   'PN' 'PY' 'PD'.                                      00046800
           05  WS-EDIT-COVERAGE              PIC X(7).                  00046900
               88  WS-VALID-NON-COV                                     00047000
                     VALUE     'ANNTADD'                                00047100
                               'ARLNINT'                                00047200
                               'AVAILCV'                                00047300
                               'CASHDIV'                                00047400
                               'COI    '                                00047500
A11017                         'ADBCHR '                                00047600
A11017                         'ADBCHRG'                                00047700
A11017                         'ADBTIR '                                00047800
                               'DIVDEP '                                00047900
                               'DIVDINT'                                00048000
                               'DPFINT '                                00048100
                               'DPF1   '                                00048200
                               'DPF2   '                                00048300
                               'GROSSCV'                                00048400
                               'GUADEP '                                00048500
                               'GUADINT'                                00048600
                               'LIEN   '                                00048700
                               'LIENINT'                                00048800
                               'LIENREF'                                00048900
                               'LEINTRF'                                00049000
                               'LOAD   '                                00049100
                               'LOAN   '                                00049200
                               'LOANINT'                                00049300
                               'LOANREF'                                00049400
                               'LOINTRF'                                00049500
                               'MADJDB '                                00049600
                               'MADJCR '                                00049700
                               'PDF    '                                00049800
                               'PDFINT '                                00049900
                               'PMDIV  '                                00050000
                               'PRCRGIN'                                00050100
                               'PREMREF'                                00050200
                               'PRMCHRG'                                00050300
                               'PRMREDD'                                00050400
                               'PRORATD'                                00050500
                               'PRORATG'                                00050600
A12612                         'PUA    '                                00050700
                               'SLDAGE '                                00050800
                               'SLCADG '                                00050900
AC1009                         'SLCOI  '                                00051000
                               'SL210  '                                00051100
                               'SLREF  '                                00051200
                               'SETTLED'                                00051300
                               'TRMDEP '.                               00051400
               88  WS-NEG-NON-COV            VALUE 'ARLNINT' 'LOAN   '  00051500
                     'LIEN   ' 'LIENINT' 'PRCRGIN' 'PRMCHRG' 'CASHDIV'  00051600
A11017               'ADBCHR ' 'ADBCHRG' 'ADBTIR '                      00051700
                     'MADJDB ' 'LOANINT' 'SLCAGE '.                     00051800
AC1004****  THE FOLLOWING 88'S ARE NOT REFERENCED IN THIS PROGRAM, BUT  00051900
AC1004****  ARE AN ATTEMPT TO DOCUMENT VALID COVERAGES BY PLAN.         00052000
               88  WS-VALID-NON-COV-UL       VALUE 'AVAILCV' 'GROSSCV'  00052100
                     'COI    '.                                         00052200
               88  WS-POS-NON-COV            VALUE 'MADJDB ' 'COI    '  00052300
                     'MADJCR ' 'DIVDEP ' 'DIVDINT' 'PDF    ' 'PDFINT '  00052400
                     'PREMREF' 'PRMREDD' 'PRORATD' 'PRORATG' 'SETTLED'  00052500
                     'TRMDEP ' 'ANNTADD' 'DPFINT ' 'DPF1   ' 'DPF2   '  00052600
                     'GUADEP ' 'GUADINT' 'LOINTRF' 'LEINTRF' 'AVAILCV'  00052700
                     'GROSSCV' 'COI    ' 'MADJCR ' 'LOANREF' 'LIENREF'  00052800
                     'SLDAGE ' 'SL210  ' 'SLREF  ' 'PMDIV  '.           00052900
                                                                        00053000
       01  WS-GENERAL.                                                  00053100
           05  WS-TALLY                      PIC 99.                    00053200
           05  WS-PFKEY                      PIC X(8)                   00053300
                                             OCCURS 24 TIMES.           00053400
           05  WS-PFK-SUB                    PIC S9999 COMP             00053500
                                             VALUE +1.                  00053600
           05  WS-SUB                        PIC S9(4) COMP             00053700
                                             VALUE +1.                  00053800
           05  WS-SUB-2                      PIC S9(4) COMP             00053900
                                             VALUE +1.                  00054000
           05  WS-SUB-3                      PIC S9(4) COMP             00054100
                                             VALUE +1.                  00054200
           05  WS-SUB-4                      PIC S9(4) COMP             00054300
                                             VALUE +1.                  00054400
           05  WS-SUB-COV                    PIC S9(4) COMP             00054500
                                             VALUE +1.                  00054600
           05  WS-SUB-DISPLAY                PIC S9(4) COMP             00054700
                                             VALUE +1.                  00054800
           05  WS-SUB-PR-OCCUR               PIC S999  COMP.            00054900
           05  WS-DISPLAY-ADJUST             PIC S9(4) COMP             00055000
                                             VALUE +0.                  00055100
           05  WS-HOLD-BP-REC-NUM            PIC 999.                   00055200
           05  WS-HOLD-CV-REC-NUM            PIC 999.                   00055300
           05  WS-BUILD-PAGE-IND             PIC 99                     00055400
                                             VALUE ZEROES.              00055500
               88  WS-BUILD-PAGE-1           VALUE 1.                   00055600
               88  WS-BUILD-PAGE-2           VALUE 2.                   00055700
               88  WS-BUILD-PAGE-3           VALUE 3.                   00055800
           05  WS-HOLD-KEY                   PIC X(37).                 00055900
           05  WS-DISPLAY-AMT-ORG            PIC S9(9)V99  COMP-3       00056000
                                             VALUE +0.                  00056100
           05  WS-DISPLAY-AMT-REV            PIC S9(9)V99  COMP-3       00056200
                                             VALUE +0.                  00056300
           05  WS-PLCD-REC-LENGTH            PIC S9(4) COMP             00056400
                                             VALUE +80.                 00056500
           05  WS-PLCD-PARTIAL-KEY           PIC S9(4) COMP             00056600
                                             VALUE +3.                  00056700
           05  WS-HOLD-DENTY                 PIC X.                     00056800
           05  WS-TOTAL-PCT-BEN              PIC S9V9999  COMP-3        00056900
                                             VALUE +0.                  00057000
           05  WS-INT-PCT-DEFAULT            PIC S9V9999    COMP-3      00057100
A13126                                       VALUE +0.0100.             00057200
A13126*A11641                                VALUE +0.0050.             00057300
A11641*A11065                                VALUE +0.0080.             00057400
AC1033*                                      VALUE +0.0300.             00057500
      *                                      VALUE +0.0400.             00057600
      *                                      VALUE +0.0450.             00057700
      *                                      VALUE +0.0500.             00057800
      *                                      VALUE +0.0600.             00057900
      *                                      VALUE +0.0625.             00058000
           05  WS-HOLD-MST-KEY.                                         00058100
               10  FILLER                    PIC X(34).                 00058200
               10  WS-HOLD-REC-NUM           PIC 999.                   00058300
           05  WS-HOLD-DE-INFO               PIC X(663).                00058400
           05  WS-REC-NUM-AREA.                                         00058500
               10  FILLER                    PIC XX  VALUE '- '.        00058600
               10  WS-REC-NUM                PIC XXX.                   00058700
           05  WS-DELETE-TABLE               OCCURS 16 TIMES.           00058800
               10  WS-DELETE-OCCUR           PIC X.                     00058900
                   88  WS-DELETE             VALUE 'Y'.                 00059000
           05  WS-NON-COV-ADMN-VALUES-TABLE  PIC X(32).                 00059100
           05  FILLER    REDEFINES WS-NON-COV-ADMN-VALUES-TABLE         00059200
                                             OCCURS 16 TIMES.           00059300
               10  WS-NON-COV-FLAG           PIC X.                     00059400
                   88  WS-NON-COV            VALUE 'Y'.                 00059500
               10  WS-NON-COV-DISP-FLAG      PIC X.                     00059600
                   88  WS-NON-COV-DISP       VALUE 'Y'.                 00059700
           05  WS-TOTAL-BEN-AMT              PIC S9(9)V99  COMP-3       00059800
                                             VALUE +0.                  00059900
           05  WS-MISSING-PENNIES            PIC S9(9)V99  COMP-3       00060000
                                             VALUE +0.                  00060100
           05  WS-TOTAL-NUM-OF-BENES         PIC S9(5)  COMP-3          00060200
                                             VALUE +0.                  00060300
           05  WS-PLAN-CODE-NOT-FOUND-FLAG   PIC X   VALUE SPACES.      00060400
               88  WS-PLAN-CODE-NOT-FOUND    VALUE 'Y'.                 00060500
           05  WS-MSL-LIENREF-CLAIM-FLAG     PIC X   VALUE SPACES.      00060600
               88  WS-MSL-LIENREF-CLAIM      VALUE 'Y'.                 00060700
           05  WS-HOLD-TIME                  PIC X(8).                  00060800
A11065     05  WS-CKDCARTH-DATE1             PIC X(8).                  00060900
A11065     05  WS-CKDCARTH-DATE2             PIC X(8).                  00061000
A11065     05  WS-CKDCARTH-DIFF.                                        00061100
A11065         10  WS-MONTHS-DIFF            PIC S999 COMP-3.           00061200
A11065         10  WS-DAYS-DIFF              PIC S999 COMP-3.           00061300
A11065         10  WS-YEARS-DIFF             PIC S999 COMP-3.           00061400
A11065     05  WS-CKDCARTH-ADD-CD            PIC X  VALUE 'A'.          00061500
A11065     05  WS-CKDCARTH-DIFF-CD           PIC X  VALUE 'D'.          00061600
A11065     05  WS-CKDCARTH-SUB-CD            PIC X  VALUE 'S'.          00061700
A11065                                                                  00061800
                                                                        00061900
       01  WS-MONTH-NAME-ENTRIES.                                       00062000
           05  FILLER                    PIC X(3) VALUE 'JAN'.          00062100
           05  FILLER                    PIC X(3) VALUE 'FEB'.          00062200
           05  FILLER                    PIC X(3) VALUE 'MAR'.          00062300
           05  FILLER                    PIC X(3) VALUE 'APR'.          00062400
           05  FILLER                    PIC X(3) VALUE 'MAY'.          00062500
           05  FILLER                    PIC X(3) VALUE 'JUN'.          00062600
           05  FILLER                    PIC X(3) VALUE 'JUL'.          00062700
           05  FILLER                    PIC X(3) VALUE 'AUG'.          00062800
           05  FILLER                    PIC X(3) VALUE 'SEP'.          00062900
           05  FILLER                    PIC X(3) VALUE 'OCT'.          00063000
           05  FILLER                    PIC X(3) VALUE 'NOV'.          00063100
           05  FILLER                    PIC X(3) VALUE 'DEC'.          00063200
                                                                        00063300
       01  WS-MONTH-NAME-TABLE REDEFINES WS-MONTH-NAME-ENTRIES.         00063400
           05  WS-MONTH-NAME             PIC X(3)                       00063500
               OCCURS 12 TIMES.                                         00063600
                                                                        00063700
      *  INSURANCE INITIALS SEARCH                                      00063800
       01  WS-INITIAL-SEARCH.                                           00063900
           05  WS-NAME-STRING.                                          00064000
               10  WS-NAME-STR OCCURS 30 TIMES       PIC X(01).         00064100
           05  WS-INIT-CNT                           PIC 9(02).         00064200
           05  WS-INITIAL-FOUND-SW                   PIC X(01).         00064300
               88  INITIALS-FOUND                      VALUE 'Y'.       00064400
           05  WS-INITIALS.                                             00064500
               10  WS-FIRST-INITIAL                  PIC X(01).         00064600
               10  WS-LAST-INITIAL                   PIC X(01).         00064700
                                                                        00064800
       01  FILLER                            PIC X(36) VALUE            00064900
           'WORKING STORAGE ENDS HERE - D681PD01'.                      00065000
                                                                        00065100
       LINKAGE SECTION.                                                 00065200
                                                                        00065300
       01  DFHCOMMAREA.                                                 00065400
       COPY D686COMM.                                                   00065500
                                                                        00065600
       PROCEDURE DIVISION.                                              00065700
                                                                        00065800
      ***********************************************************       00065900
      *                   M A I N L I N E                       *       00066000
      ***********************************************************       00066100
       0000-MAINLINE.                                                   00066200
                                                                        00066300
      *  SET TS QUEUE NAME                                              00066400
           MOVE EIBTRMID TO WS-TERM-ID.                                 00066500
                                                                        00066600
           MOVE CA-EST-POL-NUM TO WS-POLICY-NUM-AREA.                   00066700
                                                                        00066800
      *  CHECK TO SEE IF FIRST TIME ON THIS SCREEN                      00066900
           IF CA-PREV-SCREEN-ID NOT = 'PD01'                            00067000
               PERFORM 1000-FIRST-TIME                                  00067100
           ELSE                                                         00067200
               PERFORM 2000-REPEAT.                                     00067300
                                                                        00067400
       EJECT                                                            00067500
      ***********************************************************       00067600
      *                  F I R S T   T I M E                    *       00067700
      ***********************************************************       00067800
       1000-FIRST-TIME.                                                 00067900
                                                                        00068000
      *  ESTABLISH THE SCREEN TO BE BUILT                               00068100
           MOVE 1 TO WS-BUILD-PAGE-IND.                                 00068200
                                                                        00068300
      *  SET KEY TO BE DISPLAYED                                        00068400
           MOVE CA-AK-FILE-KEY TO WS-DISPLAYED-RECORD-KEY.              00068500
                                                                        00068600
      *  SET IND TO BUILD DISPLAY AREA                                  00068700
           MOVE 'Y' TO WS-REBUILD-FLAG.                                 00068800
                                                                        00068900
      *  READ THE DEATH REC FOR THE PAID TO DATE CHECK                  00069000
           MOVE WS-DI-ITEM-NUM TO CA-ITEM-NUM.                          00069100
           MOVE WS-DI-RECORD-LENGTH TO CA-RECORD-LENGTH.                00069200
      *  READ RECORD                                                    00069300
           MOVE 'RD' TO CA-ACCESS-TYPE.                                 00069400
           MOVE 'F' TO CA-READ-TYPE.                                    00069500
           MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                           00069600
                                 WS-DI-CT-NUM.                          00069700
           MOVE ZEROES TO CA-AK-POL-NUM.                                00069800
           MOVE WS-DI-AK-CLM-NUM TO CA-AK-CLM-NUM.                      00069900
           MOVE '01' TO CA-AK-REC-CODE.                                 00070000
           MOVE '001' TO CA-AK-REC-NUM.                                 00070100
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00070200
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00070300
           MOVE CA-ITEM-NUM TO WS-DI-ITEM-NUM.                          00070400
                                                                        00070500
      *  MOVE VALUES FROM MASTER RECORDS TO SCREEN MAPS                 00070600
           PERFORM 1100-BUILD-SCREEN.                                   00070700
                                                                        00070800
       EJECT                                                            00070900
      ***********************************************************       00071000
      *                B U I L D   S C R E E N                  *       00071100
      ***********************************************************       00071200
       1100-BUILD-SCREEN.                                               00071300
                                                                        00071400
      *  IF LAST REQUEST WAS NEW SEND BLANK SCREEN                      00071500
           IF CA-LAST-REQ-NEW                                           00071600
               MOVE +0 TO DE-BEN-OCCUR-NUM                              00071700
               PERFORM 1112-BUILD-VALUES THRU 1112-EXIT                 00071800
               PERFORM 1110-BUILD-PAGE THRU 1110-EXIT                   00071900
               PERFORM 8000-SEND-PAGE.                                  00072000
                                                                        00072100
      *  READ WS-DISPLAY-AREA FROM TS QUEUE IF IT EXISTS                00072200
           IF WS-DISPLAY-ITEM-NUM > 0                                   00072300
               MOVE WS-DISPLAY-ITEM-NUM TO CA-ITEM-NUM                  00072400
               MOVE WS-DISPLAY-RECORD-LENGTH TO CA-RECORD-LENGTH        00072500
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00072600
               MOVE WS-RECORD TO WS-DISPLAY-AREA.                       00072700
                                                                        00072800
      *  READ SELECTED RECORD                                           00072900
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00073000
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00073100
           MOVE 'RD' TO CA-ACCESS-TYPE.                                 00073200
           MOVE 'F' TO CA-READ-TYPE.                                    00073300
           MOVE WS-DISPLAYED-RECORD-KEY TO CA-AK-FILE-KEY.              00073400
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00073500
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00073600
           MOVE CA-ITEM-NUM TO WS-DE-ITEM-NUM.                          00073700
                                                                        00073800
      *  READ THE PAYMENT RECORD FROM TS                                00073900
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00074000
                                                                        00074100
      *  MOVE WS RECORD TO RECORD LAYOUT                                00074200
           MOVE WS-RECORD-INFO TO DE-INFO.                              00074300
                                                                        00074400
      *  IF LAST REQUEST WAS REV OR ADJ SET UP NEW RECORD               00074500
           IF CA-LAST-REQ-REV                                           00074600
               MOVE CA-SYSTEM-DATE TO DE-REC-ADD-DT                     00074700
               MOVE 'R' TO DE-TRX-IND                                   00074800
               MOVE CA-AK-REC-NUM TO DE-ORIG-REC-NUM                    00074900
               MOVE SPACES TO DE-PAID-EXAM                              00075000
                              DE-APROV                                  00075100
                              DE-REAS-CODE(1)                           00075200
                              DE-REAS-CODE(2)                           00075300
                              DE-REAS-CODE(3)                           00075400
                              DE-REAS-CODE(4)                           00075500
                              DE-REAS-CODE(5)                           00075600
                              DE-REAS-CODE(6)                           00075700
               MOVE +0 TO DE-TOT-BEN                                    00075800
               MOVE DE-INFO TO WS-RECORD-INFO                           00075900
               PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT.            00076000
                                                                        00076100
           IF CA-LAST-REQ-ADJ                                           00076200
               MOVE CA-SYSTEM-DATE TO DE-REC-ADD-DT                     00076300
               MOVE 'A' TO DE-TRX-IND                                   00076400
               MOVE CA-AK-REC-NUM TO DE-ORIG-REC-NUM                    00076500
               MOVE SPACES TO DE-PAID-EXAM                              00076600
                              DE-APROV                                  00076700
                              DE-REAS-CODE(1)                           00076800
                              DE-REAS-CODE(2)                           00076900
                              DE-REAS-CODE(3)                           00077000
                              DE-REAS-CODE(4)                           00077100
                              DE-REAS-CODE(5)                           00077200
                              DE-REAS-CODE(6)                           00077300
               MOVE +0 TO DE-TOT-BEN                                    00077400
               MOVE DE-INFO TO WS-RECORD-INFO                           00077500
               PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT.            00077600
                                                                        00077700
      *  BUILD COV DISPLAY AREA THEN RETURN TO DISPLAYED REC TO THE DE I00077800
           IF WS-REBUILD                                                00077900
               PERFORM 1112-BUILD-VALUES THRU 1112-EXIT                 00078000
               IF (DE-PAID-DT NUMERIC) AND (DE-PAID-DT NOT = ZEROES)    00078100
                   NEXT SENTENCE                                        00078200
               ELSE                                                     00078300
                   MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM                   00078400
                   MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH         00078500
                   MOVE 'RD' TO CA-ACCESS-TYPE                          00078600
                   MOVE 'F' TO CA-READ-TYPE                             00078700
                   MOVE WS-DISPLAYED-RECORD-KEY TO CA-AK-FILE-KEY       00078800
                   MOVE SPACES TO CA-ACCESS-MSG-CODE                    00078900
                   PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT       00079000
                   MOVE CA-ITEM-NUM TO WS-DE-ITEM-NUM.                  00079100
                                                                        00079200
      *  DETERMINE WHICH SCREEN SHOULD BE BUILT                         00079300
           PERFORM 1110-BUILD-PAGE.                                     00079400
                                                                        00079500
      *  END OF 1100-BUILD-SCREEN                                       00079600
       EJECT                                                            00079700
       1110-BUILD-PAGE.                                                 00079800
                                                                        00079900
      *  MOVE VALUES INTO THE SCREEN MAPS                               00080000
           IF WS-BUILD-PAGE-1                                           00080100
               PERFORM 1111-MOVE-VALUES-1 THRU 1111-EXIT                00080200
           ELSE                                                         00080300
               PERFORM 1113-MOVE-VALUES-2 THRU 1113-EXIT.               00080400
                                                                        00080500
      *  SET ERASE FLAG AND SEND SCREEN                                 00080600
           MOVE 'Y' TO WS-ERASE-SCREEN-FLAG.                            00080700
           PERFORM 8000-SEND-PAGE.                                      00080800
                                                                        00080900
       1110-EXIT.                                                       00081000
           EXIT.                                                        00081100
       EJECT                                                            00081200
       1111-MOVE-VALUES-1.                                              00081300
                                                                        00081400
           MOVE DE-REC-ADD-MO TO WS-DATE-FORMAT-1.                      00081500
           MOVE DE-REC-ADD-DY TO WS-DATE-FORMAT-2.                      00081600
           MOVE DE-REC-ADD-YR TO WS-DATE-FORMAT-3.                      00081700
           MOVE WS-DATE-FORMAT TO TRXADDTO.                             00081800
                                                                        00081900
           IF DE-REV                                                    00082000
               MOVE 'REV DT:' TO REVLABO                                00082100
               MOVE DE-REV-ADJ-MO TO WS-DATE-FORMAT-1                   00082200
               MOVE DE-REV-ADJ-DY TO WS-DATE-FORMAT-2                   00082300
               MOVE DE-REV-ADJ-YR TO WS-DATE-FORMAT-3                   00082400
               MOVE WS-DATE-FORMAT TO REVDTO                            00082500
               MOVE '**  REVERSAL  **' TO REVAREAO                      00082600
           ELSE IF DE-ADJ                                               00082700
               MOVE 'ADJ DT:' TO REVLABO                                00082800
               MOVE DE-REV-ADJ-MO TO WS-DATE-FORMAT-1                   00082900
               MOVE DE-REV-ADJ-DY TO WS-DATE-FORMAT-2                   00083000
               MOVE DE-REV-ADJ-YR TO WS-DATE-FORMAT-3                   00083100
               MOVE WS-DATE-FORMAT TO REVDTO                            00083200
               MOVE '** ADJUSTMENT **' TO REVAREAO.                     00083300
                                                                        00083400
           IF DE-PAID-DT NUMERIC                                        00083500
               MOVE DE-PAID-MO TO WS-DATE-FORMAT-1                      00083600
               MOVE DE-PAID-DY TO WS-DATE-FORMAT-2                      00083700
               MOVE DE-PAID-YR TO WS-DATE-FORMAT-3                      00083800
               MOVE WS-DATE-FORMAT TO RLSEDDTO.                         00083900
                                                                        00084000
           MOVE DE-PAID-EXAM TO PDEXAMO.                                00084100
           MOVE DE-APROV-PB TO PBAPROVO.                                00084200
           MOVE DE-APROV-VP TO VPAPROVO.                                00084300
           MOVE DE-APROV-OTH TO OTHAPROO.                               00084400
                                                                        00084500
       1111-EXIT.                                                       00084600
           EXIT.                                                        00084700
       EJECT                                                            00084800
       1112-BUILD-VALUES.                                               00084900
                                                                        00085000
           IF DE-ADJ                                                    00085100
               MOVE 'ADJUSTMENT AMT' TO HEADERO.                        00085200
                                                                        00085300
           MOVE +0 TO WS-DISPLAY-TOTAL.                                 00085400
                                                                        00085500
           PERFORM 1112C-INITIAL-DISPLAY-AREA THRU 1112C-EXIT           00085600
               VARYING WS-SUB FROM +1 BY +1                             00085700
               UNTIL WS-SUB > 16.                                       00085800
           MOVE SPACES TO WS-NON-COV-ADMN-VALUES-TABLE.                 00085900
                                                                        00086000
      *  BUILD BENEFIT VALUES FOR EXISTING PIECES OF COVERAGE           00086100
           MOVE SPACES TO WS-END-FLAG.                                  00086200
           PERFORM 1112A-BUILD-BENEFIT-PRCD THRU 1112A-EXIT             00086300
               VARYING WS-SUB FROM +1 BY +1                             00086400
               UNTIL WS-SUB > DE-BEN-OCCUR-NUM.                         00086500
                                                                        00086600
           IF (DE-PAID-DT NUMERIC) AND (DE-PAID-DT NOT = ZEROES)        00086700
               NEXT SENTENCE                                            00086800
           ELSE                                                         00086900
      *  READ COVERAGE RECORDS AND BENEFIT VALUES                       00087000
               MOVE '000' TO WS-HOLD-CV-REC-NUM                         00087100
AC9430*****    IF WS-NON-ADMN-POLICY                                    00087200
AC9430         IF CA-NON-ADMN-POLICY                                    00087300
Q16162           OR CA-LOB-FIXED-ANNUITY                                00087400
                   PERFORM 1112B-BUILD-BENEFIT-COV THRU 1112B-EXIT      00087500
                       UNTIL WS-END                                     00087600
               ELSE                                                     00087700
                   PERFORM 1112AA-PR-REC THRU 1112AA-EXIT               00087800
                   PERFORM 1112B-BUILD-BENEFIT-COV THRU 1112B-EXIT      00087900
                       UNTIL WS-END                                     00088000
                   PERFORM 1112H-BUILD-NON-COV-ADMN-VAL THRU 1112H-EXIT 00088100
                       VARYING WS-SUB FROM +1 BY +1                     00088200
                       UNTIL WS-SUB > PR-BEN-OCCUR-NUM.                 00088300
                                                                        00088400
      *  IF NO COVERAGES EXIST, SEND MESSAGE                            00088500
           IF WS-DISPLAY-TOTAL = 0                                      00088600
               MOVE 'I038' TO WS-MESSAGE-CODE-HOLD                      00088700
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00088800
               GO TO 1112-EXIT.                                         00088900
                                                                        00089000
      *  WRITE THE WORKING STORAGE DISPLAY AREA TO A TS QUEUE           00089100
           MOVE WS-DISPLAY-ITEM-NUM TO CA-ITEM-NUM.                     00089200
           MOVE WS-DISPLAY-RECORD-LENGTH TO CA-RECORD-LENGTH.           00089300
           MOVE WS-DISPLAY-AREA TO WS-RECORD.                           00089400
           IF WS-DISPLAY-ITEM-NUM > 0                                   00089500
               PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT             00089600
           ELSE                                                         00089700
               PERFORM 4920-WRITE-TS-QUEUE THRU 4920-EXIT.              00089800
           MOVE CA-ITEM-NUM TO WS-DISPLAY-ITEM-NUM.                     00089900
                                                                        00090000
       1112-EXIT.                                                       00090100
           EXIT.                                                        00090200
       EJECT                                                            00090300
       1112A-BUILD-BENEFIT-PRCD.                                        00090400
                                                                        00090500
           IF DE-PLAN-CODE(WS-SUB) = SPACES OR LOW-VALUES               00090600
               GO TO 1112A-EXIT.                                        00090700
                                                                        00090800
           ADD +1 TO WS-DISPLAY-TOTAL.                                  00090900
                                                                        00091000
           MOVE DE-PLAN-CODE(WS-SUB) TO WS-PLAN-CODE-NUM                00091100
                            WS-DISPLAY-PLAN-CODE(WS-DISPLAY-TOTAL).     00091200
           PERFORM 4550-READ-PLAN-CODE THRU 4550-EXIT.                  00091300
                                                                        00091400
           IF WS-PLAN-CODE-NOT-FOUND                                    00091500
               MOVE DE-PLAN-CODE(WS-SUB)                                00091600
                 TO WS-DISPLAY-COVERAGE(WS-DISPLAY-TOTAL)               00091700
           ELSE                                                         00091800
               MOVE PC-PLAN-DESCR                                       00091900
                 TO WS-DISPLAY-COVERAGE(WS-DISPLAY-TOTAL).              00092000
                                                                        00092100
           MOVE DE-STS(WS-SUB) TO WS-DISPLAY-STS(WS-DISPLAY-TOTAL).     00092200
           MOVE DE-BEN-AMT(WS-SUB) TO WS-DISPLAY-AMT(WS-DISPLAY-TOTAL). 00092300
           MOVE DE-BEN-AMT-REV(WS-SUB)                                  00092400
             TO WS-DISPLAY-REV(WS-DISPLAY-TOTAL).                       00092500
           MOVE DE-REAS-CODE(WS-SUB) TO WS-DISPLAY-RC(WS-DISPLAY-TOTAL).00092600
           MOVE 'X' TO WS-DISPLAY-SELECTED(WS-DISPLAY-TOTAL).           00092700
           MOVE WS-SUB TO WS-DISPLAY-OCCUR(WS-DISPLAY-TOTAL).           00092800
                                                                        00092900
       1112A-EXIT.                                                      00093000
           EXIT.                                                        00093100
       EJECT                                                            00093200
       1112AA-PR-REC.                                                   00093300
                                                                        00093400
      *  READ PR RECORD AND INITIALIZE OCCUR NUM                        00093500
           MOVE +0 TO WS-SUB-PR-OCCUR.                                  00093600
                                                                        00093700
      *  READ PR RECORD                                                 00093800
           MOVE WS-PR-ITEM-NUM TO CA-ITEM-NUM.                          00093900
           MOVE WS-PR-RECORD-LENGTH TO CA-RECORD-LENGTH.                00094000
           IF WS-PR-ITEM-NUM NOT > 0                                    00094100
               MOVE 'RD' TO CA-ACCESS-TYPE                              00094200
               MOVE 'F' TO CA-READ-TYPE                                 00094300
               MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                       00094400
               MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM                     00094500
               MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM                     00094600
               MOVE '50' TO CA-AK-REC-CODE                              00094700
               MOVE '001' TO CA-AK-REC-NUM                              00094800
               MOVE SPACES TO CA-ACCESS-MSG-CODE                        00094900
               PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT           00095000
               MOVE CA-ITEM-NUM TO WS-PR-ITEM-NUM.                      00095100
                                                                        00095200
      *  READ THE PROCESS RECORD FROM TS                                00095300
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00095400
                                                                        00095500
      *  MOVE WS-RECORD TO RECORD LAYOUT                                00095600
           MOVE WS-RECORD-INFO TO PR-INFO.                              00095700
                                                                        00095800
      *  DETERMINE IF THERE ARE ANY NON-COV ADMN VALUES                 00095900
           PERFORM 1112F-DETERMINE-NON-COV THRU 1112F-EXIT              00096000
               VARYING WS-SUB FROM +1 BY +1                             00096100
               UNTIL WS-SUB > PR-BEN-OCCUR-NUM.                         00096200
                                                                        00096300
       1112AA-EXIT.                                                     00096400
           EXIT.                                                        00096500
       EJECT                                                            00096600
       1112B-BUILD-BENEFIT-COV.                                         00096700
                                                                        00096800
      *  START BROWSE ON CV RECORDS                                     00096900
           MOVE WS-CV-ITEM-NUM TO CA-ITEM-NUM.                          00097000
           MOVE WS-CV-RECORD-LENGTH TO CA-RECORD-LENGTH.                00097100
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00097200
           MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM.                          00097300
           MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM.                        00097400
           MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM.                        00097500
           MOVE '15' TO CA-AK-REC-CODE.                                 00097600
           ADD +1 TO WS-HOLD-CV-REC-NUM.                                00097700
           MOVE WS-HOLD-CV-REC-NUM TO CA-AK-REC-NUM.                    00097800
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00097900
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00098000
                                                                        00098100
           MOVE 'RN' TO CA-ACCESS-TYPE.                                 00098200
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00098300
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00098400
                                                                        00098500
           MOVE WS-RECORD-KEY TO AK-MST-KEY.                            00098600
           IF (AK-CLM-NUM = CA-EST-CLM-NUM) AND AK-COV-REC              00098700
               MOVE WS-RECORD-INFO TO CV-INFO                           00098800
               MOVE AK-REC-NUM TO WS-HOLD-CV-REC-NUM                    00098900
           ELSE                                                         00099000
               MOVE 'Y' TO WS-END-FLAG                                  00099100
               GO TO 1112B-EXIT.                                        00099200
                                                                        00099300
      *  END BROWSE                                                     00099400
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00099500
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00099600
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00099700
                                                                        00099800
      *  ADD CV-DENIED CHECK.  SMR0838 (EML)  RICR  6/97                00099900
           IF CV-DENIED                                                 00100000
              GO TO 1112B-EXIT.                                         00100100
                                                                        00100200
      *  MARK ANY NON-COV ADMN VALUES TO DISPLAY                        00100300
AC9430*****IF NOT WS-NON-ADMN-POLICY                                    00100400
Q16162*AC9430IF NOT CA-NON-ADMN-POLICY                                  00100500
Q16162     IF (NOT CA-LOB-FIXED-ANNUITY)                                00100600
Q16162          AND (NOT CA-NON-ADMN-POLICY)                            00100700
               PERFORM 1112G-MARK-NON-COV THRU 1112G-EXIT               00100800
                   VARYING WS-SUB FROM +1 BY +1                         00100900
                   UNTIL WS-SUB > PR-BEN-OCCUR-NUM.                     00101000
                                                                        00101100
      *  IF COVERAGE RECORD ALREADY ON PROCEEDS RECORD, DO NOT ADD      00101200
           IF (DE-BEN-OCCUR-NUM NOT < 1) AND                            00101300
              (AK-REC-NUM = DE-COV-REC-NUM(1))                          00101400
               GO TO 1112B-EXIT.                                        00101500
           IF (DE-BEN-OCCUR-NUM NOT < 2) AND                            00101600
              (AK-REC-NUM = DE-COV-REC-NUM(2))                          00101700
               GO TO 1112B-EXIT.                                        00101800
           IF (DE-BEN-OCCUR-NUM NOT < 3) AND                            00101900
              (AK-REC-NUM = DE-COV-REC-NUM(3))                          00102000
               GO TO 1112B-EXIT.                                        00102100
           IF (DE-BEN-OCCUR-NUM NOT < 4) AND                            00102200
              (AK-REC-NUM = DE-COV-REC-NUM(4))                          00102300
               GO TO 1112B-EXIT.                                        00102400
           IF (DE-BEN-OCCUR-NUM NOT < 5) AND                            00102500
              (AK-REC-NUM = DE-COV-REC-NUM(5))                          00102600
               GO TO 1112B-EXIT.                                        00102700
           IF (DE-BEN-OCCUR-NUM NOT < 6) AND                            00102800
              (AK-REC-NUM = DE-COV-REC-NUM(6))                          00102900
               GO TO 1112B-EXIT.                                        00103000
           IF (DE-BEN-OCCUR-NUM NOT < 7) AND                            00103100
              (AK-REC-NUM = DE-COV-REC-NUM(7))                          00103200
               GO TO 1112B-EXIT.                                        00103300
           IF (DE-BEN-OCCUR-NUM NOT < 8) AND                            00103400
              (AK-REC-NUM = DE-COV-REC-NUM(8))                          00103500
               GO TO 1112B-EXIT.                                        00103600
           IF (DE-BEN-OCCUR-NUM NOT < 9) AND                            00103700
              (AK-REC-NUM = DE-COV-REC-NUM(9))                          00103800
               GO TO 1112B-EXIT.                                        00103900
           IF (DE-BEN-OCCUR-NUM NOT < 10) AND                           00104000
              (AK-REC-NUM = DE-COV-REC-NUM(10))                         00104100
               GO TO 1112B-EXIT.                                        00104200
           IF (DE-BEN-OCCUR-NUM NOT < 11) AND                           00104300
              (AK-REC-NUM = DE-COV-REC-NUM(11))                         00104400
               GO TO 1112B-EXIT.                                        00104500
           IF (DE-BEN-OCCUR-NUM NOT < 12) AND                           00104600
              (AK-REC-NUM = DE-COV-REC-NUM(12))                         00104700
               GO TO 1112B-EXIT.                                        00104800
           IF (DE-BEN-OCCUR-NUM NOT < 13) AND                           00104900
              (AK-REC-NUM = DE-COV-REC-NUM(13))                         00105000
               GO TO 1112B-EXIT.                                        00105100
           IF (DE-BEN-OCCUR-NUM NOT < 14) AND                           00105200
              (AK-REC-NUM = DE-COV-REC-NUM(14))                         00105300
               GO TO 1112B-EXIT.                                        00105400
           IF (DE-BEN-OCCUR-NUM NOT < 15) AND                           00105500
              (AK-REC-NUM = DE-COV-REC-NUM(15))                         00105600
               GO TO 1112B-EXIT.                                        00105700
           IF (DE-BEN-OCCUR-NUM NOT < 16) AND                           00105800
              (AK-REC-NUM = DE-COV-REC-NUM(16))                         00105900
               GO TO 1112B-EXIT.                                        00106000
                                                                        00106100
      *  CHECK TO MAKE SURE THE COVERAGE DOESN'T EXIST ON OTHER PAYMENTS00106200
           PERFORM 1112D-CHECK-OTHER-PAYMENTS THRU 1112D-EXIT.          00106300
           IF WS-COV-EXISTS                                             00106400
               GO TO 1112B-EXIT.                                        00106500
                                                                        00106600
      * ADD INITIALIZE OF WS-SUB-PR-OCCUR.  SMR0838 (EML)  RICR  6/97   00106700
           INITIALIZE WS-SUB-PR-OCCUR.                                  00106800
                                                                        00106900
      *  DETERMINE IF COV REC ON PROCESS REC, IF SO USE ADMN AMT        00107000
Q16162     IF CA-LOB-FIXED-ANNUITY                                      00107100
Q16162         NEXT SENTENCE                                            00107200
Q16162     ELSE                                                         00107300
AC9430*****IF WS-NON-ADMN-POLICY                                        00107400
AC9430     IF CA-NON-ADMN-POLICY                                        00107500
               NEXT SENTENCE                                            00107600
           ELSE                                                         00107700
               IF (PR-BEN-OCCUR-NUM NOT < 1) AND                        00107800
                  (PR-COV-REC-NUM(1) NUMERIC) AND                       00107900
                  (AK-REC-NUM = PR-COV-REC-NUM(1))                      00108000
                   MOVE +1 TO WS-SUB-PR-OCCUR                           00108100
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 2) AND                   00108200
                  (PR-COV-REC-NUM(2) NUMERIC) AND                       00108300
                  (AK-REC-NUM = PR-COV-REC-NUM(2))                      00108400
                   MOVE +2 TO WS-SUB-PR-OCCUR                           00108500
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 3) AND                   00108600
                  (PR-COV-REC-NUM(3) NUMERIC) AND                       00108700
                  (AK-REC-NUM = PR-COV-REC-NUM(3))                      00108800
                   MOVE +3 TO WS-SUB-PR-OCCUR                           00108900
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 4) AND                   00109000
                  (PR-COV-REC-NUM(4) NUMERIC) AND                       00109100
                  (AK-REC-NUM = PR-COV-REC-NUM(4))                      00109200
                   MOVE +4 TO WS-SUB-PR-OCCUR                           00109300
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 5) AND                   00109400
                  (PR-COV-REC-NUM(5) NUMERIC) AND                       00109500
                  (AK-REC-NUM = PR-COV-REC-NUM(5))                      00109600
                   MOVE +5 TO WS-SUB-PR-OCCUR                           00109700
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 6) AND                   00109800
                  (PR-COV-REC-NUM(6) NUMERIC) AND                       00109900
                  (AK-REC-NUM = PR-COV-REC-NUM(6))                      00110000
                   MOVE +6 TO WS-SUB-PR-OCCUR                           00110100
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 7) AND                   00110200
                  (PR-COV-REC-NUM(7) NUMERIC) AND                       00110300
                  (AK-REC-NUM = PR-COV-REC-NUM(7))                      00110400
                   MOVE +7 TO WS-SUB-PR-OCCUR                           00110500
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 8) AND                   00110600
                  (PR-COV-REC-NUM(8) NUMERIC) AND                       00110700
                  (AK-REC-NUM = PR-COV-REC-NUM(8))                      00110800
                   MOVE +8 TO WS-SUB-PR-OCCUR                           00110900
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 9) AND                   00111000
                  (PR-COV-REC-NUM(9) NUMERIC) AND                       00111100
                  (AK-REC-NUM = PR-COV-REC-NUM(9))                      00111200
                   MOVE +9 TO WS-SUB-PR-OCCUR                           00111300
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 10) AND                  00111400
                  (PR-COV-REC-NUM(10) NUMERIC) AND                      00111500
                  (AK-REC-NUM = PR-COV-REC-NUM(10))                     00111600
                   MOVE +10 TO WS-SUB-PR-OCCUR                          00111700
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 11) AND                  00111800
                  (PR-COV-REC-NUM(11) NUMERIC) AND                      00111900
                  (AK-REC-NUM = PR-COV-REC-NUM(11))                     00112000
                   MOVE +11 TO WS-SUB-PR-OCCUR                          00112100
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 12) AND                  00112200
                  (PR-COV-REC-NUM(12) NUMERIC) AND                      00112300
                  (AK-REC-NUM = PR-COV-REC-NUM(12))                     00112400
                   MOVE +12 TO WS-SUB-PR-OCCUR                          00112500
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 13) AND                  00112600
                  (PR-COV-REC-NUM(13) NUMERIC) AND                      00112700
                  (AK-REC-NUM = PR-COV-REC-NUM(13))                     00112800
                   MOVE +13 TO WS-SUB-PR-OCCUR                          00112900
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 14) AND                  00113000
                  (PR-COV-REC-NUM(14) NUMERIC) AND                      00113100
                  (AK-REC-NUM = PR-COV-REC-NUM(14))                     00113200
                   MOVE +14 TO WS-SUB-PR-OCCUR                          00113300
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 15) AND                  00113400
                  (PR-COV-REC-NUM(15) NUMERIC) AND                      00113500
                  (AK-REC-NUM = PR-COV-REC-NUM(15))                     00113600
                   MOVE +15 TO WS-SUB-PR-OCCUR                          00113700
               ELSE IF (PR-BEN-OCCUR-NUM NOT < 16) AND                  00113800
                  (PR-COV-REC-NUM(16) NUMERIC) AND                      00113900
                  (AK-REC-NUM = PR-COV-REC-NUM(16))                     00114000
                   MOVE +16 TO WS-SUB-PR-OCCUR.                         00114100
                                                                        00114200
      *  ADD +1 TO TOTAL                                                00114300
           ADD +1 TO WS-DISPLAY-TOTAL.                                  00114400
           MOVE AK-REC-NUM TO WS-DISPLAY-NEW-COV(WS-DISPLAY-TOTAL).     00114500
                                                                        00114600
      *  UPDATE WS-DISPLAY                                              00114700
           MOVE CV-PLAN-CODE TO WS-PLAN-CODE-NUM                        00114800
                                WS-DISPLAY-PLAN-CODE(WS-DISPLAY-TOTAL). 00114900
           PERFORM 4550-READ-PLAN-CODE THRU 4550-EXIT.                  00115000
                                                                        00115100
           IF WS-PLAN-CODE-NOT-FOUND                                    00115200
               MOVE CV-PLAN-CODE                                        00115300
                 TO WS-DISPLAY-COVERAGE(WS-DISPLAY-TOTAL)               00115400
           ELSE                                                         00115500
               MOVE PC-PLAN-DESCR                                       00115600
                 TO WS-DISPLAY-COVERAGE(WS-DISPLAY-TOTAL).              00115700
                                                                        00115800
           MOVE CV-STS TO WS-DISPLAY-STS(WS-DISPLAY-TOTAL).             00115900
           IF WS-SUB-PR-OCCUR > 0                                       00116000
               MOVE PR-ADMN-AMT(WS-SUB-PR-OCCUR)                        00116100
                 TO WS-DISPLAY-AMT(WS-DISPLAY-TOTAL)                    00116200
           ELSE                                                         00116300
               MOVE CV-FACE TO WS-DISPLAY-AMT(WS-DISPLAY-TOTAL).        00116400
           MOVE +0 TO WS-DISPLAY-REV(WS-DISPLAY-TOTAL).                 00116500
           MOVE AK-REC-NUM TO WS-DISPLAY-NEW-COV(WS-DISPLAY-TOTAL).     00116600
                                                                        00116700
       1112B-EXIT.                                                      00116800
           EXIT.                                                        00116900
       EJECT                                                            00117000
       1112C-INITIAL-DISPLAY-AREA.                                      00117100
                                                                        00117200
           MOVE SPACES TO WS-DISPLAY-SELECTED(WS-SUB)                   00117300
                          WS-DISPLAY-NEW-COV(WS-SUB)                    00117400
                          WS-DISPLAY-STS(WS-SUB)                        00117500
                          WS-DISPLAY-COVERAGE(WS-SUB)                   00117600
                          WS-DISPLAY-PLAN-CODE(WS-SUB)                  00117700
                          WS-DISPLAY-RC(WS-SUB).                        00117800
                                                                        00117900
           MOVE ZEROES TO WS-DISPLAY-OCCUR(WS-SUB)                      00118000
                          WS-DISPLAY-AMT(WS-SUB)                        00118100
                          WS-DISPLAY-REV(WS-SUB).                       00118200
                                                                        00118300
       1112C-EXIT.                                                      00118400
           EXIT.                                                        00118500
       EJECT                                                            00118600
       1112D-CHECK-OTHER-PAYMENTS.                                      00118700
                                                                        00118800
      *  HOLDING THE COV KEY AND THE EXISTING DE REC INFO               00118900
           MOVE AK-MST-KEY TO WS-HOLD-MST-KEY.                          00119000
           MOVE DE-INFO TO WS-HOLD-DE-INFO.                             00119100
                                                                        00119200
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00119300
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00119400
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00119500
           MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM.                          00119600
           MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM.                        00119700
           MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM.                        00119800
           MOVE '50' TO CA-AK-REC-CODE.                                 00119900
           MOVE '001' TO CA-AK-REC-NUM.                                 00120000
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00120100
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00120200
           MOVE 'RN' TO CA-ACCESS-TYPE.                                 00120300
                                                                        00120400
           MOVE SPACES TO WS-COV-EXISTS-FLAG                            00120500
                          WS-END-1-FLAG.                                00120600
           PERFORM 1112E-PYMT-CHECK THRU 1112E-EXIT                     00120700
               UNTIL WS-COV-EXISTS OR WS-END-1.                         00120800
                                                                        00120900
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00121000
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00121100
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00121200
                                                                        00121300
           MOVE WS-HOLD-MST-KEY TO AK-MST-KEY.                          00121400
           MOVE WS-HOLD-DE-INFO TO DE-INFO.                             00121500
                                                                        00121600
       1112D-EXIT.                                                      00121700
           EXIT.                                                        00121800
       EJECT                                                            00121900
       1112E-PYMT-CHECK.                                                00122000
                                                                        00122100
      *  READ COVERAGE RECORD                                           00122200
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00122300
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00122400
                                                                        00122500
      *  IF END OF COVERAGE RECORDS, SET FLAG                           00122600
           MOVE WS-RECORD-KEY TO AK-MST-KEY.                            00122700
           IF (AK-CLM-NUM = CA-EST-CLM-NUM) AND AK-PYMT-REC             00122800
               MOVE WS-RECORD-INFO TO DE-INFO                           00122900
               IF NOT DE-REC                                            00123000
                   GO TO 1112E-EXIT                                     00123100
               ELSE                                                     00123200
                   NEXT SENTENCE                                        00123300
           ELSE                                                         00123400
               MOVE 'Y' TO WS-END-1-FLAG                                00123500
               GO TO 1112E-EXIT.                                        00123600
                                                                        00123700
      *  MARK ANY NON-COV ADMN VALUES TO DISPLAY                        00123800
AC9430*****IF NOT WS-NON-ADMN-POLICY                                    00123900
Q16162*AC9430IF NOT CA-NON-ADMN-POLICY                                  00124000
Q16162     IF (NOT CA-LOB-FIXED-ANNUITY)                                00124100
Q16162          AND (NOT CA-NON-ADMN-POLICY)                            00124200
               PERFORM 1112G-MARK-NON-COV THRU 1112G-EXIT               00124400
                   VARYING WS-SUB FROM +1 BY +1                         00124500
                   UNTIL WS-SUB > PR-BEN-OCCUR-NUM.                     00124600
                                                                        00124700
      *  IF COVERAGE RECORD ALREADY ON PROCEEDS RECORD, DO NOT ADD      00124800
           IF (DE-BEN-OCCUR-NUM NOT < 1) AND                            00124900
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(1))                     00125000
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00125100
               GO TO 1112E-EXIT.                                        00125200
           IF (DE-BEN-OCCUR-NUM NOT < 2) AND                            00125300
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(2))                     00125400
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00125500
               GO TO 1112E-EXIT.                                        00125600
           IF (DE-BEN-OCCUR-NUM NOT < 3) AND                            00125700
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(3))                     00125800
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00125900
               GO TO 1112E-EXIT.                                        00126000
           IF (DE-BEN-OCCUR-NUM NOT < 4) AND                            00126100
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(4))                     00126200
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00126300
               GO TO 1112E-EXIT.                                        00126400
           IF (DE-BEN-OCCUR-NUM NOT < 5) AND                            00126500
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(5))                     00126600
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00126700
               GO TO 1112E-EXIT.                                        00126800
           IF (DE-BEN-OCCUR-NUM NOT < 6) AND                            00126900
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(6))                     00127000
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00127100
               GO TO 1112E-EXIT.                                        00127200
           IF (DE-BEN-OCCUR-NUM NOT < 7) AND                            00127300
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(7))                     00127400
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00127500
               GO TO 1112E-EXIT.                                        00127600
           IF (DE-BEN-OCCUR-NUM NOT < 8) AND                            00127700
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(8))                     00127800
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00127900
               GO TO 1112E-EXIT.                                        00128000
           IF (DE-BEN-OCCUR-NUM NOT < 9) AND                            00128100
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(9))                     00128200
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00128300
               GO TO 1112E-EXIT.                                        00128400
           IF (DE-BEN-OCCUR-NUM NOT < 10) AND                           00128500
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(10))                    00128600
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00128700
               GO TO 1112E-EXIT.                                        00128800
           IF (DE-BEN-OCCUR-NUM NOT < 11) AND                           00128900
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(11))                    00129000
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00129100
               GO TO 1112E-EXIT.                                        00129200
           IF (DE-BEN-OCCUR-NUM NOT < 12) AND                           00129300
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(12))                    00129400
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00129500
               GO TO 1112E-EXIT.                                        00129600
           IF (DE-BEN-OCCUR-NUM NOT < 13) AND                           00129700
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(13))                    00129800
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00129900
               GO TO 1112E-EXIT.                                        00130000
           IF (DE-BEN-OCCUR-NUM NOT < 14) AND                           00130100
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(14))                    00130200
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00130300
               GO TO 1112E-EXIT.                                        00130400
           IF (DE-BEN-OCCUR-NUM NOT < 15) AND                           00130500
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(15))                    00130600
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00130700
               GO TO 1112E-EXIT.                                        00130800
           IF (DE-BEN-OCCUR-NUM NOT < 16) AND                           00130900
              (WS-HOLD-REC-NUM = DE-COV-REC-NUM(16))                    00131000
               MOVE 'Y' TO WS-COV-EXISTS-FLAG                           00131100
               GO TO 1112E-EXIT.                                        00131200
                                                                        00131300
       1112E-EXIT.                                                      00131400
           EXIT.                                                        00131500
                                                                        00131600
                                                                        00131700
       1112F-DETERMINE-NON-COV.                                         00131800
                                                                        00131900
      *    IF PR-BEN-OCCUR-NUM NOT < WS-SUB                             00132000
      *       AND PR-COV-REC-NUM(WS-SUB) = SPACES OR LOW-VALUES         00132100
           IF (PR-BEN-OCCUR-NUM NOT < WS-SUB)   AND                     00132200
              (PR-COV-REC-NUM(WS-SUB) = SPACES OR LOW-VALUES OR ZEROES) 00132300
                  MOVE 'Y' TO WS-NON-COV-FLAG(WS-SUB).                  00132400
                                                                        00132500
       1112F-EXIT.                                                      00132600
           EXIT.                                                        00132700
                                                                        00132800
                                                                        00132900
       1112G-MARK-NON-COV.                                              00133000
                                                                        00133100
           IF (DE-BEN-OCCUR-NUM NOT < 1) AND                            00133200
               WS-NON-COV(WS-SUB) AND                                   00133300
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(1))                  00133400
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00133500
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 2) AND                       00133600
               WS-NON-COV(WS-SUB) AND                                   00133700
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(2))                  00133800
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00133900
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 3) AND                       00134000
               WS-NON-COV(WS-SUB) AND                                   00134100
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(3))                  00134200
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00134300
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 4) AND                       00134400
               WS-NON-COV(WS-SUB) AND                                   00134500
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(4))                  00134600
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00134700
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 5) AND                       00134800
               WS-NON-COV(WS-SUB) AND                                   00134900
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(5))                  00135000
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00135100
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 6) AND                       00135200
               WS-NON-COV(WS-SUB) AND                                   00135300
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(6))                  00135400
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00135500
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 7) AND                       00135600
               WS-NON-COV(WS-SUB) AND                                   00135700
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(7))                  00135800
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00135900
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 8) AND                       00136000
               WS-NON-COV(WS-SUB) AND                                   00136100
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(8))                  00136200
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00136300
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 9) AND                       00136400
               WS-NON-COV(WS-SUB) AND                                   00136500
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(9))                  00136600
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00136700
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 10) AND                      00136800
               WS-NON-COV(WS-SUB) AND                                   00136900
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(10))                 00137000
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00137100
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 11) AND                      00137200
               WS-NON-COV(WS-SUB) AND                                   00137300
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(11))                 00137400
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00137500
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 12) AND                      00137600
               WS-NON-COV(WS-SUB) AND                                   00137700
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(12))                 00137800
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00137900
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 13) AND                      00138000
               WS-NON-COV(WS-SUB) AND                                   00138100
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(13))                 00138200
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00138300
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 14) AND                      00138400
               WS-NON-COV(WS-SUB) AND                                   00138500
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(14))                 00138600
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00138700
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 15) AND                      00138800
               WS-NON-COV(WS-SUB) AND                                   00138900
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(15))                 00139000
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB)              00139100
           ELSE IF (DE-BEN-OCCUR-NUM NOT < 16) AND                      00139200
               WS-NON-COV(WS-SUB) AND                                   00139300
              (PR-PLAN-CODE(WS-SUB) = DE-PLAN-CODE(16))                 00139400
                  MOVE 'Y' TO WS-NON-COV-DISP-FLAG(WS-SUB).             00139500
                                                                        00139600
       1112G-EXIT.                                                      00139700
           EXIT.                                                        00139800
                                                                        00139900
                                                                        00140000
       1112H-BUILD-NON-COV-ADMN-VAL.                                    00140100
                                                                        00140200
           IF (WS-NON-COV-FLAG(WS-SUB) = 'Y') AND                       00140300
              (NOT WS-NON-COV-DISP(WS-SUB))                             00140400
      *                                                                 00140500
      *        ADD +1 TO WS-DISPLAY-TOTAL                               00140600
      *        MOVE PR-PLAN-CODE(WS-SUB)                                00140700
      *          TO WS-DISPLAY-PLAN-CODE(WS-DISPLAY-TOTAL)              00140800
      *             WS-DISPLAY-COVERAGE(WS-DISPLAY-TOTAL)               00140900
      *        MOVE PR-ADMN-AMT(WS-SUB)                                 00141000
      *          TO WS-DISPLAY-AMT(WS-DISPLAY-TOTAL)                    00141100
      *        MOVE +0 TO WS-DISPLAY-REV(WS-DISPLAY-TOTAL).             00141200
      *                                                                 00141300
               NEXT SENTENCE                                            00141400
           ELSE                                                         00141500
               GO TO 1112H-EXIT.                                        00141600
                                                                        00141700
           ADD +1 TO WS-DISPLAY-TOTAL.                                  00141800
                                                                        00141900
           MOVE PR-PLAN-CODE(WS-SUB)                                    00142000
             TO WS-DISPLAY-PLAN-CODE(WS-DISPLAY-TOTAL)                  00142100
                WS-PLAN-CODE-NUM.                                       00142200
           PERFORM 4550-READ-PLAN-CODE THRU 4550-EXIT.                  00142300
                                                                        00142400
           IF WS-PLAN-CODE-NOT-FOUND                                    00142500
               MOVE PR-PLAN-CODE(WS-SUB)                                00142600
                 TO WS-DISPLAY-COVERAGE(WS-DISPLAY-TOTAL)               00142700
           ELSE                                                         00142800
               MOVE PC-PLAN-DESCR                                       00142900
                 TO WS-DISPLAY-COVERAGE(WS-DISPLAY-TOTAL).              00143000
                                                                        00143100
           MOVE PR-ADMN-AMT(WS-SUB)                                     00143200
             TO WS-DISPLAY-AMT(WS-DISPLAY-TOTAL).                       00143300
           MOVE +0 TO WS-DISPLAY-REV(WS-DISPLAY-TOTAL).                 00143400
                                                                        00143500
       1112H-EXIT.                                                      00143600
           EXIT.                                                        00143700
       EJECT                                                            00143800
       1113-MOVE-VALUES-2.                                              00143900
                                                                        00144000
      *  BUILD SCREEN                                                   00144100
           IF WS-BUILD-PAGE-2                                           00144200
               MOVE +1 TO WS-SUB-DISPLAY                                00144300
           ELSE                                                         00144400
               MOVE +9 TO WS-SUB-DISPLAY.                               00144500
                                                                        00144600
           IF WS-DISPLAY-TOTAL NOT < WS-SUB-DISPLAY                     00144700
               MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL1O        00144800
               MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS1O          00144900
               MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE1O      00145000
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00145100
               MOVE WS-AMOUNT-9-2 TO PROAMT1O                           00145200
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00145300
                   MOVE '-' TO OPERTR1O                                 00145400
               END-IF                                                   00145500
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00145600
               MOVE WS-AMOUNT-9-2 TO REVAMT1O                           00145700
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00145800
                   MOVE '-' TO OPERTR1O                                 00145900
               END-IF                                                   00146000
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC1O.              00146100
                                                                        00146200
           ADD +1 TO WS-SUB-DISPLAY.                                    00146300
                                                                        00146400
           IF WS-DISPLAY-TOTAL NOT < WS-SUB-DISPLAY                     00146500
               MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL2O        00146600
               MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS2O          00146700
               MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE2O      00146800
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00146900
               MOVE WS-AMOUNT-9-2 TO PROAMT2O                           00147000
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00147100
                   MOVE '-' TO OPERTR2O                                 00147200
               END-IF                                                   00147300
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00147400
               MOVE WS-AMOUNT-9-2 TO REVAMT2O                           00147500
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00147600
                   MOVE '-' TO OPERTR2O                                 00147700
               END-IF                                                   00147800
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC2O.              00147900
                                                                        00148000
           ADD +1 TO WS-SUB-DISPLAY.                                    00148100
                                                                        00148200
           IF WS-DISPLAY-TOTAL NOT < WS-SUB-DISPLAY                     00148300
               MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL3O        00148400
               MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS3O          00148500
               MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE3O      00148600
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00148700
               MOVE WS-AMOUNT-9-2 TO PROAMT3O                           00148800
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00148900
                   MOVE '-' TO OPERTR3O                                 00149000
               END-IF                                                   00149100
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00149200
               MOVE WS-AMOUNT-9-2 TO REVAMT3O                           00149300
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00149400
                   MOVE '-' TO OPERTR3O                                 00149500
               END-IF                                                   00149600
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC3O.              00149700
                                                                        00149800
           ADD +1 TO WS-SUB-DISPLAY.                                    00149900
                                                                        00150000
           IF WS-DISPLAY-TOTAL NOT < WS-SUB-DISPLAY                     00150100
               MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL4O        00150200
               MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS4O          00150300
               MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE4O      00150400
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00150500
               MOVE WS-AMOUNT-9-2 TO PROAMT4O                           00150600
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00150700
                   MOVE '-' TO OPERTR4O                                 00150800
               END-IF                                                   00150900
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00151000
               MOVE WS-AMOUNT-9-2 TO REVAMT4O                           00151100
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00151200
                   MOVE '-' TO OPERTR4O                                 00151300
               END-IF                                                   00151400
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC4O.              00151500
                                                                        00151600
           ADD +1 TO WS-SUB-DISPLAY.                                    00151700
                                                                        00151800
           IF WS-DISPLAY-TOTAL NOT < WS-SUB-DISPLAY                     00151900
               MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL5O        00152000
               MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS5O          00152100
               MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE5O      00152200
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00152300
               MOVE WS-AMOUNT-9-2 TO PROAMT5O                           00152400
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00152500
                   MOVE '-' TO OPERTR5O                                 00152600
               END-IF                                                   00152700
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00152800
               MOVE WS-AMOUNT-9-2 TO REVAMT5O                           00152900
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00153000
                   MOVE '-' TO OPERTR5O                                 00153100
               END-IF                                                   00153200
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC5O.              00153300
                                                                        00153400
           ADD +1 TO WS-SUB-DISPLAY.                                    00153500
                                                                        00153600
           IF WS-DISPLAY-TOTAL NOT < WS-SUB-DISPLAY                     00153700
               MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL6O        00153800
               MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS6O          00153900
               MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE6O      00154000
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00154100
               MOVE WS-AMOUNT-9-2 TO PROAMT6O                           00154200
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00154300
                   MOVE '-' TO OPERTR6O                                 00154400
               END-IF                                                   00154500
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00154600
               MOVE WS-AMOUNT-9-2 TO REVAMT6O                           00154700
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00154800
                   MOVE '-' TO OPERTR6O                                 00154900
               END-IF                                                   00155000
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC6O.              00155100
                                                                        00155200
           ADD +1 TO WS-SUB-DISPLAY.                                    00155300
                                                                        00155400
           IF WS-DISPLAY-TOTAL NOT < WS-SUB-DISPLAY                     00155500
               MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL7O        00155600
               MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS7O          00155700
               MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE7O      00155800
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00155900
               MOVE WS-AMOUNT-9-2 TO PROAMT7O                           00156000
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00156100
                   MOVE '-' TO OPERTR7O                                 00156200
               END-IF                                                   00156300
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00156400
               MOVE WS-AMOUNT-9-2 TO REVAMT7O                           00156500
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00156600
                   MOVE '-' TO OPERTR7O                                 00156700
               END-IF                                                   00156800
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC7O.              00156900
                                                                        00157000
           ADD +1 TO WS-SUB-DISPLAY.                                    00157100
                                                                        00157200
           IF WS-DISPLAY-TOTAL NOT < WS-SUB-DISPLAY                     00157300
               MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL8O        00157400
               MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS8O          00157500
               MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE8O      00157600
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00157700
               MOVE WS-AMOUNT-9-2 TO PROAMT8O                           00157800
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00157900
                   MOVE '-' TO OPERTR8O                                 00158000
               END-IF                                                   00158100
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00158200
               MOVE WS-AMOUNT-9-2 TO REVAMT8O                           00158300
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00158400
                   MOVE '-' TO OPERTR8O                                 00158500
               END-IF                                                   00158600
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC8O.              00158700
                                                                        00158800
           MOVE +0 TO WS-DISPLAY-AMT-ORG                                00158900
                      WS-DISPLAY-AMT-REV.                               00159000
                                                                        00159100
           PERFORM 1119-COMPUTE-BEN THRU 1119-EXIT                      00159200
               VARYING WS-SUB FROM +1 BY +1                             00159300
               UNTIL WS-SUB > DE-BEN-OCCUR-NUM.                         00159400
                                                                        00159500
           IF (WS-BUILD-PAGE-2 AND (WS-DISPLAY-TOTAL NOT > 8)) OR       00159600
              (WS-BUILD-PAGE-3)                                         00159700
               MOVE WS-DISPLAY-AMT-ORG TO WS-AMOUNT-9-2                 00159800
               MOVE WS-AMOUNT-9-2 TO PROAMTTO                           00159900
               IF DE-REV OR DE-ADJ                                      00160000
                   MOVE WS-DISPLAY-AMT-REV TO WS-AMOUNT-9-2             00160100
                   MOVE WS-AMOUNT-9-2 TO REVAMTTO                       00160200
               ELSE                                                     00160300
                   NEXT SENTENCE                                        00160400
           ELSE                                                         00160500
               MOVE PROT-DARK TO TOTALF                                 00160600
                                 DSIGNT1F                               00160700
                                 PROAMTTF                               00160800
                                 DSIGNT2F                               00160900
                                 REVAMTTF.                              00161000
                                                                        00161100
       1113-EXIT.                                                       00161200
           EXIT.                                                        00161300
                                                                        00161400
                                                                        00161500
       1119-COMPUTE-BEN.                                                00161600
                                                                        00161700
           COMPUTE WS-DISPLAY-AMT-ORG =                                 00161800
               WS-DISPLAY-AMT-ORG + DE-BEN-AMT(WS-SUB).                 00161900
           COMPUTE WS-DISPLAY-AMT-REV =                                 00162000
               WS-DISPLAY-AMT-REV + DE-BEN-AMT-REV(WS-SUB).             00162100
                                                                        00162200
       1119-EXIT.                                                       00162300
           EXIT.                                                        00162400
       EJECT                                                            00162500
      ***********************************************************       00162600
      *                      R E P E A T                        *       00162700
      ***********************************************************       00162800
       2000-REPEAT.                                                     00162900
                                                                        00163000
      *  CLEAR MESSAGE AREA                                             00163100
           MOVE SPACES TO MESSAG1O                                      00163200
                          MESSAG2O                                      00163300
                          MESSAG3O                                      00163400
                          MESSAG4O                                      00163500
                          MESSAG5O                                      00163600
                          MESSAG6O                                      00163700
                          MESSAG7O                                      00163800
                          MESSAG8O                                      00163900
                          MESSAG9O.                                     00164000
                                                                        00164100
      *  MOVE GENERAL COMMAREA TO WS                                    00164200
           MOVE CA-GENERAL TO WS-COMMAREA.                              00164300
                                                                        00164400
      *  IF LAST REQUEST WAS HLP, RETURN TO OLD SCREEN                  00164500
           IF CA-LAST-REQ-HLP                                           00164600
               PERFORM 2490-PF1-FUNCTION-RETURN.                        00164700
                                                                        00164800
      *  HANDLE CLEAR                                                   00164900
           IF EIBAID = DFHCLEAR                                         00165000
               MOVE 'I004' TO WS-MESSAGE-CODE-HOLD                      00165100
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00165200
               MOVE CA-PREV-PAGE-NUM TO WS-BUILD-PAGE-IND               00165300
               PERFORM 1100-BUILD-SCREEN.                               00165400
                                                                        00165500
      *  HANDLE PA1                                                     00165600
           IF EIBAID =  DFHPA1                                          00165700
               MOVE 'E002' TO WS-MESSAGE-CODE-HOLD                      00165800
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00165900
               PERFORM 8000-SEND-PAGE.                                  00166000
                                                                        00166100
      *  HANDLE PA2                                                     00166200
           IF EIBAID =  DFHPA2                                          00166300
               PERFORM 2300-VALIDATE-SCREEN.                            00166400
                                                                        00166500
      *  RECEIVE MAP                                                    00166600
           IF CA-PREV-PAGE-NUM = 1                                      00166700
               EXEC CICS RECEIVE                                        00166800
                         MAP('MAPPD1A')                                 00166900
                         MAPSET('D682PD1')                              00167000
               END-EXEC                                                 00167100
           ELSE                                                         00167200
               EXEC CICS RECEIVE                                        00167300
                         MAP('MAPPD2A')                                 00167400
                         MAPSET('D682PD7')                              00167500
               END-EXEC.                                                00167600
                                                                        00167700
      *  HANDLE PF1  HLP                                                00167800
           IF EIBAID = DFHPF1                                           00167900
               PERFORM 2400-PF1-FUNCTION-SEND.                          00168000
                                                                        00168100
      *  HANDLE PF2  TOP                                                00168200
           IF EIBAID = DFHPF2                                           00168300
               PERFORM 2200-SET-MDT THRU 2200-EXIT                      00168400
               IF CA-PREV-PAGE-NUM = 1                                  00168500
                   MOVE -1 TO TRXADDTL                                  00168600
                   PERFORM 8000-SEND-PAGE                               00168700
               ELSE                                                     00168800
                   MOVE -1 TO DENTY1L                                   00168900
                   PERFORM 8000-SEND-PAGE.                              00169000
                                                                        00169100
      *  HANDLE PF3  MM                                                 00169200
           IF EIBAID = DFHPF3                                           00169300
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00169400
               IF WS-UPDATE-PENDING                                     00169500
                   PERFORM 2150-UPDATE-PENDING                          00169600
               ELSE                                                     00169700
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00169800
                   PERFORM 6200-XCTL-ASMM.                              00169900
                                                                        00170000
      *  HANDLE PF4  PRV                                                00170100
           IF EIBAID = DFHPF4                                           00170200
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00170300
               IF WS-UPDATE-PENDING                                     00170400
                   PERFORM 2150-UPDATE-PENDING                          00170500
               ELSE                                                     00170600
                   PERFORM 2500-PF4-FUNCTION.                           00170700
                                                                        00170800
      *  HANDLE PF5  NXT                                                00170900
           IF EIBAID = DFHPF5                                           00171000
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00171100
               IF WS-UPDATE-PENDING                                     00171200
                   PERFORM 2150-UPDATE-PENDING                          00171300
               ELSE                                                     00171400
                   PERFORM 2600-PF5-FUNCTION.                           00171500
                                                                        00171600
      *  HANDLE PF6  UPD                                                00171700
           IF EIBAID = DFHPF6                                           00171800
               IF CA-ASPC-BROWSE OR CA-NOT-UPDATABLE OR WS-PYMT-PROT    00171900
                   MOVE 'W001' TO WS-MESSAGE-CODE-HOLD                  00172000
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00172100
                   PERFORM 8000-SEND-PAGE                               00172200
               ELSE                                                     00172300
                   IF CA-LAST-REQUEST = 'A' OR 'N' OR 'R'               00172400
                       PERFORM 2700-PF6-FUNCTION                        00172500
                   ELSE                                                 00172600
                       PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT    00172700
                       IF WS-UPDATE-PENDING                             00172800
                           PERFORM 2700-PF6-FUNCTION                    00172900
                       ELSE                                             00173000
                           MOVE 'W002' TO WS-MESSAGE-CODE-HOLD          00173100
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00173200
                           PERFORM 8000-SEND-PAGE.                      00173300
                                                                        00173400
      *  HANDLE PF7  BWD                                                00173500
           IF EIBAID = DFHPF7                                           00173600
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00173700
               IF WS-UPDATE-PENDING                                     00173800
                   PERFORM 2150-UPDATE-PENDING                          00173900
               ELSE                                                     00174000
                   PERFORM 2800-PF7-FUNCTION.                           00174100
                                                                        00174200
      *  HANDLE PF8  FWD                                                00174300
           IF EIBAID = DFHPF8                                           00174400
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00174500
               IF WS-UPDATE-PENDING                                     00174600
                   PERFORM 2150-UPDATE-PENDING                          00174700
               ELSE                                                     00174800
                   PERFORM 2900-PF8-FUNCTION.                           00174900
                                                                        00175000
      *  HANDLE PF9  PRS                                                00175100
           IF EIBAID = DFHPF9                                           00175200
               IF CA-ASPC-BROWSE OR CA-NOT-UPDATABLE OR WS-PYMT-PROT    00175300
                   MOVE 'W001' TO WS-MESSAGE-CODE-HOLD                  00175400
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00175500
                   PERFORM 8000-SEND-PAGE                               00175600
               ELSE IF CA-LAST-REQ-NEW                                  00175700
                   MOVE 'EC43' TO WS-MESSAGE-CODE-HOLD                  00175800
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00175900
                   PERFORM 8000-SEND-PAGE                               00176000
               ELSE                                                     00176100
                   PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT        00176200
                   IF WS-UPDATE-PENDING                                 00176300
                       PERFORM 2150-UPDATE-PENDING                      00176400
                   ELSE                                                 00176500
                       PERFORM 3000-PF9-FUNCTION.                       00176600
                                                                        00176700
      *  HANDLE PF10 ADD NON-COV VALUE                                  00176800
           IF EIBAID = DFHPF10                                          00176900
               IF CA-ASPC-BROWSE OR CA-NOT-UPDATABLE OR WS-PYMT-PROT    00177000
                   MOVE 'W001' TO WS-MESSAGE-CODE-HOLD                  00177100
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00177200
                   PERFORM 8000-SEND-PAGE                               00177300
               ELSE                                                     00177400
                   PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT        00177500
                   IF WS-UPDATE-PENDING                                 00177600
                       PERFORM 2150-UPDATE-PENDING                      00177700
                   ELSE                                                 00177800
                       PERFORM 3400-PF10-FUNCTION.                      00177900
                                                                        00178000
      *  HANDLE PF11 DEL                                                00178100
           IF EIBAID = DFHPF11                                          00178200
               IF CA-ASPC-BROWSE OR CA-NOT-UPDATABLE OR WS-PYMT-PROT    00178300
                   MOVE 'W001' TO WS-MESSAGE-CODE-HOLD                  00178400
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00178500
                   PERFORM 8000-SEND-PAGE                               00178600
               ELSE                                                     00178700
                   PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT        00178800
                   IF WS-UPDATE-PENDING                                 00178900
                       PERFORM 2150-UPDATE-PENDING                      00179000
                   ELSE                                                 00179100
                       PERFORM 3500-PF11-FUNCTION.                      00179200
                                                                        00179300
      *  HANDLE PF12 END                                                00179400
           IF EIBAID = DFHPF12                                          00179500
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00179600
               IF WS-UPDATE-PENDING                                     00179700
                   PERFORM 2150-UPDATE-PENDING                          00179800
               ELSE                                                     00179900
                   MOVE 'ACTS EXIT SUCCESSFUL'                          00180000
                     TO WS-SEND-TEXT-DATA                               00180100
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00180200
                   PERFORM 9100-SEND-TEXT.                              00180300
                                                                        00180400
      *  HANDLE PF13 DT                                                 00180500
           IF EIBAID = DFHPF13                                          00180600
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00180700
               IF WS-UPDATE-PENDING                                     00180800
                   PERFORM 2150-UPDATE-PENDING                          00180900
               ELSE                                                     00181000
               IF CA-TRANSACTION-ASDT = SPACES                          00181100
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00181200
                   MOVE YELLOW-COLOR TO MESSAG1C                        00181300
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00181400
                   PERFORM 8000-SEND-PAGE                               00181500
               ELSE                                                     00181600
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00181700
                   PERFORM 5800-XCTL-ASDT.                              00181800
                                                                        00181900
      *  HANDLE PF14 EI                                                 00182000
           IF EIBAID = DFHPF14                                          00182100
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00182200
               IF WS-UPDATE-PENDING                                     00182300
                   PERFORM 2150-UPDATE-PENDING                          00182400
               ELSE                                                     00182500
               IF CA-TRANSACTION-ASEI = SPACES                          00182600
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00182700
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00182800
                   MOVE YELLOW-COLOR TO MESSAG1C                        00182900
                   PERFORM 8000-SEND-PAGE                               00183000
               ELSE                                                     00183100
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00183200
                   PERFORM 5900-XCTL-ASEI.                              00183300
                                                                        00183400
      *  HANDLE PF15 EM                                                 00183500
           IF EIBAID = DFHPF15                                          00183600
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00183700
               IF WS-UPDATE-PENDING                                     00183800
                   PERFORM 2150-UPDATE-PENDING                          00183900
               ELSE                                                     00184000
               IF CA-TRANSACTION-ASEM = SPACES                          00184100
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00184200
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00184300
                   MOVE YELLOW-COLOR TO MESSAG1C                        00184400
                   PERFORM 8000-SEND-PAGE                               00184500
               ELSE                                                     00184600
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00184700
                   PERFORM 6000-XCTL-ASEM.                              00184800
                                                                        00184900
      *  HANDLE PF16 CT                                                 00185000
           IF EIBAID = DFHPF16                                          00185100
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00185200
               IF WS-UPDATE-PENDING                                     00185300
                   PERFORM 2150-UPDATE-PENDING                          00185400
               ELSE                                                     00185500
               IF CA-TRANSACTION-ASCT = SPACES                          00185600
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00185700
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00185800
                   MOVE YELLOW-COLOR TO MESSAG1C                        00185900
                   PERFORM 8000-SEND-PAGE                               00186000
               ELSE                                                     00186100
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00186200
                   PERFORM 5600-XCTL-ASCT.                              00186300
                                                                        00186400
      *  HANDLE PF17 PC                                                 00186500
           IF EIBAID = DFHPF17                                          00186600
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00186700
               IF WS-UPDATE-PENDING                                     00186800
                   PERFORM 2150-UPDATE-PENDING                          00186900
               ELSE                                                     00187000
               IF CA-TRANSACTION-ASPC = SPACES                          00187100
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00187200
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00187300
                   MOVE YELLOW-COLOR TO MESSAG1C                        00187400
                   PERFORM 8000-SEND-PAGE                               00187500
               ELSE                                                     00187600
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00187700
                   PERFORM 6300-XCTL-ASPC.                              00187800
                                                                        00187900
      *  HANDLE PF18 RQ                                                 00188000
           IF EIBAID = DFHPF18                                          00188100
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00188200
               IF WS-UPDATE-PENDING                                     00188300
                   PERFORM 2150-UPDATE-PENDING                          00188400
               ELSE                                                     00188500
               IF CA-TRANSACTION-ASRQ = SPACES                          00188600
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00188700
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00188800
                   MOVE YELLOW-COLOR TO MESSAG1C                        00188900
                   PERFORM 8000-SEND-PAGE                               00189000
               ELSE                                                     00189100
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00189200
                   PERFORM 7000-XCTL-ASRQ.                              00189300
                                                                        00189400
      *  HANDLE PF19 BN                                                 00189500
           IF (EIBAID = DFHPF19) AND (CA-ID)                            00189600
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00189700
               IF WS-UPDATE-PENDING                                     00189800
                   PERFORM 2150-UPDATE-PENDING                          00189900
               ELSE                                                     00190000
               IF CA-TRANSACTION-ASBN = SPACES                          00190100
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00190200
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00190300
                   MOVE YELLOW-COLOR TO MESSAG1C                        00190400
                   PERFORM 8000-SEND-PAGE                               00190500
               ELSE                                                     00190600
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00190700
                   PERFORM 5200-XCTL-ASBN.                              00190800
                                                                        00190900
      *  HANDLE PF20 CL                                                 00191000
           IF EIBAID = DFHPF20                                          00191100
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00191200
               IF WS-UPDATE-PENDING                                     00191300
                   PERFORM 2150-UPDATE-PENDING                          00191400
               ELSE                                                     00191500
               IF CA-TRANSACTION-ASCL = SPACES                          00191600
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00191700
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00191800
                   MOVE YELLOW-COLOR TO MESSAG1C                        00191900
                   PERFORM 8000-SEND-PAGE                               00192000
               ELSE                                                     00192100
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00192200
                   PERFORM 5400-XCTL-ASCL.                              00192300
                                                                        00192400
      *  HANDLE PF21 PV                                                 00192500
           IF (EIBAID = DFHPF21) AND                                    00192600
              (CA-MM OR CA-HS OR CA-INC-PROT OR                         00192700
               CA-IW OR CA-RW)                                          00192800
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00192900
               IF WS-UPDATE-PENDING                                     00193000
                   PERFORM 2150-UPDATE-PENDING                          00193100
               ELSE                                                     00193200
               IF CA-TRANSACTION-ASPV = SPACES                          00193300
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00193400
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00193500
                   MOVE YELLOW-COLOR TO MESSAG1C                        00193600
                   PERFORM 8000-SEND-PAGE                               00193700
               ELSE                                                     00193800
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00193900
                   PERFORM 6600-XCTL-ASPV.                              00194000
                                                                        00194100
      *  HANDLE PF22 CD                                                 00194200
           IF EIBAID = DFHPF22                                          00194300
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00194400
               IF WS-UPDATE-PENDING                                     00194500
                   PERFORM 2150-UPDATE-PENDING                          00194600
               ELSE                                                     00194700
               IF CA-TRANSACTION-ASCD = SPACES                          00194800
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00194900
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00195000
                   MOVE YELLOW-COLOR TO MESSAG1C                        00195100
                   PERFORM 8000-SEND-PAGE                               00195200
               ELSE                                                     00195300
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00195400
                   PERFORM 5300-XCTL-ASCD.                              00195500
                                                                        00195600
      *  HANDLE PF23 UW                                                 00195700
           IF EIBAID = DFHPF23                                          00195800
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00195900
               IF WS-UPDATE-PENDING                                     00196000
                   PERFORM 2150-UPDATE-PENDING                          00196100
               ELSE                                                     00196200
               IF CA-TRANSACTION-ASUW = SPACES                          00196300
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00196400
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00196500
                   MOVE YELLOW-COLOR TO MESSAG1C                        00196600
                   PERFORM 8000-SEND-PAGE                               00196700
               ELSE                                                     00196800
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00196900
                   PERFORM 7100-XCTL-ASUW.                              00197000
                                                                        00197100
      *  HANDLE PF24 PI                                                 00197200
           IF EIBAID = DFHPF24                                          00197300
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00197400
               IF WS-UPDATE-PENDING                                     00197500
                   PERFORM 2150-UPDATE-PENDING                          00197600
               ELSE                                                     00197700
               IF CA-TRANSACTION-ASPI = SPACES                          00197800
                   MOVE WS-UNAUTHORIZED-MSG TO MESSAG1O                 00197900
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00198000
                   MOVE YELLOW-COLOR TO MESSAG1C                        00198100
                   PERFORM 8000-SEND-PAGE                               00198200
               ELSE                                                     00198300
                   PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT          00198400
                   PERFORM 6500-XCTL-ASPI.                              00198500
                                                                        00198600
      *  HANDLE SELECTION                                               00198700
           IF EIBAID = DFHENTER                                         00198800
               PERFORM 2100-CHECK-FOR-UPDATES THRU 2100-EXIT            00198900
               IF WS-UPDATE-PENDING                                     00199000
                   PERFORM 2150-UPDATE-PENDING                          00199100
               ELSE                                                     00199200
                   PERFORM 3600-ENTER-FUNCTION.                         00199300
                                                                        00199400
      *  HANDLE ANY INVALID REQUESTS                                    00199500
           PERFORM 2200-SET-MDT THRU 2200-EXIT.                         00199600
           MOVE 'E002' TO WS-MESSAGE-CODE-HOLD.                         00199700
           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.               00199800
           PERFORM 8000-SEND-PAGE.                                      00199900
                                                                        00200000
      ***********************************************************       00200100
      * C H E C K   S C R E E N   F O R   A N Y   U P D A T E S *       00200200
      ***********************************************************       00200300
       2100-CHECK-FOR-UPDATES.                                          00200400
                                                                        00200500
      *  IF THE USER ONLY HAS BROWSE ACCESS, DON'T CHECK                00200600
           IF CA-TRANSACTION-ASPC = 'B'                                 00200700
               GO TO 2100-EXIT.                                         00200800
                                                                        00200900
           IF CA-PREV-PAGE-NUM = 1                                      00201000
                NEXT SENTENCE                                           00201100
           ELSE                                                         00201200
               IF TITLE1L > ZERO OR                                     00201300
                  PROAMT1L > ZERO OR                                    00201400
                  REVAMT1L > ZERO OR                                    00201500
                  RC1L > ZERO OR                                        00201600
                  TITLE2L > ZERO OR                                     00201700
                  PROAMT2L > ZERO OR                                    00201800
                  REVAMT2L > ZERO OR                                    00201900
                  RC2L     > ZERO OR                                    00202000
                  TITLE3L > ZERO OR                                     00202100
                  PROAMT3L > ZERO OR                                    00202200
                  REVAMT3L > ZERO OR                                    00202300
                  RC3L     > ZERO OR                                    00202400
                  TITLE4L > ZERO OR                                     00202500
                  PROAMT4L > ZERO OR                                    00202600
                  REVAMT4L > ZERO OR                                    00202700
                  RC4L     > ZERO OR                                    00202800
                  TITLE5L > ZERO OR                                     00202900
                  PROAMT5L > ZERO OR                                    00203000
                  REVAMT5L > ZERO OR                                    00203100
                  RC5L     > ZERO OR                                    00203200
                  TITLE6L > ZERO OR                                     00203300
                  PROAMT6L > ZERO OR                                    00203400
                  REVAMT6L > ZERO OR                                    00203500
                  RC6L     > ZERO OR                                    00203600
                  TITLE7L > ZERO OR                                     00203700
                  PROAMT7L > ZERO OR                                    00203800
                  REVAMT7L > ZERO OR                                    00203900
                  RC7L     > ZERO OR                                    00204000
                  TITLE8L > ZERO OR                                     00204100
                  PROAMT8L > ZERO OR                                    00204200
                  REVAMT8L > ZERO OR                                    00204300
                  RC8L     > ZERO OR                                    00204400
                  DENTY1L > ZERO OR                                     00204500
                  DENTY2L > ZERO OR                                     00204600
                  DENTY3L > ZERO OR                                     00204700
                  DENTY4L > ZERO OR                                     00204800
                  DENTY5L > ZERO OR                                     00204900
                  DENTY6L > ZERO OR                                     00205000
                  DENTY7L > ZERO OR                                     00205100
                  DENTY8L > ZERO OR                                     00205200
                  STATUS1L > ZERO OR                                    00205300
                  STATUS2L > ZERO OR                                    00205400
                  STATUS3L > ZERO OR                                    00205500
                  STATUS4L > ZERO OR                                    00205600
                  STATUS5L > ZERO OR                                    00205700
                  STATUS6L > ZERO OR                                    00205800
                  STATUS7L > ZERO OR                                    00205900
                  STATUS8L > ZERO                                       00206000
                      MOVE 'Y' TO WS-UPDATE-PENDING-FLAG.               00206100
                                                                        00206200
       2100-EXIT.                                                       00206300
           EXIT.                                                        00206400
       EJECT                                                            00206500
      ***********************************************************       00206600
      *          U P D A T E    P E N D I N G                   *       00206700
      ***********************************************************       00206800
       2150-UPDATE-PENDING.                                             00206900
              MOVE WS-UPDATE-PENDING-CLR-MSG TO MESSAG1O.               00207000
              MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG.                  00207100
              MOVE YELLOW-COLOR TO MESSAG1C.                            00207200
              PERFORM 2200-SET-MDT THRU 2200-EXIT.                      00207300
              PERFORM 8000-SEND-PAGE.                                   00207400
       EJECT                                                            00207500
      ***********************************************************       00207600
      *   S E T   M D T   F O R   U P D A T E D   F I E L D S   *       00207700
      ***********************************************************       00207800
       2200-SET-MDT.                                                    00207900
                                                                        00208000
           IF CA-PREV-PAGE-NUM = 1                                      00208100
               NEXT SENTENCE                                            00208200
           ELSE                                                         00208300
               PERFORM 2220-SET-MDT-2 THRU 2220-EXIT.                   00208400
                                                                        00208500
       2200-EXIT.                                                       00208600
           EXIT.                                                        00208700
       EJECT                                                            00208800
       2220-SET-MDT-2.                                                  00208900
                                                                        00209000
           IF TITLE1L  > ZERO OR = -1                                   00209100
               MOVE UNPROT-MDT TO TITLE1F.                              00209200
           IF PROAMT1L  > ZERO OR = -1                                  00209300
               MOVE UNPROT-MDT TO PROAMT1F.                             00209400
           IF REVAMT1L     > ZERO OR = -1                               00209500
               MOVE UNPROT-MDT TO REVAMT1F.                             00209600
           IF RC1L        > ZERO OR = -1                                00209700
               MOVE UNPROT-MDT TO RC1F.                                 00209800
           IF TITLE2L  > ZERO OR = -1                                   00209900
               MOVE UNPROT-MDT TO TITLE2F.                              00210000
           IF PROAMT2L  > ZERO OR = -1                                  00210100
               MOVE UNPROT-MDT TO PROAMT2F.                             00210200
           IF REVAMT2L     > ZERO OR = -1                               00210300
               MOVE UNPROT-MDT TO REVAMT2F.                             00210400
           IF RC2L        > ZERO OR = -1                                00210500
               MOVE UNPROT-MDT TO RC2F.                                 00210600
           IF TITLE3L  > ZERO OR = -1                                   00210700
               MOVE UNPROT-MDT TO TITLE3F.                              00210800
           IF PROAMT3L  > ZERO OR = -1                                  00210900
               MOVE UNPROT-MDT TO PROAMT3F.                             00211000
           IF REVAMT3L     > ZERO OR = -1                               00211100
               MOVE UNPROT-MDT TO REVAMT3F.                             00211200
           IF RC3L        > ZERO OR = -1                                00211300
               MOVE UNPROT-MDT TO RC3F.                                 00211400
           IF TITLE4L  > ZERO OR = -1                                   00211500
               MOVE UNPROT-MDT TO TITLE4F.                              00211600
           IF PROAMT4L  > ZERO OR = -1                                  00211700
               MOVE UNPROT-MDT TO PROAMT4F.                             00211800
           IF REVAMT4L     > ZERO OR = -1                               00211900
               MOVE UNPROT-MDT TO REVAMT4F.                             00212000
           IF RC4L        > ZERO OR = -1                                00212100
               MOVE UNPROT-MDT TO RC4F.                                 00212200
           IF TITLE5L  > ZERO OR = -1                                   00212300
               MOVE UNPROT-MDT TO TITLE5F.                              00212400
           IF PROAMT5L  > ZERO OR = -1                                  00212500
               MOVE UNPROT-MDT TO PROAMT5F.                             00212600
           IF REVAMT5L     > ZERO OR = -1                               00212700
               MOVE UNPROT-MDT TO REVAMT5F.                             00212800
           IF RC5L        > ZERO OR = -1                                00212900
               MOVE UNPROT-MDT TO RC5F.                                 00213000
           IF TITLE6L  > ZERO OR = -1                                   00213100
               MOVE UNPROT-MDT TO TITLE6F.                              00213200
           IF PROAMT6L  > ZERO OR = -1                                  00213300
               MOVE UNPROT-MDT TO PROAMT6F.                             00213400
           IF REVAMT6L     > ZERO OR = -1                               00213500
               MOVE UNPROT-MDT TO REVAMT6F.                             00213600
           IF RC6L        > ZERO OR = -1                                00213700
               MOVE UNPROT-MDT TO RC6F.                                 00213800
           IF TITLE7L  > ZERO OR = -1                                   00213900
               MOVE UNPROT-MDT TO TITLE7F.                              00214000
           IF PROAMT7L  > ZERO OR = -1                                  00214100
               MOVE UNPROT-MDT TO PROAMT7F.                             00214200
           IF REVAMT7L     > ZERO OR = -1                               00214300
               MOVE UNPROT-MDT TO REVAMT7F.                             00214400
           IF RC7L        > ZERO OR = -1                                00214500
               MOVE UNPROT-MDT TO RC7F.                                 00214600
           IF TITLE8L  > ZERO OR = -1                                   00214700
               MOVE UNPROT-MDT TO TITLE8F.                              00214800
           IF PROAMT8L  > ZERO OR = -1                                  00214900
               MOVE UNPROT-MDT TO PROAMT8F.                             00215000
           IF REVAMT8L     > ZERO OR = -1                               00215100
               MOVE UNPROT-MDT TO REVAMT8F.                             00215200
           IF RC8L        > ZERO OR = -1                                00215300
               MOVE UNPROT-MDT TO RC8F.                                 00215400
                                                                        00215500
           IF DENTY1L     > ZERO OR = -1                                00215600
               MOVE UNPROT-MDT TO DENTY1F.                              00215700
           IF DENTY2L     > ZERO OR = -1                                00215800
               MOVE UNPROT-MDT TO DENTY2F.                              00215900
           IF DENTY3L     > ZERO OR = -1                                00216000
               MOVE UNPROT-MDT TO DENTY3F.                              00216100
           IF DENTY4L     > ZERO OR = -1                                00216200
               MOVE UNPROT-MDT TO DENTY4F.                              00216300
           IF DENTY5L     > ZERO OR = -1                                00216400
               MOVE UNPROT-MDT TO DENTY5F.                              00216500
           IF DENTY6L     > ZERO OR = -1                                00216600
               MOVE UNPROT-MDT TO DENTY6F.                              00216700
           IF DENTY7L     > ZERO OR = -1                                00216800
               MOVE UNPROT-MDT TO DENTY7F.                              00216900
           IF DENTY8L     > ZERO OR = -1                                00217000
               MOVE UNPROT-MDT TO DENTY8F.                              00217100
                                                                        00217200
           IF STATUS1L    > ZERO OR = -1                                00217300
               MOVE UNPROT-MDT TO STATUS1F.                             00217400
           IF STATUS2L    > ZERO OR = -1                                00217500
               MOVE UNPROT-MDT TO STATUS2F.                             00217600
           IF STATUS3L    > ZERO OR = -1                                00217700
               MOVE UNPROT-MDT TO STATUS3F.                             00217800
           IF STATUS4L    > ZERO OR = -1                                00217900
               MOVE UNPROT-MDT TO STATUS4F.                             00218000
           IF STATUS5L    > ZERO OR = -1                                00218100
               MOVE UNPROT-MDT TO STATUS5F.                             00218200
           IF STATUS6L    > ZERO OR = -1                                00218300
               MOVE UNPROT-MDT TO STATUS6F.                             00218400
           IF STATUS7L    > ZERO OR = -1                                00218500
               MOVE UNPROT-MDT TO STATUS7F.                             00218600
           IF STATUS8L    > ZERO OR = -1                                00218700
               MOVE UNPROT-MDT TO STATUS8F.                             00218800
                                                                        00218900
       2220-EXIT.                                                       00219000
           EXIT.                                                        00219100
       EJECT                                                            00219200
      ***********************************************************       00219300
      *               V A L I D A T E   S C R E E N             *       00219400
      ***********************************************************       00219500
       2300-VALIDATE-SCREEN.                                            00219600
                                                                        00219700
      *  IF THIS IS A NEW RECORD, VALIDATE OPTION INVALID               00219800
           IF CA-LAST-REQ-NEW                                           00219900
               MOVE 'E845' TO WS-MESSAGE-CODE-HOLD                      00220000
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00220100
               GO TO 8000-SEND-PAGE.                                    00220200
                                                                        00220300
      *  CALL PROGRAM TO CHECK FOR VALID DATA                           00220400
           MOVE 'ASPD' TO WS-VALIDATE-SCREEN-ID.                        00220500
           MOVE WS-DE-ITEM-NUM TO WS-ITEM-NUM-1.                        00220600
           MOVE WS-DE-RECORD-LENGTH TO WS-RECORD-LENGTH-1.              00220700
                                                                        00220800
           MOVE WS-VALIDATE-RECORD TO CA-GENERAL.                       00220900
                                                                        00221000
           EXEC CICS LINK                                               00221100
                     PROGRAM('D681VALD')                                00221200
                     COMMAREA(DFHCOMMAREA)                              00221300
                     LENGTH(EIBCALEN)                                   00221400
           END-EXEC.                                                    00221500
                                                                        00221600
           MOVE CA-GENERAL TO WS-VALIDATE-RECORD.                       00221700
                                                                        00221800
           IF WS-VALIDATED                                              00221900
               MOVE 'I003' TO WS-MESSAGE-CODE-HOLD                      00222000
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00222100
           ELSE                                                         00222200
               PERFORM 2310-SEND-MSGS THRU 2310-EXIT                    00222300
                   VARYING WS-SUB FROM +1 BY +1                         00222400
                   UNTIL WS-SUB > 9.                                    00222500
                                                                        00222600
      *  SEND SCREEN                                                    00222700
           PERFORM 8000-SEND-PAGE.                                      00222800
                                                                        00222900
       2300-EXIT.                                                       00223000
           EXIT.                                                        00223100
       EJECT                                                            00223200
       2310-SEND-MSGS.                                                  00223300
                                                                        00223400
           IF WS-VALIDATE-MSG(WS-SUB) = LOW-VALUES OR SPACES            00223500
               GO TO 2310-EXIT.                                         00223600
                                                                        00223700
           MOVE WS-VALIDATE-MSG(WS-SUB) TO WS-MESSAGE-CODE-HOLD.        00223800
           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.               00223900
                                                                        00224000
       2310-EXIT.                                                       00224100
           EXIT.                                                        00224200
       EJECT                                                            00224300
      ***********************************************************       00224400
      *          S E N D   H E L P   S C R E E N                *       00224500
      ***********************************************************       00224600
       2400-PF1-FUNCTION-SEND.                                          00224700
                                                                        00224800
      *  SET MDT FOR ANY PENDING UPDATES                                00224900
           PERFORM 2200-SET-MDT THRU 2200-EXIT.                         00225000
                                                                        00225100
      *  READ DE RECORD FROM TEMP STORAGE                               00225200
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00225300
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00225400
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00225500
                                                                        00225600
           MOVE WS-RECORD-INFO TO DE-INFO.                              00225700
                                                                        00225800
      *  MOVE ANY NON-UPDATED VALUES INTO THE MAP                       00225900
           PERFORM 2410-HLP-MOVE-VALUES THRU 2410-EXIT.                 00226000
                                                                        00226100
                                                                        00226200
      *  WRITE SCREEN MAP TO TS QUEUE                                   00226300
           MOVE WS-HOLD-SCREEN-ITEM-NUM TO CA-ITEM-NUM.                 00226400
           MOVE WS-HOLD-SCREEN-RECORD-LENGTH TO CA-RECORD-LENGTH.       00226500
           IF CA-PREV-PAGE-NUM = 1                                      00226600
               MOVE MAPPD1AI TO WS-RECORD                               00226700
           ELSE                                                         00226800
               MOVE MAPPD2AI TO WS-RECORD.                              00226900
                                                                        00227000
           IF WS-HOLD-SCREEN-ITEM-NUM > 0                               00227100
               PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT             00227200
           ELSE                                                         00227300
               PERFORM 4920-WRITE-TS-QUEUE THRU 4920-EXIT               00227400
               MOVE CA-ITEM-NUM TO WS-HOLD-SCREEN-ITEM-NUM.             00227500
                                                                        00227600
           MOVE SPACES TO WS-HELP-COMPLETED-FLAG                        00227700
                          WS-HELP-FIRST-REC-KEY                         00227800
                          WS-HELP-LAST-REC-KEY.                         00227900
           MOVE '1' TO WS-HELP-PAGE-NUM.                                00228000
           MOVE 'F' TO WS-HELP-DIRECTION.                               00228100
                                                                        00228200
           PERFORM 2405-CREATE-HELP-SCREEN THRU 2405-EXIT.              00228300
                                                                        00228400
       2400-EXIT.                                                       00228500
           EXIT.                                                        00228600
                                                                        00228700
                                                                        00228800
       2405-CREATE-HELP-SCREEN.                                         00228900
                                                                        00229000
           MOVE WS-HELP-RECORD TO CA-GENERAL.                           00229100
                                                                        00229200
           EXEC CICS LINK                                               00229300
                     PROGRAM('D681HELP')                                00229400
                     COMMAREA(DFHCOMMAREA)                              00229500
                     LENGTH(EIBCALEN)                                   00229600
           END-EXEC.                                                    00229700
                                                                        00229800
           MOVE CA-GENERAL TO WS-HELP-RECORD.                           00229900
                                                                        00230000
           IF WS-HELP-SUCCESSFUL                                        00230100
               PERFORM 2430-BUILD-HELP THRU 2430-EXIT                   00230200
               MOVE WS-HELP-FIRST-REC-KEY                               00230300
                 TO WS-HELP-SCREEN-FIRST-REC-KEY                        00230400
               MOVE WS-HELP-LAST-REC-KEY                                00230500
                 TO WS-HELP-SCREEN-LAST-REC-KEY                         00230600
               MOVE WS-HELP-ITEM-NUM TO WS-HELP-SCREEN-ITEM-NUM         00230700
               PERFORM 8500-SEND-HLP-SCREEN                             00230800
           ELSE                                                         00230900
               PERFORM 2420-SEND-MSGS THRU 2420-EXIT                    00231000
                   VARYING WS-SUB FROM +1 BY +1                         00231100
                   UNTIL WS-SUB > 9                                     00231200
      *  READ SCREEN MAP FROM TS QUEUE                                  00231300
               MOVE WS-HOLD-SCREEN-ITEM-NUM TO CA-ITEM-NUM              00231400
               MOVE WS-HOLD-SCREEN-RECORD-LENGTH TO CA-RECORD-LENGTH    00231500
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00231600
               IF CA-PREV-PAGE-NUM = 1                                  00231700
                   MOVE WS-RECORD TO MAPPD1AO                           00231800
               ELSE                                                     00231900
                   MOVE WS-RECORD TO MAPPD2AO                           00232000
               END-IF                                                   00232100
      *  SET THE HLP FLAG IN THE COMMAREA BACK TO SPACES                00232200
               MOVE ' ' TO CA-LAST-REQUEST                              00232300
      *  SET THE ERASE FLAG AND SEND SCREEN                             00232400
               MOVE 'Y' TO WS-ERASE-SCREEN-FLAG                         00232500
               PERFORM 8000-SEND-PAGE.                                  00232600
                                                                        00232700
       2405-EXIT.                                                       00232800
           EXIT.                                                        00232900
       EJECT                                                            00233000
       2410-HLP-MOVE-VALUES.                                            00233100
                                                                        00233200
           IF CA-PREV-PAGE-NUM = 1                                      00233300
               PERFORM 2411-HLP-MOVE-VALUES-1 THRU 2411-EXIT            00233400
               GO TO 2410-EXIT                                          00233500
           ELSE                                                         00233600
               MOVE WS-DISPLAY-ITEM-NUM TO CA-ITEM-NUM                  00233700
               MOVE WS-DISPLAY-RECORD-LENGTH TO CA-RECORD-LENGTH        00233800
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00233900
               MOVE WS-RECORD TO WS-DISPLAY-AREA                        00234000
               PERFORM 2412-HLP-MOVE-VALUES-2 THRU 2412-EXIT.           00234100
                                                                        00234200
           IF (CA-PREV-PAGE-NUM = 2) AND (WS-DISPLAY-TOTAL > 8)         00234300
               MOVE PROT-DARK TO TOTALF                                 00234400
                                 DSIGNT1F                               00234500
                                 PROAMTTF                               00234600
                                 DSIGNT2F                               00234700
                                 REVAMTTF                               00234800
               GO TO 2410-EXIT.                                         00234900
                                                                        00235000
           MOVE +0 TO WS-DISPLAY-AMT-ORG                                00235100
                      WS-DISPLAY-AMT-REV.                               00235200
                                                                        00235300
           PERFORM 1119-COMPUTE-BEN THRU 1119-EXIT                      00235400
               VARYING WS-SUB FROM +1 BY +1                             00235500
               UNTIL WS-SUB > DE-BEN-OCCUR-NUM.                         00235600
                                                                        00235700
           MOVE WS-DISPLAY-AMT-ORG TO WS-AMOUNT-9-2.                    00235800
           MOVE WS-AMOUNT-9-2 TO PROAMTTO.                              00235900
           IF DE-REV OR DE-ADJ                                          00236000
               MOVE WS-DISPLAY-AMT-REV TO WS-AMOUNT-9-2                 00236100
               MOVE WS-AMOUNT-9-2 TO REVAMTTO.                          00236200
                                                                        00236300
       2410-EXIT.                                                       00236400
           EXIT.                                                        00236500
       EJECT                                                            00236600
       2411-HLP-MOVE-VALUES-1.                                          00236700
                                                                        00236800
           MOVE DE-REC-ADD-MO TO WS-DATE-FORMAT-1.                      00236900
           MOVE DE-REC-ADD-DY TO WS-DATE-FORMAT-2.                      00237000
           MOVE DE-REC-ADD-YR TO WS-DATE-FORMAT-3.                      00237100
           MOVE WS-DATE-FORMAT TO TRXADDTO.                             00237200
                                                                        00237300
           IF DE-REV                                                    00237400
               MOVE 'REV DT:' TO REVLABO                                00237500
               MOVE DE-REV-ADJ-MO TO WS-DATE-FORMAT-1                   00237600
               MOVE DE-REV-ADJ-DY TO WS-DATE-FORMAT-2                   00237700
               MOVE DE-REV-ADJ-YR TO WS-DATE-FORMAT-3                   00237800
               MOVE WS-DATE-FORMAT TO REVDTO                            00237900
               MOVE '**  REVERSAL  **' TO REVAREAO                      00238000
           ELSE IF DE-ADJ                                               00238100
               MOVE 'ADJ DT:' TO REVLABO                                00238200
               MOVE DE-REV-ADJ-MO TO WS-DATE-FORMAT-1                   00238300
               MOVE DE-REV-ADJ-DY TO WS-DATE-FORMAT-2                   00238400
               MOVE DE-REV-ADJ-YR TO WS-DATE-FORMAT-3                   00238500
               MOVE WS-DATE-FORMAT TO REVDTO                            00238600
               MOVE '** ADJUSTMENT **' TO REVAREAO.                     00238700
                                                                        00238800
           IF DE-PAID-DT NUMERIC                                        00238900
               MOVE DE-PAID-MO TO WS-DATE-FORMAT-1                      00239000
               MOVE DE-PAID-DY TO WS-DATE-FORMAT-2                      00239100
               MOVE DE-PAID-YR TO WS-DATE-FORMAT-3                      00239200
               MOVE WS-DATE-FORMAT TO RLSEDDTO.                         00239300
                                                                        00239400
           IF PDEXAML NOT > 0                                           00239500
               MOVE DE-PAID-EXAM TO PDEXAMO.                            00239600
           IF PBAPROVL NOT > 0                                          00239700
               MOVE DE-APROV-PB TO PBAPROVO.                            00239800
           IF VPAPROVL NOT > 0                                          00239900
               MOVE DE-APROV-VP TO VPAPROVO.                            00240000
           IF OTHAPROL NOT > 0                                          00240100
               MOVE DE-APROV-OTH TO OTHAPROO.                           00240200
                                                                        00240300
       2411-EXIT.                                                       00240400
           EXIT.                                                        00240500
       EJECT                                                            00240600
       2412-HLP-MOVE-VALUES-2.                                          00240700
                                                                        00240800
      *  BUILD SCREEN                                                   00240900
           IF WS-DISPLAY-TOTAL = 0                                      00241000
               GO TO 2412-EXIT.                                         00241100
                                                                        00241200
           IF CA-PREV-PAGE-NUM = 2                                      00241300
               MOVE +1 TO WS-SUB-DISPLAY                                00241400
           ELSE                                                         00241500
               MOVE +9 TO WS-SUB-DISPLAY.                               00241600
                                                                        00241700
           MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL1O.           00241800
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS1O.             00241900
           MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE1O.         00242000
           IF PROAMT1L NOT > 0                                          00242100
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00242200
               MOVE WS-AMOUNT-9-2 TO PROAMT1O                           00242300
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00242400
                   MOVE '-' TO OPERTR1O.                                00242500
           IF REVAMT1L NOT > 0                                          00242600
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00242700
               MOVE WS-AMOUNT-9-2 TO REVAMT1O                           00242800
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00242900
                   MOVE '-' TO OPERTR1O.                                00243000
           IF RC1L     NOT > 0                                          00243100
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC1O.              00243200
                                                                        00243300
           IF WS-DISPLAY-TOTAL = WS-SUB-DISPLAY                         00243400
               GO TO 2412-EXIT                                          00243500
           ELSE                                                         00243600
               ADD +1 TO WS-SUB-DISPLAY.                                00243700
                                                                        00243800
           MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL2O.           00243900
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS2O.             00244000
           MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE2O.         00244100
           IF PROAMT2L NOT > 0                                          00244200
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00244300
               MOVE WS-AMOUNT-9-2 TO PROAMT2O                           00244400
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00244500
                   MOVE '-' TO OPERTR2O.                                00244600
           IF REVAMT2L NOT > 0                                          00244700
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00244800
               MOVE WS-AMOUNT-9-2 TO REVAMT2O                           00244900
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00245000
                   MOVE '-' TO OPERTR2O.                                00245100
           IF RC2L     NOT > 0                                          00245200
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC2O.              00245300
                                                                        00245400
           IF WS-DISPLAY-TOTAL = WS-SUB-DISPLAY                         00245500
               GO TO 2412-EXIT                                          00245600
           ELSE                                                         00245700
               ADD +1 TO WS-SUB-DISPLAY.                                00245800
                                                                        00245900
           MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL3O.           00246000
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS3O.             00246100
           MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE3O.         00246200
           IF PROAMT3L NOT > 0                                          00246300
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00246400
               MOVE WS-AMOUNT-9-2 TO PROAMT3O                           00246500
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00246600
                   MOVE '-' TO OPERTR3O.                                00246700
           IF REVAMT3L NOT > 0                                          00246800
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00246900
               MOVE WS-AMOUNT-9-2 TO REVAMT3O                           00247000
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00247100
                   MOVE '-' TO OPERTR3O.                                00247200
           IF RC3L     NOT > 0                                          00247300
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC3O.              00247400
                                                                        00247500
           IF WS-DISPLAY-TOTAL = WS-SUB-DISPLAY                         00247600
               GO TO 2412-EXIT                                          00247700
           ELSE                                                         00247800
               ADD +1 TO WS-SUB-DISPLAY.                                00247900
                                                                        00248000
           MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL4O.           00248100
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS4O.             00248200
           MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE4O.         00248300
           IF PROAMT4L NOT > 0                                          00248400
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00248500
               MOVE WS-AMOUNT-9-2 TO PROAMT4O                           00248600
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00248700
                   MOVE '-' TO OPERTR4O.                                00248800
           IF REVAMT4L NOT > 0                                          00248900
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00249000
               MOVE WS-AMOUNT-9-2 TO REVAMT4O                           00249100
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00249200
                   MOVE '-' TO OPERTR4O.                                00249300
           IF RC4L     NOT > 0                                          00249400
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC4O.              00249500
                                                                        00249600
           IF WS-DISPLAY-TOTAL = WS-SUB-DISPLAY                         00249700
               GO TO 2412-EXIT                                          00249800
           ELSE                                                         00249900
               ADD +1 TO WS-SUB-DISPLAY.                                00250000
                                                                        00250100
           MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL5O.           00250200
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS5O.             00250300
           MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE5O.         00250400
           IF PROAMT5L NOT > 0                                          00250500
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00250600
               MOVE WS-AMOUNT-9-2 TO PROAMT5O                           00250700
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00250800
                   MOVE '-' TO OPERTR5O.                                00250900
           IF REVAMT5L NOT > 0                                          00251000
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00251100
               MOVE WS-AMOUNT-9-2 TO REVAMT5O                           00251200
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00251300
                   MOVE '-' TO OPERTR5O.                                00251400
           IF RC5L     NOT > 0                                          00251500
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC5O.              00251600
                                                                        00251700
           IF WS-DISPLAY-TOTAL = WS-SUB-DISPLAY                         00251800
               GO TO 2412-EXIT                                          00251900
           ELSE                                                         00252000
               ADD +1 TO WS-SUB-DISPLAY.                                00252100
                                                                        00252200
           MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL6O.           00252300
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS6O.             00252400
           MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE6O.         00252500
           IF PROAMT6L NOT > 0                                          00252600
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00252700
               MOVE WS-AMOUNT-9-2 TO PROAMT6O                           00252800
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00252900
                   MOVE '-' TO OPERTR6O.                                00253000
           IF REVAMT6L NOT > 0                                          00253100
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00253200
               MOVE WS-AMOUNT-9-2 TO REVAMT6O                           00253300
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00253400
                   MOVE '-' TO OPERTR6O.                                00253500
           IF RC6L     NOT > 0                                          00253600
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC6O.              00253700
                                                                        00253800
           IF WS-DISPLAY-TOTAL = WS-SUB-DISPLAY                         00253900
               GO TO 2412-EXIT                                          00254000
           ELSE                                                         00254100
               ADD +1 TO WS-SUB-DISPLAY.                                00254200
                                                                        00254300
           MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL7O.           00254400
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS7O.             00254500
           MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE7O.         00254600
           IF PROAMT7L NOT > 0                                          00254700
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00254800
               MOVE WS-AMOUNT-9-2 TO PROAMT7O                           00254900
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00255000
                   MOVE '-' TO OPERTR7O.                                00255100
           IF REVAMT7L NOT > 0                                          00255200
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00255300
               MOVE WS-AMOUNT-9-2 TO REVAMT7O                           00255400
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00255500
                   MOVE '-' TO OPERTR7O.                                00255600
           IF RC7L     NOT > 0                                          00255700
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC7O.              00255800
                                                                        00255900
           IF WS-DISPLAY-TOTAL = WS-SUB-DISPLAY                         00256000
               GO TO 2412-EXIT                                          00256100
           ELSE                                                         00256200
               ADD +1 TO WS-SUB-DISPLAY.                                00256300
                                                                        00256400
           MOVE WS-DISPLAY-SELECTED(WS-SUB-DISPLAY) TO SEL8O.           00256500
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY) TO STATUS8O.             00256600
           MOVE WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) TO TITLE8O.         00256700
           IF PROAMT8L NOT > 0                                          00256800
               MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00256900
               MOVE WS-AMOUNT-9-2 TO PROAMT8O                           00257000
               IF WS-DISPLAY-AMT(WS-SUB-DISPLAY) < 0                    00257100
                   MOVE '-' TO OPERTR8O.                                00257200
           IF REVAMT8L NOT > 0                                          00257300
               MOVE WS-DISPLAY-REV(WS-SUB-DISPLAY) TO WS-AMOUNT-9-2     00257400
               MOVE WS-AMOUNT-9-2 TO REVAMT8O                           00257500
               IF WS-DISPLAY-REV(WS-SUB-DISPLAY) < 0                    00257600
                   MOVE '-' TO OPERTR8O.                                00257700
           IF RC8L     NOT > 0                                          00257800
               MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY) TO RC8O.              00257900
                                                                        00258000
       2412-EXIT.                                                       00258100
           EXIT.                                                        00258200
       EJECT                                                            00258300
       2420-SEND-MSGS.                                                  00258400
                                                                        00258500
           IF WS-HELP-MSG(WS-SUB) = LOW-VALUES OR SPACES                00258600
               GO TO 2420-EXIT.                                         00258700
                                                                        00258800
           MOVE WS-HELP-MSG(WS-SUB) TO WS-MESSAGE-CODE-HOLD.            00258900
           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.               00259000
                                                                        00259100
       2420-EXIT.                                                       00259200
           EXIT.                                                        00259300
                                                                        00259400
                                                                        00259500
       2430-BUILD-HELP.                                                 00259600
                                                                        00259700
      *  READ TS QUEUE HOLDING DISPLAY                                  00259800
           MOVE WS-HELP-ITEM-NUM TO CA-ITEM-NUM.                        00259900
           MOVE WS-HELP-RECORD-LENGTH TO CA-RECORD-LENGTH.              00260000
                                                                        00260100
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00260200
                                                                        00260300
           MOVE WS-RECORD TO WS-DISPLAY-HELP-AREA.                      00260400
                                                                        00260500
      *  MOVE DISPLAY LINES TO MAP                                      00260600
           MOVE WS-DISPLAY-HELP-MSG      TO HELPMSGO.                   00260700
           MOVE WS-DISPLAY-HELP-LINE(01) TO HELPL01O.                   00260800
           MOVE WS-DISPLAY-HELP-LINE(02) TO HELPL02O.                   00260900
           MOVE WS-DISPLAY-HELP-LINE(03) TO HELPL03O.                   00261000
           MOVE WS-DISPLAY-HELP-LINE(04) TO HELPL04O.                   00261100
           MOVE WS-DISPLAY-HELP-LINE(05) TO HELPL05O.                   00261200
           MOVE WS-DISPLAY-HELP-LINE(06) TO HELPL06O.                   00261300
           MOVE WS-DISPLAY-HELP-LINE(07) TO HELPL07O.                   00261400
           MOVE WS-DISPLAY-HELP-LINE(08) TO HELPL08O.                   00261500
           MOVE WS-DISPLAY-HELP-LINE(09) TO HELPL09O.                   00261600
           MOVE WS-DISPLAY-HELP-LINE(10) TO HELPL10O.                   00261700
           MOVE WS-DISPLAY-HELP-LINE(11) TO HELPL11O.                   00261800
           MOVE WS-DISPLAY-HELP-LINE(12) TO HELPL12O.                   00261900
           MOVE WS-DISPLAY-HELP-LINE(13) TO HELPL13O.                   00262000
           MOVE WS-DISPLAY-HELP-LINE(14) TO HELPL14O.                   00262100
           MOVE WS-DISPLAY-HELP-LINE(15) TO HELPL15O.                   00262200
           MOVE WS-DISPLAY-HELP-LINE(16) TO HELPL16O.                   00262300
           MOVE WS-DISPLAY-HELP-LINE(17) TO HELPL17O.                   00262400
           MOVE WS-DISPLAY-HELP-LINE(18) TO HELPL18O.                   00262500
           MOVE WS-DISPLAY-HELP-LINE(19) TO HELPL19O.                   00262600
           MOVE WS-DISPLAY-HELP-LINE(20) TO HELPL20O.                   00262700
                                                                        00262800
       2430-EXIT.                                                       00262900
           EXIT.                                                        00263000
      ***********************************************************       00263100
      *      R E T U R N   F R O M   H E L P   S C R E E N      *       00263200
      ***********************************************************       00263300
       2490-PF1-FUNCTION-RETURN.                                        00263400
                                                                        00263500
      *  CHECK PF KEYS                                                  00263600
           IF EIBAID = DFHPF7                                           00263700
               MOVE WS-HELP-SCREEN-ITEM-NUM TO WS-HELP-ITEM-NUM         00263800
               MOVE WS-HELP-SCREEN-FIRST-REC-KEY                        00263900
                 TO WS-HELP-FIRST-REC-KEY                               00264000
               MOVE WS-HELP-SCREEN-LAST-REC-KEY                         00264100
                 TO WS-HELP-LAST-REC-KEY                                00264200
               MOVE '1' TO WS-HELP-PAGE-NUM                             00264300
               MOVE 'B' TO WS-HELP-DIRECTION                            00264400
               PERFORM 2405-CREATE-HELP-SCREEN THRU 2405-EXIT           00264500
           ELSE IF EIBAID = DFHPF8                                      00264600
               MOVE WS-HELP-SCREEN-ITEM-NUM TO WS-HELP-ITEM-NUM         00264700
               MOVE WS-HELP-SCREEN-FIRST-REC-KEY                        00264800
                 TO WS-HELP-FIRST-REC-KEY                               00264900
               MOVE WS-HELP-SCREEN-LAST-REC-KEY                         00265000
                 TO WS-HELP-LAST-REC-KEY                                00265100
               MOVE '1' TO WS-HELP-PAGE-NUM                             00265200
               MOVE 'F' TO WS-HELP-DIRECTION                            00265300
               PERFORM 2405-CREATE-HELP-SCREEN THRU 2405-EXIT           00265400
           ELSE IF EIBAID = DFHPF3                                      00265500
      *  READ SCREEN MAP FROM TS QUEUE                                  00265600
               MOVE WS-HOLD-SCREEN-ITEM-NUM TO CA-ITEM-NUM              00265700
               MOVE WS-HOLD-SCREEN-RECORD-LENGTH TO CA-RECORD-LENGTH    00265800
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00265900
               IF CA-PREV-PAGE-NUM = 1                                  00266000
                   MOVE WS-RECORD TO MAPPD1AO                           00266100
               ELSE                                                     00266200
                   MOVE WS-RECORD TO MAPPD2AO                           00266300
               END-IF                                                   00266400
      *  SET THE HLP FLAG IN THE COMMAREA BACK TO SPACES                00266500
               MOVE ' ' TO CA-LAST-REQUEST                              00266600
      *  SET THE ERASE FLAG AND SEND SCREEN                             00266700
               MOVE 'Y' TO WS-ERASE-SCREEN-FLAG                         00266800
               PERFORM 8000-SEND-PAGE                                   00266900
           ELSE                                                         00267000
               MOVE WS-HELP-SCREEN-ITEM-NUM TO WS-HELP-ITEM-NUM         00267100
               PERFORM 2430-BUILD-HELP THRU 2430-EXIT                   00267200
               MOVE SPACES TO HELPMSGO                                  00267300
               MOVE 'INVALID KEY' TO HELPMSGO                           00267400
               PERFORM 8500-SEND-HLP-SCREEN.                            00267500
                                                                        00267600
       2490-EXIT.                                                       00267700
           EXIT.                                                        00267800
       EJECT                                                            00267900
      ***********************************************************       00268000
      *       P F 4     P R E V I O U S   P O L I C Y           *       00268100
      ***********************************************************       00268200
       2500-PF4-FUNCTION.                                               00268300
                                                                        00268400
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00268500
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00268600
                                                                        00268700
           MOVE CA-PREV-PAGE-NUM TO WS-BUILD-PAGE-IND.                  00268800
           SUBTRACT +1 FROM WS-BUILD-PAGE-IND.                          00268900
                                                                        00269000
      *  START BROWSE ON MASTER FILE AT CURRENT DE RECORD               00269100
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00269200
           MOVE WS-DISPLAYED-RECORD-KEY TO CA-AK-FILE-KEY.              00269300
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00269400
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00269500
                                                                        00269600
      *  READ PREV TO GET CURRENT DE RECORD                             00269700
      *  A CICS LIMITATION REQUIRES THAT A READNXT AND TWO READPRV'S    00269800
      *   BE USED TO GET THE PREVIOUS RECORD                            00269900
           MOVE  'RN' TO CA-ACCESS-TYPE.                                00270000
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00270100
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00270200
           MOVE  'RP' TO CA-ACCESS-TYPE.                                00270300
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00270400
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT 2 TIMES.      00270500
                                                                        00270600
      *  END BROWSE ON MASTER FILE                                      00270700
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00270800
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00270900
                                                                        00271000
      *  READ RECORD FROM TS                                            00271100
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00271200
                                                                        00271300
           MOVE WS-RECORD-KEY TO AK-MST-KEY.                            00271400
           IF (AK-CLM-NUM = CA-EST-CLM-NUM) AND (AK-PYMT-REC)           00271500
               MOVE WS-RECORD-KEY TO WS-DISPLAYED-RECORD-KEY            00271600
               MOVE WS-RECORD-INFO TO DE-INFO                           00271700
               MOVE 1 TO WS-BUILD-PAGE-IND                              00271800
               MOVE SPACES TO WS-PYMT-PROT-FLAG                         00271900
               PERFORM 1110-BUILD-PAGE                                  00272000
           ELSE                                                         00272100
               MOVE 'BEG OF PAYMENT RECORDS' TO MESSAG1O                00272200
               MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG                  00272300
               MOVE YELLOW-COLOR TO MESSAG1C                            00272400
               MOVE WS-DISPLAYED-RECORD-KEY TO CA-AK-FILE-KEY           00272500
               MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM                       00272600
               MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH             00272700
               MOVE 'RD' TO CA-ACCESS-TYPE                              00272800
               MOVE 'F' TO CA-READ-TYPE                                 00272900
               MOVE SPACES TO CA-ACCESS-MSG-CODE                        00273000
               PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT           00273100
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00273200
               MOVE WS-RECORD-INFO TO DE-INFO                           00273300
               PERFORM 1110-BUILD-PAGE.                                 00273400
                                                                        00273500
       2500-EXIT.                                                       00273600
           EXIT.                                                        00273700
       EJECT                                                            00273800
      ***********************************************************       00273900
      *          P F 5     N E X T   P O L I C Y                *       00274000
      ***********************************************************       00274100
       2600-PF5-FUNCTION.                                               00274200
                                                                        00274300
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00274400
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00274500
                                                                        00274600
           MOVE CA-PREV-PAGE-NUM TO WS-BUILD-PAGE-IND.                  00274700
           ADD +1 TO WS-BUILD-PAGE-IND.                                 00274800
                                                                        00274900
      *  START BROWSE ON MASTER FILE AT CURRENT DE RECORD               00275000
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00275100
           MOVE WS-DISPLAYED-RECORD-KEY TO CA-AK-FILE-KEY.              00275200
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00275300
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00275400
                                                                        00275500
      *  READ NEXT DE RECORD                                            00275600
           MOVE  'RN' TO CA-ACCESS-TYPE.                                00275700
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00275800
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT 2 TIMES.      00275900
                                                                        00276000
      *  END BROWSE ON MASTER FILE                                      00276100
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00276200
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00276300
                                                                        00276400
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00276500
                                                                        00276600
           MOVE WS-RECORD-KEY TO AK-MST-KEY.                            00276700
           IF (AK-CLM-NUM = CA-EST-CLM-NUM) AND (AK-PYMT-REC)           00276800
               MOVE WS-RECORD-KEY TO WS-DISPLAYED-RECORD-KEY            00276900
               MOVE WS-RECORD-INFO TO DE-INFO                           00277000
               MOVE 1 TO WS-BUILD-PAGE-IND                              00277100
               MOVE SPACES TO WS-PYMT-PROT-FLAG                         00277200
               PERFORM 1110-BUILD-PAGE                                  00277300
           ELSE                                                         00277400
               MOVE 'END OF PAYMENT RECORDS' TO MESSAG1O                00277500
               SUBTRACT 1 FROM WS-BUILD-PAGE-IND                        00277600
               MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG                  00277700
               MOVE YELLOW-COLOR TO MESSAG1C                            00277800
               MOVE WS-DISPLAYED-RECORD-KEY TO CA-AK-FILE-KEY           00277900
               MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM                       00278000
               MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH             00278100
               MOVE 'RD' TO CA-ACCESS-TYPE                              00278200
               MOVE 'F' TO CA-READ-TYPE                                 00278300
               MOVE SPACES TO CA-ACCESS-MSG-CODE                        00278400
               PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT           00278500
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00278600
               MOVE WS-RECORD-INFO TO DE-INFO                           00278700
               PERFORM 1110-BUILD-PAGE.                                 00278800
                                                                        00278900
       2600-EXIT.                                                       00279000
           EXIT.                                                        00279100
       EJECT                                                            00279200
      ***********************************************************       00279300
      *                  U D A T E   M A S T E R S              *       00279400
      ***********************************************************       00279500
       2700-PF6-FUNCTION.                                               00279600
                                                                        00279700
      *  CHECK LAST REQUEST FOR NEW SCREEN                              00279800
           IF CA-LAST-REQ-NEW                                           00279900
               MOVE +0 TO DE-BEN-OCCUR-NUM                              00280000
               MOVE 'Y' TO WS-NEW-RECORD-FLAG                           00280100
           ELSE                                                         00280200
               MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM                       00280300
               MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH             00280400
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00280500
               MOVE WS-RECORD TO WS-ORG-RECORD-DE                       00280600
               MOVE WS-RECORD-INFO TO DE-INFO.                          00280700
                                                                        00280800
      *  READ THE CURRENT CL RECORD FROM TEMP STORAGE                   00280900
           MOVE WS-CL-ITEM-NUM TO CA-ITEM-NUM.                          00281000
           MOVE WS-CL-RECORD-LENGTH TO CA-RECORD-LENGTH.                00281100
                                                                        00281200
           IF WS-CL-ITEM-NUM = 0                                        00281300
               MOVE 'RD' TO CA-ACCESS-TYPE                              00281400
               MOVE 'F' TO CA-READ-TYPE                                 00281500
               MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                       00281600
               MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM                     00281700
               MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM                     00281800
               MOVE '05' TO CA-AK-REC-CODE                              00281900
               MOVE '001' TO CA-AK-REC-NUM                              00282000
               MOVE SPACES TO CA-ACCESS-MSG-CODE                        00282100
               PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT           00282200
               MOVE CA-ITEM-NUM TO WS-CL-ITEM-NUM.                      00282300
                                                                        00282400
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00282500
                                                                        00282600
      *  SAVE ORG RECORD IN TS                                          00282700
           MOVE WS-RECORD TO WS-ORG-RECORD-CL.                          00282800
           MOVE WS-RECORD-INFO TO CL-INFO.                              00282900
                                                                        00283000
      *  CREATE TRX REG ENTRY                                           00283100
           MOVE CA-EST-CLM-NUM TO WS-TRX-UPD-CLM-NUM.                   00283200
           MOVE CA-SYSTEM-DATE TO WS-TRX-UPD-DT.                        00283300
           EXEC CICS ASKTIME                                            00283400
               ABSTIME(WS-ASK-TIME)                                     00283500
           END-EXEC.                                                    00283600
           EXEC CICS FORMATTIME                                         00283700
               ABSTIME(WS-ASK-TIME)                                     00283800
               TIME(WS-TIME)                                            00283900
               TIMESEP                                                  00284000
           END-EXEC.                                                    00284100
           MOVE WS-TIME TO WS-TRX-UPD-TIME.                             00284200
           MOVE CA-EXAM TO WS-TRX-UPD-EXAM.                             00284300
           MOVE CL-LAST-ACT-DT TO WS-TRX-UPD-LAST-CHANGE-DT.            00284400
           MOVE 'ASPD' TO WS-TRX-UPD-SCREEN-ID.                         00284500
           MOVE SPACES TO WS-TRX-UPD-FIELD-NAME                         00284600
                          WS-TRX-UPD-OLD-VALUE                          00284700
                          WS-TRX-UPD-NEW-VALUE.                         00284800
                                                                        00284900
      *  EDIT SCREEN                                                    00285000
           PERFORM 2710-EDIT THRU 2710-EXIT.                            00285100
                                                                        00285200
      *  IF THE CURSOR FLAG HAS BEEN SET AN ERROR HAS OCCURRED          00285300
           IF WS-SCREEN-ERRORS                                          00285400
               PERFORM 2200-SET-MDT THRU 2200-EXIT                      00285500
               PERFORM 8000-SEND-PAGE                                   00285600
           ELSE                                                         00285700
               MOVE 'Y' TO WS-REBUILD-FLAG                              00285800
               IF CA-LAST-REQ-NEW OR CA-LAST-REQ-REV OR CA-LAST-REQ-ADJ 00285900
                   PERFORM 2780-ADD-NEW-RECORD THRU 2780-EXIT           00286000
                   MOVE ' ' TO CA-LAST-REQUEST                          00286100
               ELSE                                                     00286200
                   PERFORM 2790-REWRITE-RECORD THRU 2790-EXIT.          00286300
                                                                        00286400
           MOVE 'I001' TO WS-MESSAGE-CODE-HOLD.                         00286500
           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.               00286600
                                                                        00286700
      *  WRITE THE TRX REG RECORDS TO FILE                              00286800
           PERFORM 4610-WRITE-TRX-RPT THRU 4610-EXIT                    00286900
               VARYING WS-SUB FROM +1 BY +1                             00287000
               UNTIL WS-SUB > WS-TRX-HOLD-NUM.                          00287100
                                                                        00287200
           IF WS-REBUILD                                                00287300
               MOVE CA-PREV-PAGE-NUM TO WS-BUILD-PAGE-IND               00287400
               PERFORM 1100-BUILD-SCREEN                                00287500
           ELSE                                                         00287600
               PERFORM 8000-SEND-PAGE.                                  00287700
                                                                        00287800
       2700-EXIT.                                                       00287900
           EXIT.                                                        00288000
       EJECT                                                            00288100
       2710-EDIT.                                                       00288200
                                                                        00288300
           IF CA-PREV-PAGE-NUM = 1                                      00288400
               NEXT SENTENCE                                            00288500
           ELSE                                                         00288600
               PERFORM 2712-EDIT-2 THRU 2712-EXIT.                      00288700
                                                                        00288800
       2710-EXIT.                                                       00288900
           EXIT.                                                        00289000
       EJECT                                                            00289100
       2712-EDIT-2.                                                     00289200
      *  WS-SUB-COV = THE OCCUR WITHIN THE DE RECORD                    00289300
      *  WS-SUB-DISPLAY = OCCUR WITHIN THE WS-DISPLAY-AREA              00289400
                                                                        00289500
      *  READ WS-DISPLAY-AREA FROM TS QUEUE                             00289600
           MOVE WS-DISPLAY-ITEM-NUM TO CA-ITEM-NUM.                     00289700
           MOVE WS-DISPLAY-RECORD-LENGTH TO CA-RECORD-LENGTH.           00289800
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00289900
           MOVE WS-RECORD TO WS-DISPLAY-AREA.                           00290000
                                                                        00290100
           IF CA-PREV-PAGE-NUM = 2                                      00290200
               MOVE +0 TO WS-DISPLAY-ADJUST                             00290300
           ELSE                                                         00290400
               MOVE +8 TO WS-DISPLAY-ADJUST.                            00290500
                                                                        00290600
           IF DENTY1L > 0                                               00290700
               COMPUTE WS-SUB-DISPLAY = WS-DISPLAY-ADJUST + 1           00290800
               MOVE DENTY1I TO WS-HOLD-DENTY                            00290900
               IF WS-HOLD-DENTY = 'A'                                   00291000
                   IF DE-REV OR DE-ADJ                                  00291100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00291200
                       MOVE 'E639' TO WS-MESSAGE-CODE-HOLD              00291300
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00291400
                       MOVE -1 TO DENTY1L                               00291500
                       MOVE RED-COLOR TO DENTY1C                        00291600
                   ELSE IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)               00291700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00291800
                       MOVE 'E631' TO WS-MESSAGE-CODE-HOLD              00291900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00292000
                       MOVE -1 TO DENTY1L                               00292100
                       MOVE RED-COLOR TO DENTY1C                        00292200
                   ELSE IF WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) =       00292300
                       SPACE OR LOW-VALUES                              00292400
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00292500
                       MOVE 'EB97' TO WS-MESSAGE-CODE-HOLD              00292600
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00292700
                       MOVE -1 TO DENTY1L                               00292800
                       MOVE RED-COLOR TO DENTY1C                        00292900
                   ELSE                                                 00293000
                       PERFORM 2715-PERFORM-ADD THRU 2715-EXIT          00293100
               ELSE IF WS-HOLD-DENTY = 'D'                              00293200
                   IF DE-REV OR DE-ADJ                                  00293300
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00293400
                       MOVE 'E655' TO WS-MESSAGE-CODE-HOLD              00293500
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00293600
                       MOVE -1 TO DENTY1L                               00293700
                       MOVE RED-COLOR TO DENTY1C                        00293800
                   ELSE IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)           00293900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00294000
                       MOVE 'E647' TO WS-MESSAGE-CODE-HOLD              00294100
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00294200
                       MOVE -1 TO DENTY1L                               00294300
                       MOVE RED-COLOR TO DENTY1C                        00294400
                   ELSE IF (STATUS1L > 0 OR PROAMT1L > 0 OR             00294500
                            REVAMT1L > 0 OR RC1L > 0)                   00294600
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00294700
                       MOVE 'E663' TO WS-MESSAGE-CODE-HOLD              00294800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00294900
                       MOVE -1 TO DENTY1L                               00295000
                       MOVE RED-COLOR TO DENTY1C                        00295100
                   ELSE                                                 00295200
                       MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB  00295300
                       MOVE 'Y' TO WS-DELETE-OCCUR(WS-SUB)              00295400
               ELSE IF WS-HOLD-DENTY = 'U'                              00295500
                   IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                00295600
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00295700
                       MOVE 'E671' TO WS-MESSAGE-CODE-HOLD              00295800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00295900
                       MOVE -1 TO DENTY1L                               00296000
                       MOVE RED-COLOR TO DENTY1C                        00296100
                   ELSE IF (WS-DISPLAY-STS(WS-SUB-DISPLAY) = 'NC') AND  00296200
                     (WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) = '???????') 00296300
                     AND (TITLE1L NOT > 0)                              00296400
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00296500
                       MOVE 'EC16' TO WS-MESSAGE-CODE-HOLD              00296600
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00296700
                       MOVE -1 TO DENTY1L                               00296800
                       MOVE RED-COLOR TO DENTY1C                        00296900
                   ELSE                                                 00297000
                       PERFORM 2718-1-PERFORM-UPDATE THRU 2718-1-EXIT   00297100
               ELSE                                                     00297200
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                    00297300
                   MOVE 'E687' TO WS-MESSAGE-CODE-HOLD                  00297400
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00297500
                   MOVE -1 TO DENTY1L                                   00297600
                   MOVE RED-COLOR TO DENTY1C.                           00297700
                                                                        00297800
           IF (DENTY1L NOT > 0) AND                                     00297900
              (STATUS1L > 0 OR PROAMT1L > 0 OR                          00298000
               REVAMT1L > 0 OR RC1L > 0)                                00298100
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00298200
               MOVE 'E679' TO WS-MESSAGE-CODE-HOLD                      00298300
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00298400
               MOVE -1 TO DENTY1L                                       00298500
               MOVE RED-COLOR TO DENTY1C.                               00298600
                                                                        00298700
           IF DENTY2L > 0                                               00298800
               COMPUTE WS-SUB-DISPLAY = WS-DISPLAY-ADJUST + 2           00298900
               MOVE DENTY2I TO WS-HOLD-DENTY                            00299000
               IF WS-HOLD-DENTY = 'A'                                   00299100
                   IF DE-REV OR DE-ADJ                                  00299200
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00299300
                       MOVE 'E640' TO WS-MESSAGE-CODE-HOLD              00299400
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00299500
                       MOVE -1 TO DENTY2L                               00299600
                       MOVE RED-COLOR TO DENTY2C                        00299700
                   ELSE IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)               00299800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00299900
                       MOVE 'E632' TO WS-MESSAGE-CODE-HOLD              00300000
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00300100
                       MOVE -1 TO DENTY2L                               00300200
                       MOVE RED-COLOR TO DENTY2C                        00300300
                   ELSE IF WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) =       00300400
                       SPACE OR LOW-VALUES                              00300500
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00300600
                       MOVE 'EB99' TO WS-MESSAGE-CODE-HOLD              00300700
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00300800
                       MOVE -1 TO DENTY2L                               00300900
                       MOVE RED-COLOR TO DENTY2C                        00301000
                   ELSE                                                 00301100
                       PERFORM 2715-PERFORM-ADD THRU 2715-EXIT          00301200
               ELSE IF WS-HOLD-DENTY = 'D'                              00301300
                   IF DE-REV OR DE-ADJ                                  00301400
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00301500
                       MOVE 'E656' TO WS-MESSAGE-CODE-HOLD              00301600
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00301700
                       MOVE -1 TO DENTY2L                               00301800
                       MOVE RED-COLOR TO DENTY2C                        00301900
                   ELSE IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)           00302000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00302100
                       MOVE 'E648' TO WS-MESSAGE-CODE-HOLD              00302200
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00302300
                       MOVE -1 TO DENTY2L                               00302400
                       MOVE RED-COLOR TO DENTY2C                        00302500
                   ELSE IF (STATUS2L > 0 OR PROAMT2L > 0 OR             00302600
                            REVAMT2L > 0 OR RC2L > 0)                   00302700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00302800
                       MOVE 'E664' TO WS-MESSAGE-CODE-HOLD              00302900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00303000
                       MOVE -1 TO DENTY2L                               00303100
                       MOVE RED-COLOR TO DENTY2C                        00303200
                   ELSE                                                 00303300
                       MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB  00303400
                       MOVE 'Y' TO WS-DELETE-OCCUR(WS-SUB)              00303500
               ELSE IF WS-HOLD-DENTY = 'U'                              00303600
                   IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                00303700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00303800
                       MOVE 'E672' TO WS-MESSAGE-CODE-HOLD              00303900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00304000
                       MOVE -1 TO DENTY2L                               00304100
                       MOVE RED-COLOR TO DENTY2C                        00304200
                   ELSE IF (WS-DISPLAY-STS(WS-SUB-DISPLAY) = 'NC') AND  00304300
                     (WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) = '???????') 00304400
                     AND (TITLE2L NOT > 0)                              00304500
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00304600
                       MOVE 'EC18' TO WS-MESSAGE-CODE-HOLD              00304700
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00304800
                       MOVE -1 TO DENTY2L                               00304900
                       MOVE RED-COLOR TO DENTY2C                        00305000
                   ELSE                                                 00305100
                       PERFORM 2718-2-PERFORM-UPDATE THRU 2718-2-EXIT   00305200
               ELSE                                                     00305300
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                    00305400
                   MOVE 'E688' TO WS-MESSAGE-CODE-HOLD                  00305500
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00305600
                   MOVE -1 TO DENTY2L                                   00305700
                   MOVE RED-COLOR TO DENTY2C.                           00305800
                                                                        00305900
           IF (DENTY2L NOT > 0) AND                                     00306000
              (STATUS2L > 0 OR PROAMT2L > 0 OR                          00306100
               REVAMT2L > 0 OR RC2L > 0)                                00306200
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00306300
               MOVE 'E680' TO WS-MESSAGE-CODE-HOLD                      00306400
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00306500
               MOVE -1 TO DENTY2L                                       00306600
               MOVE RED-COLOR TO DENTY2C.                               00306700
                                                                        00306800
           IF DENTY3L > 0                                               00306900
               COMPUTE WS-SUB-DISPLAY = WS-DISPLAY-ADJUST + 3           00307000
               MOVE DENTY3I TO WS-HOLD-DENTY                            00307100
               IF WS-HOLD-DENTY = 'A'                                   00307200
                   IF DE-REV OR DE-ADJ                                  00307300
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00307400
                       MOVE 'E641' TO WS-MESSAGE-CODE-HOLD              00307500
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00307600
                       MOVE -1 TO DENTY3L                               00307700
                       MOVE RED-COLOR TO DENTY3C                        00307800
                   ELSE IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)               00307900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00308000
                       MOVE 'E633' TO WS-MESSAGE-CODE-HOLD              00308100
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00308200
                       MOVE -1 TO DENTY3L                               00308300
                       MOVE RED-COLOR TO DENTY3C                        00308400
                   ELSE IF WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) =       00308500
                       SPACE OR LOW-VALUES                              00308600
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00308700
                       MOVE 'EC02' TO WS-MESSAGE-CODE-HOLD              00308800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00308900
                       MOVE -1 TO DENTY3L                               00309000
                       MOVE RED-COLOR TO DENTY3C                        00309100
                   ELSE                                                 00309200
                       PERFORM 2715-PERFORM-ADD THRU 2715-EXIT          00309300
               ELSE IF WS-HOLD-DENTY = 'D'                              00309400
                   IF DE-REV OR DE-ADJ                                  00309500
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00309600
                       MOVE 'E657' TO WS-MESSAGE-CODE-HOLD              00309700
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00309800
                       MOVE -1 TO DENTY3L                               00309900
                       MOVE RED-COLOR TO DENTY3C                        00310000
                   ELSE IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)           00310100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00310200
                       MOVE 'E649' TO WS-MESSAGE-CODE-HOLD              00310300
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00310400
                       MOVE -1 TO DENTY3L                               00310500
                       MOVE RED-COLOR TO DENTY3C                        00310600
                   ELSE IF (STATUS3L > 0 OR PROAMT3L > 0 OR             00310700
                            REVAMT3L > 0 OR RC3L > 0)                   00310800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00310900
                       MOVE 'E665' TO WS-MESSAGE-CODE-HOLD              00311000
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00311100
                       MOVE -1 TO DENTY3L                               00311200
                       MOVE RED-COLOR TO DENTY3C                        00311300
                   ELSE                                                 00311400
                       MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB  00311500
                       MOVE 'Y' TO WS-DELETE-OCCUR(WS-SUB)              00311600
               ELSE IF WS-HOLD-DENTY = 'U'                              00311700
                   IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                00311800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00311900
                       MOVE 'E673' TO WS-MESSAGE-CODE-HOLD              00312000
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00312100
                       MOVE -1 TO DENTY3L                               00312200
                       MOVE RED-COLOR TO DENTY3C                        00312300
                   ELSE IF (WS-DISPLAY-STS(WS-SUB-DISPLAY) = 'NC') AND  00312400
                     (WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) = '???????') 00312500
                     AND (TITLE3L NOT > 0)                              00312600
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00312700
                       MOVE 'EC20' TO WS-MESSAGE-CODE-HOLD              00312800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00312900
                       MOVE -1 TO DENTY3L                               00313000
                       MOVE RED-COLOR TO DENTY3C                        00313100
                   ELSE                                                 00313200
                       PERFORM 2718-3-PERFORM-UPDATE THRU 2718-3-EXIT   00313300
               ELSE                                                     00313400
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                    00313500
                   MOVE 'E689' TO WS-MESSAGE-CODE-HOLD                  00313600
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00313700
                   MOVE -1 TO DENTY3L                                   00313800
                   MOVE RED-COLOR TO DENTY3C.                           00313900
                                                                        00314000
           IF (DENTY3L NOT > 0) AND                                     00314100
              (STATUS3L > 0 OR PROAMT3L > 0 OR                          00314200
               REVAMT3L > 0 OR RC3L > 0)                                00314300
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00314400
               MOVE 'E681' TO WS-MESSAGE-CODE-HOLD                      00314500
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00314600
               MOVE -1 TO DENTY3L                                       00314700
               MOVE RED-COLOR TO DENTY3C.                               00314800
                                                                        00314900
           IF DENTY4L > 0                                               00315000
               COMPUTE WS-SUB-DISPLAY = WS-DISPLAY-ADJUST + 4           00315100
               MOVE DENTY4I TO WS-HOLD-DENTY                            00315200
               IF WS-HOLD-DENTY = 'A'                                   00315300
                   IF DE-REV OR DE-ADJ                                  00315400
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00315500
                       MOVE 'E642' TO WS-MESSAGE-CODE-HOLD              00315600
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00315700
                       MOVE -1 TO DENTY4L                               00315800
                       MOVE RED-COLOR TO DENTY4C                        00315900
                   ELSE IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)               00316000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00316100
                       MOVE 'E634' TO WS-MESSAGE-CODE-HOLD              00316200
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00316300
                       MOVE -1 TO DENTY4L                               00316400
                       MOVE RED-COLOR TO DENTY4C                        00316500
                   ELSE IF WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) =       00316600
                       SPACE OR LOW-VALUES                              00316700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00316800
                       MOVE 'EC04' TO WS-MESSAGE-CODE-HOLD              00316900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00317000
                       MOVE -1 TO DENTY4L                               00317100
                       MOVE RED-COLOR TO DENTY4C                        00317200
                   ELSE                                                 00317300
                       PERFORM 2715-PERFORM-ADD THRU 2715-EXIT          00317400
               ELSE IF WS-HOLD-DENTY = 'D'                              00317500
                   IF DE-REV OR DE-ADJ                                  00317600
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00317700
                       MOVE 'E658' TO WS-MESSAGE-CODE-HOLD              00317800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00317900
                       MOVE -1 TO DENTY4L                               00318000
                       MOVE RED-COLOR TO DENTY4C                        00318100
                   ELSE IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)           00318200
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00318300
                       MOVE 'E650' TO WS-MESSAGE-CODE-HOLD              00318400
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00318500
                       MOVE -1 TO DENTY4L                               00318600
                       MOVE RED-COLOR TO DENTY4C                        00318700
                   ELSE IF (STATUS4L > 0 OR PROAMT4L > 0 OR             00318800
                            REVAMT4L > 0 OR RC4L > 0)                   00318900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00319000
                       MOVE 'E666' TO WS-MESSAGE-CODE-HOLD              00319100
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00319200
                       MOVE -1 TO DENTY4L                               00319300
                       MOVE RED-COLOR TO DENTY4C                        00319400
                   ELSE                                                 00319500
                       MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB  00319600
                       MOVE 'Y' TO WS-DELETE-OCCUR(WS-SUB)              00319700
               ELSE IF WS-HOLD-DENTY = 'U'                              00319800
                   IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                00319900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00320000
                       MOVE 'E674' TO WS-MESSAGE-CODE-HOLD              00320100
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00320200
                       MOVE -1 TO DENTY4L                               00320300
                       MOVE RED-COLOR TO DENTY4C                        00320400
                   ELSE IF (WS-DISPLAY-STS(WS-SUB-DISPLAY) = 'NC') AND  00320500
                     (WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) = '???????') 00320600
                     AND (TITLE4L NOT > 0)                              00320700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00320800
                       MOVE 'EC22' TO WS-MESSAGE-CODE-HOLD              00320900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00321000
                       MOVE -1 TO DENTY4L                               00321100
                       MOVE RED-COLOR TO DENTY4C                        00321200
                   ELSE                                                 00321300
                       PERFORM 2718-4-PERFORM-UPDATE THRU 2718-4-EXIT   00321400
               ELSE                                                     00321500
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                    00321600
                   MOVE 'E690' TO WS-MESSAGE-CODE-HOLD                  00321700
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00321800
                   MOVE -1 TO DENTY4L                                   00321900
                   MOVE RED-COLOR TO DENTY4C.                           00322000
                                                                        00322100
           IF (DENTY4L NOT > 0) AND                                     00322200
              (STATUS4L > 0 OR PROAMT4L > 0 OR                          00322300
               REVAMT4L > 0 OR RC4L > 0)                                00322400
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00322500
               MOVE 'E682' TO WS-MESSAGE-CODE-HOLD                      00322600
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00322700
               MOVE -1 TO DENTY4L                                       00322800
               MOVE RED-COLOR TO DENTY4C.                               00322900
                                                                        00323000
           IF DENTY5L > 0                                               00323100
               COMPUTE WS-SUB-DISPLAY = WS-DISPLAY-ADJUST + 5           00323200
               MOVE DENTY5I TO WS-HOLD-DENTY                            00323300
               IF WS-HOLD-DENTY = 'A'                                   00323400
                   IF DE-REV OR DE-ADJ                                  00323500
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00323600
                       MOVE 'E643' TO WS-MESSAGE-CODE-HOLD              00323700
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00323800
                       MOVE -1 TO DENTY5L                               00323900
                       MOVE RED-COLOR TO DENTY5C                        00324000
                   ELSE IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)               00324100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00324200
                       MOVE 'E635' TO WS-MESSAGE-CODE-HOLD              00324300
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00324400
                       MOVE -1 TO DENTY5L                               00324500
                       MOVE RED-COLOR TO DENTY5C                        00324600
                   ELSE IF WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) =       00324700
                       SPACE OR LOW-VALUES                              00324800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00324900
                       MOVE 'EC03' TO WS-MESSAGE-CODE-HOLD              00325000
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00325100
                       MOVE -1 TO DENTY5L                               00325200
                       MOVE RED-COLOR TO DENTY5C                        00325300
                   ELSE                                                 00325400
                       PERFORM 2715-PERFORM-ADD THRU 2715-EXIT          00325500
               ELSE IF WS-HOLD-DENTY = 'D'                              00325600
                   IF DE-REV OR DE-ADJ                                  00325700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00325800
                       MOVE 'E659' TO WS-MESSAGE-CODE-HOLD              00325900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00326000
                       MOVE -1 TO DENTY5L                               00326100
                       MOVE RED-COLOR TO DENTY5C                        00326200
                   ELSE IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)           00326300
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00326400
                       MOVE 'E651' TO WS-MESSAGE-CODE-HOLD              00326500
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00326600
                       MOVE -1 TO DENTY5L                               00326700
                       MOVE RED-COLOR TO DENTY5C                        00326800
                   ELSE IF (STATUS5L > 0 OR PROAMT5L > 0 OR             00326900
                            REVAMT5L > 0 OR RC5L > 0)                   00327000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00327100
                       MOVE 'E667' TO WS-MESSAGE-CODE-HOLD              00327200
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00327300
                       MOVE -1 TO DENTY5L                               00327400
                       MOVE RED-COLOR TO DENTY5C                        00327500
                   ELSE                                                 00327600
                       MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB  00327700
                       MOVE 'Y' TO WS-DELETE-OCCUR(WS-SUB)              00327800
               ELSE IF WS-HOLD-DENTY = 'U'                              00327900
                   IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                00328000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00328100
                       MOVE 'E675' TO WS-MESSAGE-CODE-HOLD              00328200
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00328300
                       MOVE -1 TO DENTY5L                               00328400
                       MOVE RED-COLOR TO DENTY5C                        00328500
                   ELSE IF (WS-DISPLAY-STS(WS-SUB-DISPLAY) = 'NC') AND  00328600
                     (WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) = '???????') 00328700
                     AND (TITLE5L NOT > 0)                              00328800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00328900
                       MOVE 'EC24' TO WS-MESSAGE-CODE-HOLD              00329000
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00329100
                       MOVE -1 TO DENTY5L                               00329200
                       MOVE RED-COLOR TO DENTY5C                        00329300
                   ELSE                                                 00329400
                       PERFORM 2718-5-PERFORM-UPDATE THRU 2718-5-EXIT   00329500
               ELSE                                                     00329600
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                    00329700
                   MOVE 'E691' TO WS-MESSAGE-CODE-HOLD                  00329800
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00329900
                   MOVE -1 TO DENTY5L                                   00330000
                   MOVE RED-COLOR TO DENTY5C.                           00330100
                                                                        00330200
           IF (DENTY5L NOT > 0) AND                                     00330300
              (STATUS5L > 0 OR PROAMT5L > 0 OR                          00330400
               REVAMT5L > 0 OR RC5L > 0)                                00330500
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00330600
               MOVE 'E683' TO WS-MESSAGE-CODE-HOLD                      00330700
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00330800
               MOVE -1 TO DENTY5L                                       00330900
               MOVE RED-COLOR TO DENTY5C.                               00331000
                                                                        00331100
           IF DENTY6L > 0                                               00331200
               COMPUTE WS-SUB-DISPLAY = WS-DISPLAY-ADJUST + 6           00331300
               MOVE DENTY6I TO WS-HOLD-DENTY                            00331400
               IF WS-HOLD-DENTY = 'A'                                   00331500
                   IF DE-REV OR DE-ADJ                                  00331600
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00331700
                       MOVE 'E644' TO WS-MESSAGE-CODE-HOLD              00331800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00331900
                       MOVE -1 TO DENTY6L                               00332000
                       MOVE RED-COLOR TO DENTY6C                        00332100
                   ELSE IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)               00332200
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00332300
                       MOVE 'E636' TO WS-MESSAGE-CODE-HOLD              00332400
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00332500
                       MOVE -1 TO DENTY6L                               00332600
                       MOVE RED-COLOR TO DENTY6C                        00332700
                   ELSE IF WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) =       00332800
                       SPACE OR LOW-VALUES                              00332900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00333000
                       MOVE 'EC08' TO WS-MESSAGE-CODE-HOLD              00333100
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00333200
                       MOVE -1 TO DENTY6L                               00333300
                       MOVE RED-COLOR TO DENTY6C                        00333400
                   ELSE                                                 00333500
                       PERFORM 2715-PERFORM-ADD THRU 2715-EXIT          00333600
               ELSE IF WS-HOLD-DENTY = 'D'                              00333700
                   IF DE-REV OR DE-ADJ                                  00333800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00333900
                       MOVE 'E660' TO WS-MESSAGE-CODE-HOLD              00334000
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00334100
                       MOVE -1 TO DENTY6L                               00334200
                       MOVE RED-COLOR TO DENTY6C                        00334300
                   ELSE IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)           00334400
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00334500
                       MOVE 'E652' TO WS-MESSAGE-CODE-HOLD              00334600
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00334700
                       MOVE -1 TO DENTY6L                               00334800
                       MOVE RED-COLOR TO DENTY6C                        00334900
                   ELSE IF (STATUS6L > 0 OR PROAMT6L > 0 OR             00335000
                            REVAMT6L > 0 OR RC6L > 0)                   00335100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00335200
                       MOVE 'E668' TO WS-MESSAGE-CODE-HOLD              00335300
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00335400
                       MOVE -1 TO DENTY6L                               00335500
                       MOVE RED-COLOR TO DENTY6C                        00335600
                   ELSE                                                 00335700
                       MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB  00335800
                       MOVE 'Y' TO WS-DELETE-OCCUR(WS-SUB)              00335900
               ELSE IF WS-HOLD-DENTY = 'U'                              00336000
                   IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                00336100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00336200
                       MOVE 'E676' TO WS-MESSAGE-CODE-HOLD              00336300
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00336400
                       MOVE -1 TO DENTY6L                               00336500
                       MOVE RED-COLOR TO DENTY6C                        00336600
                   ELSE IF (WS-DISPLAY-STS(WS-SUB-DISPLAY) = 'NC') AND  00336700
                     (WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) = '???????') 00336800
                     AND (TITLE6L NOT > 0)                              00336900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00337000
                       MOVE 'EC26' TO WS-MESSAGE-CODE-HOLD              00337100
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00337200
                       MOVE -1 TO DENTY6L                               00337300
                       MOVE RED-COLOR TO DENTY6C                        00337400
                   ELSE                                                 00337500
                       PERFORM 2718-6-PERFORM-UPDATE THRU 2718-6-EXIT   00337600
               ELSE                                                     00337700
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                    00337800
                   MOVE 'E692' TO WS-MESSAGE-CODE-HOLD                  00337900
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00338000
                   MOVE -1 TO DENTY6L                                   00338100
                   MOVE RED-COLOR TO DENTY6C.                           00338200
                                                                        00338300
           IF (DENTY6L NOT > 0) AND                                     00338400
              (STATUS6L > 0 OR PROAMT6L > 0 OR                          00338500
               REVAMT6L > 0 OR RC6L > 0)                                00338600
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00338700
               MOVE 'E684' TO WS-MESSAGE-CODE-HOLD                      00338800
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00338900
               MOVE -1 TO DENTY6L                                       00339000
               MOVE RED-COLOR TO DENTY6C.                               00339100
                                                                        00339200
           IF DENTY7L > 0                                               00339300
               COMPUTE WS-SUB-DISPLAY = WS-DISPLAY-ADJUST + 7           00339400
               MOVE DENTY7I TO WS-HOLD-DENTY                            00339500
               IF WS-HOLD-DENTY = 'A'                                   00339600
                   IF DE-REV OR DE-ADJ                                  00339700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00339800
                       MOVE 'E645' TO WS-MESSAGE-CODE-HOLD              00339900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00340000
                       MOVE -1 TO DENTY7L                               00340100
                       MOVE RED-COLOR TO DENTY7C                        00340200
                   ELSE IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)               00340300
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00340400
                       MOVE 'E637' TO WS-MESSAGE-CODE-HOLD              00340500
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00340600
                       MOVE -1 TO DENTY7L                               00340700
                       MOVE RED-COLOR TO DENTY7C                        00340800
                   ELSE IF WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) =       00340900
                       SPACE OR LOW-VALUES                              00341000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00341100
                       MOVE 'EC10' TO WS-MESSAGE-CODE-HOLD              00341200
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00341300
                       MOVE -1 TO DENTY7L                               00341400
                       MOVE RED-COLOR TO DENTY7C                        00341500
                   ELSE                                                 00341600
                       PERFORM 2715-PERFORM-ADD THRU 2715-EXIT          00341700
               ELSE IF WS-HOLD-DENTY = 'D'                              00341800
                   IF DE-REV OR DE-ADJ                                  00341900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00342000
                       MOVE 'E661' TO WS-MESSAGE-CODE-HOLD              00342100
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00342200
                       MOVE -1 TO DENTY7L                               00342300
                       MOVE RED-COLOR TO DENTY7C                        00342400
                   ELSE IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)           00342500
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00342600
                       MOVE 'E653' TO WS-MESSAGE-CODE-HOLD              00342700
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00342800
                       MOVE -1 TO DENTY7L                               00342900
                       MOVE RED-COLOR TO DENTY7C                        00343000
                   ELSE IF (STATUS7L > 0 OR PROAMT7L > 0 OR             00343100
                            REVAMT7L > 0 OR RC7L > 0)                   00343200
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00343300
                       MOVE 'E669' TO WS-MESSAGE-CODE-HOLD              00343400
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00343500
                       MOVE -1 TO DENTY7L                               00343600
                       MOVE RED-COLOR TO DENTY7C                        00343700
                   ELSE                                                 00343800
                       MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB  00343900
                       MOVE 'Y' TO WS-DELETE-OCCUR(WS-SUB)              00344000
               ELSE IF WS-HOLD-DENTY = 'U'                              00344100
                   IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                00344200
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00344300
                       MOVE 'E677' TO WS-MESSAGE-CODE-HOLD              00344400
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00344500
                       MOVE -1 TO DENTY7L                               00344600
                       MOVE RED-COLOR TO DENTY7C                        00344700
                   ELSE IF (WS-DISPLAY-STS(WS-SUB-DISPLAY) = 'NC') AND  00344800
                     (WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) = '???????') 00344900
                     AND (TITLE7L NOT > 0)                              00345000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00345100
                       MOVE 'EC28' TO WS-MESSAGE-CODE-HOLD              00345200
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00345300
                       MOVE -1 TO DENTY7L                               00345400
                       MOVE RED-COLOR TO DENTY7C                        00345500
                   ELSE                                                 00345600
                       PERFORM 2718-7-PERFORM-UPDATE THRU 2718-7-EXIT   00345700
               ELSE                                                     00345800
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                    00345900
                   MOVE 'E693' TO WS-MESSAGE-CODE-HOLD                  00346000
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00346100
                   MOVE -1 TO DENTY7L                                   00346200
                   MOVE RED-COLOR TO DENTY7C.                           00346300
                                                                        00346400
           IF (DENTY7L NOT > 0) AND                                     00346500
              (STATUS7L > 0 OR PROAMT7L > 0 OR                          00346600
               REVAMT7L > 0 OR RC7L > 0)                                00346700
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00346800
               MOVE 'E685' TO WS-MESSAGE-CODE-HOLD                      00346900
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00347000
               MOVE -1 TO DENTY7L                                       00347100
               MOVE RED-COLOR TO DENTY7C.                               00347200
                                                                        00347300
           IF DENTY8L > 0                                               00347400
               COMPUTE WS-SUB-DISPLAY = WS-DISPLAY-ADJUST + 8           00347500
               MOVE DENTY8I TO WS-HOLD-DENTY                            00347600
               IF WS-HOLD-DENTY = 'A'                                   00347700
                   IF DE-REV OR DE-ADJ                                  00347800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00347900
                       MOVE 'E646' TO WS-MESSAGE-CODE-HOLD              00348000
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00348100
                       MOVE -1 TO DENTY8L                               00348200
                       MOVE RED-COLOR TO DENTY8C                        00348300
                   ELSE IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)               00348400
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00348500
                       MOVE 'E638' TO WS-MESSAGE-CODE-HOLD              00348600
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00348700
                       MOVE -1 TO DENTY8L                               00348800
                       MOVE RED-COLOR TO DENTY8C                        00348900
                   ELSE IF WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) =       00349000
                       SPACE OR LOW-VALUES                              00349100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00349200
                       MOVE 'EC12' TO WS-MESSAGE-CODE-HOLD              00349300
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00349400
                       MOVE -1 TO DENTY8L                               00349500
                       MOVE RED-COLOR TO DENTY8C                        00349600
                   ELSE                                                 00349700
                       PERFORM 2715-PERFORM-ADD THRU 2715-EXIT          00349800
               ELSE IF WS-HOLD-DENTY = 'D'                              00349900
                   IF DE-REV OR DE-ADJ                                  00350000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00350100
                       MOVE 'E662' TO WS-MESSAGE-CODE-HOLD              00350200
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00350300
                       MOVE -1 TO DENTY8L                               00350400
                       MOVE RED-COLOR TO DENTY8C                        00350500
                   ELSE IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)           00350600
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00350700
                       MOVE 'E654' TO WS-MESSAGE-CODE-HOLD              00350800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00350900
                       MOVE -1 TO DENTY8L                               00351000
                       MOVE RED-COLOR TO DENTY8C                        00351100
                   ELSE IF (STATUS8L > 0 OR PROAMT8L > 0 OR             00351200
                            REVAMT8L > 0 OR RC8L > 0)                   00351300
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00351400
                       MOVE 'E670' TO WS-MESSAGE-CODE-HOLD              00351500
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00351600
                       MOVE -1 TO DENTY8L                               00351700
                       MOVE RED-COLOR TO DENTY8C                        00351800
                   ELSE                                                 00351900
                       MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB  00352000
                       MOVE 'Y' TO WS-DELETE-OCCUR(WS-SUB)              00352100
               ELSE IF WS-HOLD-DENTY = 'U'                              00352200
                   IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                00352300
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00352400
                       MOVE 'E678' TO WS-MESSAGE-CODE-HOLD              00352500
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00352600
                       MOVE -1 TO DENTY8L                               00352700
                       MOVE RED-COLOR TO DENTY8C                        00352800
                   ELSE IF (WS-DISPLAY-STS(WS-SUB-DISPLAY) = 'NC') AND  00352900
                     (WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY) = '???????') 00353000
                     AND (TITLE8L NOT > 0)                              00353100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                00353200
                       MOVE 'EC29' TO WS-MESSAGE-CODE-HOLD              00353300
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00353400
                       MOVE -1 TO DENTY8L                               00353500
                       MOVE RED-COLOR TO DENTY8C                        00353600
                   ELSE                                                 00353700
                       PERFORM 2718-8-PERFORM-UPDATE THRU 2718-8-EXIT   00353800
               ELSE                                                     00353900
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                    00354000
                   MOVE 'E694' TO WS-MESSAGE-CODE-HOLD                  00354100
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00354200
                   MOVE -1 TO DENTY8L                                   00354300
                   MOVE RED-COLOR TO DENTY8C.                           00354400
                                                                        00354500
           IF (DENTY8L NOT > 0) AND                                     00354600
              (STATUS8L > 0 OR PROAMT8L > 0 OR                          00354700
               REVAMT8L > 0 OR RC8L > 0)                                00354800
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00354900
               MOVE 'E686' TO WS-MESSAGE-CODE-HOLD                      00355000
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00355100
               MOVE -1 TO DENTY8L                                       00355200
               MOVE RED-COLOR TO DENTY8C.                               00355300
                                                                        00355400
      *  DELETE ANY COVERAGES                                           00355500
           IF WS-DELETE(16)                                             00355600
               MOVE +16 TO WS-SUB-COV                                   00355700
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00355800
           IF WS-DELETE(15)                                             00355900
               MOVE +15 TO WS-SUB-COV                                   00356000
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00356100
           IF WS-DELETE(14)                                             00356200
               MOVE +14 TO WS-SUB-COV                                   00356300
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00356400
           IF WS-DELETE(13)                                             00356500
               MOVE +13 TO WS-SUB-COV                                   00356600
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00356700
           IF WS-DELETE(12)                                             00356800
               MOVE +12 TO WS-SUB-COV                                   00356900
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00357000
           IF WS-DELETE(11)                                             00357100
               MOVE +11 TO WS-SUB-COV                                   00357200
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00357300
           IF WS-DELETE(10)                                             00357400
               MOVE +10 TO WS-SUB-COV                                   00357500
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00357600
           IF WS-DELETE(9)                                              00357700
               MOVE +9 TO WS-SUB-COV                                    00357800
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00357900
           IF WS-DELETE(8)                                              00358000
               MOVE +8 TO WS-SUB-COV                                    00358100
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00358200
           IF WS-DELETE(7)                                              00358300
               MOVE +7 TO WS-SUB-COV                                    00358400
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00358500
           IF WS-DELETE(6)                                              00358600
               MOVE +6 TO WS-SUB-COV                                    00358700
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00358800
           IF WS-DELETE(5)                                              00358900
               MOVE +5 TO WS-SUB-COV                                    00359000
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00359100
           IF WS-DELETE(4)                                              00359200
               MOVE +4 TO WS-SUB-COV                                    00359300
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00359400
           IF WS-DELETE(3)                                              00359500
               MOVE +3 TO WS-SUB-COV                                    00359600
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00359700
           IF WS-DELETE(2)                                              00359800
               MOVE +2 TO WS-SUB-COV                                    00359900
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00360000
           IF WS-DELETE(1)                                              00360100
               MOVE +1 TO WS-SUB-COV                                    00360200
               PERFORM 2716-PERFORM-DELETE THRU 2716-EXIT.              00360300
                                                                        00360400
           MOVE +0 TO WS-DISPLAY-AMT-ORG                                00360500
                      WS-DISPLAY-AMT-REV.                               00360600
                                                                        00360700
           PERFORM 1119-COMPUTE-BEN THRU 1119-EXIT                      00360800
               VARYING WS-SUB FROM +1 BY +1                             00360900
               UNTIL WS-SUB > DE-BEN-OCCUR-NUM.                         00361000
                                                                        00361100
           IF DE-ORIG                                                   00361200
               MOVE WS-DISPLAY-AMT-ORG TO DE-TOT-BEN                    00361300
           ELSE                                                         00361400
               MOVE WS-DISPLAY-AMT-REV TO DE-TOT-BEN.                   00361500
                                                                        00361600
           IF ((CA-PREV-PAGE-NUM = 2) AND (WS-DISPLAY-TOTAL NOT > 8)) OR00361700
              (CA-PREV-PAGE-NUM = 3)                                    00361800
               MOVE WS-DISPLAY-AMT-ORG TO WS-AMOUNT-9-2                 00361900
               MOVE WS-AMOUNT-9-2 TO PROAMTTO                           00362000
               IF DE-REV OR DE-ADJ                                      00362100
                   MOVE WS-DISPLAY-AMT-REV TO WS-AMOUNT-9-2             00362200
                   MOVE WS-AMOUNT-9-2 TO REVAMTTO                       00362300
               ELSE                                                     00362400
                   NEXT SENTENCE                                        00362500
           ELSE                                                         00362600
               MOVE PROT-DARK TO TOTALF                                 00362700
                                 DSIGNT1F                               00362800
                                 PROAMTTF                               00362900
                                 DSIGNT2F                               00363000
                                 REVAMTTF.                              00363100
                                                                        00363200
       2712-EXIT.                                                       00363300
           EXIT.                                                        00363400
       EJECT                                                            00363500
       2715-PERFORM-ADD.                                                00363600
                                                                        00363700
           MOVE 'Y' TO WS-REBUILD-FLAG.                                 00363800
                                                                        00363900
           IF CA-LAST-REQ-NEW                                           00364000
               MOVE +0 TO DE-TOT-BEN.                                   00364100
                                                                        00364200
           ADD +1 TO DE-BEN-OCCUR-NUM.                                  00364300
           MOVE DE-BEN-OCCUR-NUM TO WS-SUB-COV.                         00364400
           MOVE WS-DISPLAY-NEW-COV(WS-SUB-DISPLAY)                      00364500
             TO DE-COV-REC-NUM(WS-SUB-COV).                             00364600
           MOVE WS-DISPLAY-STS(WS-SUB-DISPLAY)                          00364700
             TO DE-STS(WS-SUB-COV).                                     00364800
           MOVE WS-DISPLAY-PLAN-CODE(WS-SUB-DISPLAY)                    00364900
             TO DE-PLAN-CODE(WS-SUB-COV).                               00365000
           MOVE WS-DISPLAY-AMT(WS-SUB-DISPLAY)                          00365100
             TO DE-BEN-AMT(WS-SUB-COV).                                 00365200
           MOVE +0 TO DE-BEN-AMT-REV(WS-SUB-COV).                       00365300
           MOVE WS-DISPLAY-RC(WS-SUB-DISPLAY)                           00365400
             TO DE-REAS-CODE(WS-SUB-COV).                               00365500
                                                                        00365600
       2715-EXIT.                                                       00365700
           EXIT.                                                        00365800
       EJECT                                                            00365900
       2716-PERFORM-DELETE.                                             00366000
                                                                        00366100
           PERFORM 2717-DELETE-OCCUR THRU 2717-EXIT                     00366200
               VARYING WS-SUB-2 FROM WS-SUB-COV BY +1                   00366300
               UNTIL WS-SUB-2 = DE-BEN-OCCUR-NUM.                       00366400
           MOVE SPACES TO DE-PLAN-CODE(WS-SUB-2)                        00366500
                          DE-REAS-CODE(WS-SUB-2)                        00366600
                          DE-STS(WS-SUB-2).                             00366700
           MOVE +0 TO DE-COV-REC-NUM(WS-SUB-2)                          00366800
                      DE-BEN-AMT(WS-SUB-2)                              00366900
                      DE-BEN-AMT-REV(WS-SUB-2).                         00367000
           SUBTRACT 1 FROM DE-BEN-OCCUR-NUM.                            00367100
                                                                        00367200
       2716-EXIT.                                                       00367300
           EXIT.                                                        00367400
       EJECT                                                            00367500
       2717-DELETE-OCCUR.                                               00367600
                                                                        00367700
           COMPUTE WS-SUB-3 = WS-SUB-2 + 1.                             00367800
                                                                        00367900
           MOVE DE-PLAN-CODE(WS-SUB-3)                                  00368000
             TO DE-PLAN-CODE(WS-SUB-2).                                 00368100
           MOVE DE-REAS-CODE(WS-SUB-3)                                  00368200
             TO DE-REAS-CODE(WS-SUB-2).                                 00368300
           MOVE DE-STS(WS-SUB-3)                                        00368400
             TO DE-STS(WS-SUB-2).                                       00368500
           MOVE DE-COV-REC-NUM(WS-SUB-3)                                00368600
             TO DE-COV-REC-NUM(WS-SUB-2).                               00368700
           MOVE DE-BEN-AMT(WS-SUB-3)                                    00368800
             TO DE-BEN-AMT(WS-SUB-2).                                   00368900
           MOVE DE-BEN-AMT-REV(WS-SUB-3)                                00369000
             TO DE-BEN-AMT-REV(WS-SUB-2).                               00369100
                                                                        00369200
       2717-EXIT.                                                       00369300
           EXIT.                                                        00369400
       EJECT                                                            00369500
       2718-1-PERFORM-UPDATE.                                           00369600
                                                                        00369700
           MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB-COV.         00369800
                                                                        00369900
           IF STATUS1L > ZERO                                           00370000
               MOVE STATUS1I TO WS-EDIT-CLM-STS                         00370100
               IF WS-VALID-CLM-STS                                      00370200
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00370300
                   MOVE 'STS - 1' TO TRX-UPD-FIELD-NAME                 00370400
                   MOVE DE-STS(WS-SUB-COV)                              00370500
                     TO TRX-UPD-OLD-VALUE                               00370600
                   MOVE STATUS1I                                        00370700
                     TO DE-STS(WS-SUB-COV)                              00370800
                        WS-DISPLAY-STS(WS-SUB-DISPLAY)                  00370900
                   MOVE DE-STS(WS-SUB-COV)                              00371000
                     TO TRX-UPD-NEW-VALUE                               00371100
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00371200
               ELSE                                                     00371300
                   MOVE 'E695' TO WS-MESSAGE-CODE-HOLD                  00371400
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00371500
                   MOVE -1 TO STATUS1L                                  00371600
                   MOVE RED-COLOR TO STATUS1C                           00371700
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00371800
                                                                        00371900
           IF TITLE1L > ZERO                                            00372000
               MOVE TITLE1I TO WS-EDIT-COVERAGE                         00372100
               IF WS-VALID-NON-COV                                      00372200
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00372300
                   MOVE 'NON-COV - 1' TO TRX-UPD-FIELD-NAME             00372400
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00372500
                     TO TRX-UPD-OLD-VALUE                               00372600
                   MOVE TITLE1I                                         00372700
                     TO DE-PLAN-CODE(WS-SUB-COV)                        00372800
                        WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY)             00372900
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00373000
                     TO TRX-UPD-NEW-VALUE                               00373100
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00373200
               ELSE                                                     00373300
                   MOVE 'EC31' TO WS-MESSAGE-CODE-HOLD                  00373400
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00373500
                   MOVE -1 TO TITLE1L                                   00373600
                   MOVE RED-COLOR TO TITLE1C                            00373700
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00373800
                                                                        00373900
           IF PROAMT1L > ZERO                                           00374000
               IF PROAMT1I = SPACES                                     00374100
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00374200
                   MOVE 'PROCEEDS AMT -1' TO TRX-UPD-FIELD-NAME         00374300
                   MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2         00374400
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00374500
                   MOVE ZEROES TO DE-BEN-AMT(WS-SUB-COV)                00374600
                                  WS-DISPLAY-AMT(WS-SUB-DISPLAY)        00374700
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00374800
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00374900
               ELSE                                                     00375000
                   MOVE PROAMT1I TO WS-AMOUNT-IN-AREA                   00375100
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00375200
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00375300
                   IF FIELD-IS-VALID                                    00375400
                       MOVE WS-TRX-UPD-REC TO TRX-UPD-REC               00375500
                       MOVE 'PROCEEDS AMT -1' TO                        00375600
                         TRX-UPD-FIELD-NAME                             00375700
                       IF WS-NEG-NON-COV                                00375800
                           MOVE WS-AMOUNT-9-2 TO PROAMT1O               00375900
                           MOVE '-' TO OPERTR1O                         00376000
                           MOVE WS-AMOUNT-9-2-SIGNED                    00376100
                             TO TRX-UPD-NEW-VALUE                       00376200
                           MOVE DE-BEN-AMT(WS-SUB-COV)                  00376300
                             TO WS-AMOUNT-9-2-SIGNED                    00376400
                           MOVE WS-AMOUNT-9-2-SIGNED                    00376500
                             TO TRX-UPD-OLD-VALUE                       00376600
                           MOVE WS-AMOUNT-NO-COMMAS-SIGNED              00376700
                             TO DE-BEN-AMT(WS-SUB-COV)                  00376800
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00376900
                       ELSE                                             00377000
                           MOVE WS-AMOUNT-9-2 TO PROAMT1O               00377100
                                                 TRX-UPD-NEW-VALUE      00377200
                           MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2 00377300
                           MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE      00377400
                           MOVE WS-AMOUNT-NO-COMMAS                     00377500
                             TO DE-BEN-AMT(WS-SUB-COV)                  00377600
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00377700
                       END-IF                                           00377800
                       PERFORM 4600-HOLD-TRX THRU 4600-EXIT             00377900
                   ELSE                                                 00378000
                       MOVE 'E703' TO WS-MESSAGE-CODE-HOLD              00378100
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00378200
                       MOVE -1 TO PROAMT1L                              00378300
                       MOVE RED-COLOR TO PROAMT1C                       00378400
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00378500
                                                                        00378600
           IF REVAMT1L > ZERO                                           00378700
               IF REVAMT1I = SPACES                                     00378800
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00378900
                   IF DE-REV                                            00379000
                       MOVE 'REV AMT - 1' TO TRX-UPD-FIELD-NAME         00379100
                   ELSE                                                 00379200
                       MOVE 'ADJ AMT - 1' TO TRX-UPD-FIELD-NAME         00379300
                   END-IF                                               00379400
                   MOVE DE-BEN-AMT-REV(WS-SUB-COV) TO WS-AMOUNT-9-2     00379500
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00379600
                   MOVE ZEROES TO DE-BEN-AMT-REV(WS-SUB-COV)            00379700
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00379800
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00379900
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00380000
               ELSE                                                     00380100
                   MOVE REVAMT1I TO WS-AMOUNT-IN-AREA                   00380200
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00380300
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00380400
                   IF FIELD-IS-VALID                                    00380500
                       IF DE-REV AND                                    00380600
                         ((WS-NEG-NON-COV AND                           00380700
                           (WS-AMOUNT-NO-COMMAS-SIGNED                  00380800
                            < DE-BEN-AMT(WS-SUB-COV)))   OR             00380900
                          ((NOT WS-NEG-NON-COV) AND                     00381000
                           (WS-AMOUNT-NO-COMMAS                         00381100
                            > DE-BEN-AMT(WS-SUB-COV))))                 00381200
                           MOVE 'E837' TO WS-MESSAGE-CODE-HOLD          00381300
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00381400
                           MOVE -1 TO REVAMT1L                          00381500
                           MOVE RED-COLOR TO REVAMT1C                   00381600
                           MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG            00381700
                       ELSE                                             00381800
                           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC           00381900
                           IF DE-REV                                    00382000
                               MOVE 'REV AMT - 1' TO TRX-UPD-FIELD-NAME 00382100
                           ELSE                                         00382200
                               MOVE 'ADJ AMT - 1' TO TRX-UPD-FIELD-NAME 00382300
                           END-IF                                       00382400
                           IF WS-NEG-NON-COV                            00382500
                               MOVE WS-AMOUNT-9-2 TO REVAMT1O           00382600
                               MOVE '-' TO OPERTR1O                     00382700
                               MOVE WS-AMOUNT-9-2-SIGNED                00382800
                                 TO TRX-UPD-NEW-VALUE                   00382900
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00383000
                                 TO WS-AMOUNT-9-2-SIGNED                00383100
                               MOVE WS-AMOUNT-9-2-SIGNED                00383200
                                 TO TRX-UPD-OLD-VALUE                   00383300
                               MOVE WS-AMOUNT-NO-COMMAS-SIGNED          00383400
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00383500
                                    WS-DISPLAY-AMT(WS-SUB-DISPLAY)      00383600
                           ELSE                                         00383700
                               MOVE WS-AMOUNT-9-2 TO REVAMT1O           00383800
                                                     TRX-UPD-NEW-VALUE  00383900
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00384000
                                 TO WS-AMOUNT-9-2                       00384100
                               MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE  00384200
                               MOVE WS-AMOUNT-NO-COMMAS                 00384300
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00384400
                                    WS-DISPLAY-REV(WS-SUB-DISPLAY)      00384500
                           END-IF                                       00384600
                           PERFORM 4600-HOLD-TRX THRU 4600-EXIT         00384700
                   ELSE                                                 00384800
                       MOVE 'E711' TO WS-MESSAGE-CODE-HOLD              00384900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00385000
                       MOVE -1 TO REVAMT1L                              00385100
                       MOVE RED-COLOR TO REVAMT1C                       00385200
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00385300
                                                                        00385400
            IF RC1L > ZERO                                              00385500
                MOVE RC1I TO WS-EDIT-RC                                 00385600
                IF WS-VALID-RC                                          00385700
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00385800
                   MOVE 'RC -  1' TO TRX-UPD-FIELD-NAME                 00385900
                   MOVE DE-REAS-CODE(WS-SUB-COV) TO TRX-UPD-OLD-VALUE   00386000
                   MOVE RC1I TO DE-REAS-CODE(WS-SUB-COV)                00386100
                                WS-DISPLAY-RC(WS-SUB-DISPLAY)           00386200
                                TRX-UPD-NEW-VALUE                       00386300
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00386400
               ELSE                                                     00386500
                   MOVE 'E719' TO WS-MESSAGE-CODE-HOLD                  00386600
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00386700
                   MOVE -1 TO RC1L                                      00386800
                   MOVE RED-COLOR TO RC1C                               00386900
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00387000
                                                                        00387100
       2718-1-EXIT.                                                     00387200
           EXIT.                                                        00387300
       EJECT                                                            00387400
       2718-2-PERFORM-UPDATE.                                           00387500
                                                                        00387600
           MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB-COV.         00387700
                                                                        00387800
           IF STATUS2L > ZERO                                           00387900
               MOVE STATUS2I TO WS-EDIT-CLM-STS                         00388000
               IF WS-VALID-CLM-STS                                      00388100
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00388200
                   MOVE 'STS - 2' TO TRX-UPD-FIELD-NAME                 00388300
                   MOVE DE-STS(WS-SUB-COV)                              00388400
                     TO TRX-UPD-OLD-VALUE                               00388500
                   MOVE STATUS2I                                        00388600
                     TO DE-STS(WS-SUB-COV)                              00388700
                        WS-DISPLAY-STS(WS-SUB-DISPLAY)                  00388800
                   MOVE DE-STS(WS-SUB-COV)                              00388900
                     TO TRX-UPD-NEW-VALUE                               00389000
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00389100
               ELSE                                                     00389200
                   MOVE 'E696' TO WS-MESSAGE-CODE-HOLD                  00389300
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00389400
                   MOVE -1 TO STATUS2L                                  00389500
                   MOVE RED-COLOR TO STATUS2C                           00389600
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00389700
                                                                        00389800
           IF TITLE2L > ZERO                                            00389900
               MOVE TITLE2I TO WS-EDIT-COVERAGE                         00390000
               IF WS-VALID-NON-COV                                      00390100
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00390200
                   MOVE 'NON-COV - 2' TO TRX-UPD-FIELD-NAME             00390300
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00390400
                     TO TRX-UPD-OLD-VALUE                               00390500
                   MOVE TITLE2I                                         00390600
                     TO DE-PLAN-CODE(WS-SUB-COV)                        00390700
                        WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY)             00390800
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00390900
                     TO TRX-UPD-NEW-VALUE                               00391000
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00391100
               ELSE                                                     00391200
                   MOVE 'EC32' TO WS-MESSAGE-CODE-HOLD                  00391300
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00391400
                   MOVE -1 TO TITLE2L                                   00391500
                   MOVE RED-COLOR TO TITLE2C                            00391600
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00391700
                                                                        00391800
           IF PROAMT2L > ZERO                                           00391900
               IF PROAMT2I = SPACES                                     00392000
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00392100
                   MOVE 'PROCEEDS AMT -2' TO TRX-UPD-FIELD-NAME         00392200
                   MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2         00392300
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00392400
                   MOVE ZEROES TO DE-BEN-AMT(WS-SUB-COV)                00392500
                                  WS-DISPLAY-AMT(WS-SUB-DISPLAY)        00392600
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00392700
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00392800
               ELSE                                                     00392900
                   MOVE PROAMT2I TO WS-AMOUNT-IN-AREA                   00393000
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00393100
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00393200
                   IF FIELD-IS-VALID                                    00393300
                       MOVE WS-TRX-UPD-REC TO TRX-UPD-REC               00393400
                       MOVE 'PROCEEDS AMT -2' TO                        00393500
                         TRX-UPD-FIELD-NAME                             00393600
                       IF WS-NEG-NON-COV                                00393700
                           MOVE WS-AMOUNT-9-2 TO PROAMT2O               00393800
                           MOVE '-' TO OPERTR2O                         00393900
                           MOVE WS-AMOUNT-9-2-SIGNED                    00394000
                             TO TRX-UPD-NEW-VALUE                       00394100
                           MOVE DE-BEN-AMT(WS-SUB-COV)                  00394200
                             TO WS-AMOUNT-9-2-SIGNED                    00394300
                           MOVE WS-AMOUNT-9-2-SIGNED                    00394400
                             TO TRX-UPD-OLD-VALUE                       00394500
                           MOVE WS-AMOUNT-NO-COMMAS-SIGNED              00394600
                             TO DE-BEN-AMT(WS-SUB-COV)                  00394700
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00394800
                       ELSE                                             00394900
                           MOVE WS-AMOUNT-9-2 TO PROAMT2O               00395000
                                                 TRX-UPD-NEW-VALUE      00395100
                           MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2 00395200
                           MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE      00395300
                           MOVE WS-AMOUNT-NO-COMMAS                     00395400
                             TO DE-BEN-AMT(WS-SUB-COV)                  00395500
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00395600
                       END-IF                                           00395700
                       PERFORM 4600-HOLD-TRX THRU 4600-EXIT             00395800
                   ELSE                                                 00395900
                       MOVE 'E704' TO WS-MESSAGE-CODE-HOLD              00396000
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00396100
                       MOVE -1 TO PROAMT2L                              00396200
                       MOVE RED-COLOR TO PROAMT2C                       00396300
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00396400
                                                                        00396500
           IF REVAMT2L > ZERO                                           00396600
               IF REVAMT2I = SPACES                                     00396700
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00396800
                   IF DE-REV                                            00396900
                       MOVE 'REV AMT - 2' TO TRX-UPD-FIELD-NAME         00397000
                   ELSE                                                 00397100
                       MOVE 'ADJ AMT - 2' TO TRX-UPD-FIELD-NAME         00397200
                   END-IF                                               00397300
                   MOVE DE-BEN-AMT-REV(WS-SUB-COV) TO WS-AMOUNT-9-2     00397400
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00397500
                   MOVE ZEROES TO DE-BEN-AMT-REV(WS-SUB-COV)            00397600
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00397700
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00397800
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00397900
               ELSE                                                     00398000
                   MOVE REVAMT2I TO WS-AMOUNT-IN-AREA                   00398100
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00398200
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00398300
                   IF FIELD-IS-VALID                                    00398400
                       IF DE-REV AND                                    00398500
                         ((WS-NEG-NON-COV AND                           00398600
                           (WS-AMOUNT-NO-COMMAS-SIGNED                  00398700
                            < DE-BEN-AMT(WS-SUB-COV)))   OR             00398800
                          ((NOT WS-NEG-NON-COV) AND                     00398900
                           (WS-AMOUNT-NO-COMMAS                         00399000
                            > DE-BEN-AMT(WS-SUB-COV))))                 00399100
                           MOVE 'E838' TO WS-MESSAGE-CODE-HOLD          00399200
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00399300
                           MOVE -1 TO REVAMT2L                          00399400
                           MOVE RED-COLOR TO REVAMT2C                   00399500
                           MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG            00399600
                       ELSE                                             00399700
                           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC           00399800
                           IF DE-REV                                    00399900
                               MOVE 'REV AMT - 2' TO TRX-UPD-FIELD-NAME 00400000
                           ELSE                                         00400100
                               MOVE 'ADJ AMT - 2' TO TRX-UPD-FIELD-NAME 00400200
                           END-IF                                       00400300
                           IF WS-NEG-NON-COV                            00400400
                               MOVE WS-AMOUNT-9-2 TO REVAMT2O           00400500
                               MOVE '-' TO OPERTR2O                     00400600
                               MOVE WS-AMOUNT-9-2-SIGNED                00400700
                                 TO TRX-UPD-NEW-VALUE                   00400800
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00400900
                                 TO WS-AMOUNT-9-2-SIGNED                00401000
                               MOVE WS-AMOUNT-9-2-SIGNED                00401100
                                 TO TRX-UPD-OLD-VALUE                   00401200
                               MOVE WS-AMOUNT-NO-COMMAS-SIGNED          00401300
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00401400
                                    WS-DISPLAY-AMT(WS-SUB-DISPLAY)      00401500
                           ELSE                                         00401600
                               MOVE WS-AMOUNT-9-2 TO REVAMT2O           00401700
                                                     TRX-UPD-NEW-VALUE  00401800
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00401900
                                 TO WS-AMOUNT-9-2                       00402000
                               MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE  00402100
                               MOVE WS-AMOUNT-NO-COMMAS                 00402200
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00402300
                                    WS-DISPLAY-REV(WS-SUB-DISPLAY)      00402400
                           END-IF                                       00402500
                           PERFORM 4600-HOLD-TRX THRU 4600-EXIT         00402600
                   ELSE                                                 00402700
                       MOVE 'E712' TO WS-MESSAGE-CODE-HOLD              00402800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00402900
                       MOVE -1 TO REVAMT2L                              00403000
                       MOVE RED-COLOR TO REVAMT2C                       00403100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00403200
                                                                        00403300
            IF RC2L > ZERO                                              00403400
                MOVE RC2I TO WS-EDIT-RC                                 00403500
                IF WS-VALID-RC                                          00403600
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00403700
                   MOVE 'RC -  2' TO TRX-UPD-FIELD-NAME                 00403800
                   MOVE DE-REAS-CODE(WS-SUB-COV) TO TRX-UPD-OLD-VALUE   00403900
                   MOVE RC2I TO DE-REAS-CODE(WS-SUB-COV)                00404000
                                WS-DISPLAY-RC(WS-SUB-DISPLAY)           00404100
                                TRX-UPD-NEW-VALUE                       00404200
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00404300
               ELSE                                                     00404400
                   MOVE 'E720' TO WS-MESSAGE-CODE-HOLD                  00404500
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00404600
                   MOVE -1 TO RC2L                                      00404700
                   MOVE RED-COLOR TO RC2C                               00404800
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00404900
                                                                        00405000
       2718-2-EXIT.                                                     00405100
           EXIT.                                                        00405200
       EJECT                                                            00405300
       2718-3-PERFORM-UPDATE.                                           00405400
                                                                        00405500
           MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB-COV.         00405600
                                                                        00405700
           IF STATUS3L > ZERO                                           00405800
               MOVE STATUS3I TO WS-EDIT-CLM-STS                         00405900
               IF WS-VALID-CLM-STS                                      00406000
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00406100
                   MOVE 'STS - 3' TO TRX-UPD-FIELD-NAME                 00406200
                   MOVE DE-STS(WS-SUB-COV)                              00406300
                     TO TRX-UPD-OLD-VALUE                               00406400
                   MOVE STATUS3I                                        00406500
                     TO DE-STS(WS-SUB-COV)                              00406600
                        WS-DISPLAY-STS(WS-SUB-DISPLAY)                  00406700
                   MOVE DE-STS(WS-SUB-COV)                              00406800
                     TO TRX-UPD-NEW-VALUE                               00406900
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00407000
               ELSE                                                     00407100
                   MOVE 'E697' TO WS-MESSAGE-CODE-HOLD                  00407200
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00407300
                   MOVE -1 TO STATUS3L                                  00407400
                   MOVE RED-COLOR TO STATUS3C                           00407500
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00407600
                                                                        00407700
           IF TITLE3L > ZERO                                            00407800
               MOVE TITLE3I TO WS-EDIT-COVERAGE                         00407900
               IF WS-VALID-NON-COV                                      00408000
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00408100
                   MOVE 'NON-COV - 3' TO TRX-UPD-FIELD-NAME             00408200
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00408300
                     TO TRX-UPD-OLD-VALUE                               00408400
                   MOVE TITLE3I                                         00408500
                     TO DE-PLAN-CODE(WS-SUB-COV)                        00408600
                        WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY)             00408700
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00408800
                     TO TRX-UPD-NEW-VALUE                               00408900
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00409000
               ELSE                                                     00409100
                   MOVE 'EC33' TO WS-MESSAGE-CODE-HOLD                  00409200
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00409300
                   MOVE -1 TO TITLE3L                                   00409400
                   MOVE RED-COLOR TO TITLE3C                            00409500
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00409600
                                                                        00409700
           IF PROAMT3L > ZERO                                           00409800
               IF PROAMT3I = SPACES                                     00409900
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00410000
                   MOVE 'PROCEEDS AMT -3' TO TRX-UPD-FIELD-NAME         00410100
                   MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2         00410200
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00410300
                   MOVE ZEROES TO DE-BEN-AMT(WS-SUB-COV)                00410400
                                  WS-DISPLAY-AMT(WS-SUB-DISPLAY)        00410500
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00410600
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00410700
               ELSE                                                     00410800
                   MOVE PROAMT3I TO WS-AMOUNT-IN-AREA                   00410900
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00411000
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00411100
                   IF FIELD-IS-VALID                                    00411200
                       MOVE WS-TRX-UPD-REC TO TRX-UPD-REC               00411300
                       MOVE 'PROCEEDS AMT -3' TO                        00411400
                         TRX-UPD-FIELD-NAME                             00411500
                       IF WS-NEG-NON-COV                                00411600
                           MOVE WS-AMOUNT-9-2 TO PROAMT3O               00411700
                           MOVE '-' TO OPERTR3O                         00411800
                           MOVE WS-AMOUNT-9-2-SIGNED                    00411900
                             TO TRX-UPD-NEW-VALUE                       00412000
                           MOVE DE-BEN-AMT(WS-SUB-COV)                  00412100
                             TO WS-AMOUNT-9-2-SIGNED                    00412200
                           MOVE WS-AMOUNT-9-2-SIGNED                    00412300
                             TO TRX-UPD-OLD-VALUE                       00412400
                           MOVE WS-AMOUNT-NO-COMMAS-SIGNED              00412500
                             TO DE-BEN-AMT(WS-SUB-COV)                  00412600
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00412700
                       ELSE                                             00412800
                           MOVE WS-AMOUNT-9-2 TO PROAMT3O               00412900
                                                 TRX-UPD-NEW-VALUE      00413000
                           MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2 00413100
                           MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE      00413200
                           MOVE WS-AMOUNT-NO-COMMAS                     00413300
                             TO DE-BEN-AMT(WS-SUB-COV)                  00413400
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00413500
                       END-IF                                           00413600
                       PERFORM 4600-HOLD-TRX THRU 4600-EXIT             00413700
                   ELSE                                                 00413800
                       MOVE 'E705' TO WS-MESSAGE-CODE-HOLD              00413900
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00414000
                       MOVE -1 TO PROAMT3L                              00414100
                       MOVE RED-COLOR TO PROAMT3C                       00414200
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00414300
                                                                        00414400
           IF REVAMT3L > ZERO                                           00414500
               IF REVAMT3I = SPACES                                     00414600
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00414700
                   IF DE-REV                                            00414800
                       MOVE 'REV AMT - 3' TO TRX-UPD-FIELD-NAME         00414900
                   ELSE                                                 00415000
                       MOVE 'ADJ AMT - 3' TO TRX-UPD-FIELD-NAME         00415100
                   END-IF                                               00415200
                   MOVE DE-BEN-AMT-REV(WS-SUB-COV) TO WS-AMOUNT-9-2     00415300
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00415400
                   MOVE ZEROES TO DE-BEN-AMT-REV(WS-SUB-COV)            00415500
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00415600
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00415700
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00415800
               ELSE                                                     00415900
                   MOVE REVAMT3I TO WS-AMOUNT-IN-AREA                   00416000
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00416100
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00416200
                   IF FIELD-IS-VALID                                    00416300
                       IF DE-REV AND                                    00416400
                         ((WS-NEG-NON-COV AND                           00416500
                           (WS-AMOUNT-NO-COMMAS-SIGNED                  00416600
                            < DE-BEN-AMT(WS-SUB-COV)))   OR             00416700
                          ((NOT WS-NEG-NON-COV) AND                     00416800
                           (WS-AMOUNT-NO-COMMAS                         00416900
                            > DE-BEN-AMT(WS-SUB-COV))))                 00417000
                           MOVE 'E839' TO WS-MESSAGE-CODE-HOLD          00417100
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00417200
                           MOVE -1 TO REVAMT3L                          00417300
                           MOVE RED-COLOR TO REVAMT3C                   00417400
                           MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG            00417500
                       ELSE                                             00417600
                           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC           00417700
                           IF DE-REV                                    00417800
                               MOVE 'REV AMT - 3' TO TRX-UPD-FIELD-NAME 00417900
                           ELSE                                         00418000
                               MOVE 'ADJ AMT - 3' TO TRX-UPD-FIELD-NAME 00418100
                           END-IF                                       00418200
                           IF WS-NEG-NON-COV                            00418300
                               MOVE WS-AMOUNT-9-2 TO REVAMT3O           00418400
                               MOVE '-' TO OPERTR3O                     00418500
                               MOVE WS-AMOUNT-9-2-SIGNED                00418600
                                 TO TRX-UPD-NEW-VALUE                   00418700
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00418800
                                 TO WS-AMOUNT-9-2-SIGNED                00418900
                               MOVE WS-AMOUNT-9-2-SIGNED                00419000
                                 TO TRX-UPD-OLD-VALUE                   00419100
                               MOVE WS-AMOUNT-NO-COMMAS-SIGNED          00419200
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00419300
                                    WS-DISPLAY-AMT(WS-SUB-DISPLAY)      00419400
                           ELSE                                         00419500
                               MOVE WS-AMOUNT-9-2 TO REVAMT3O           00419600
                                                     TRX-UPD-NEW-VALUE  00419700
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00419800
                                 TO WS-AMOUNT-9-2                       00419900
                               MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE  00420000
                               MOVE WS-AMOUNT-NO-COMMAS                 00420100
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00420200
                                    WS-DISPLAY-REV(WS-SUB-DISPLAY)      00420300
                           END-IF                                       00420400
                           PERFORM 4600-HOLD-TRX THRU 4600-EXIT         00420500
                   ELSE                                                 00420600
                       MOVE 'E713' TO WS-MESSAGE-CODE-HOLD              00420700
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00420800
                       MOVE -1 TO REVAMT3L                              00420900
                       MOVE RED-COLOR TO REVAMT3C                       00421000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00421100
                                                                        00421200
            IF RC3L > ZERO                                              00421300
                MOVE RC3I TO WS-EDIT-RC                                 00421400
                IF WS-VALID-RC                                          00421500
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00421600
                   MOVE 'RC -  3' TO TRX-UPD-FIELD-NAME                 00421700
                   MOVE DE-REAS-CODE(WS-SUB-COV) TO TRX-UPD-OLD-VALUE   00421800
                   MOVE RC3I TO DE-REAS-CODE(WS-SUB-COV)                00421900
                                WS-DISPLAY-RC(WS-SUB-DISPLAY)           00422000
                                TRX-UPD-NEW-VALUE                       00422100
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00422200
               ELSE                                                     00422300
                   MOVE 'E721' TO WS-MESSAGE-CODE-HOLD                  00422400
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00422500
                   MOVE -1 TO RC3L                                      00422600
                   MOVE RED-COLOR TO RC3C                               00422700
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00422800
                                                                        00422900
       2718-3-EXIT.                                                     00423000
           EXIT.                                                        00423100
       EJECT                                                            00423200
       2718-4-PERFORM-UPDATE.                                           00423300
                                                                        00423400
           MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB-COV.         00423500
                                                                        00423600
           IF STATUS4L > ZERO                                           00423700
               MOVE STATUS4I TO WS-EDIT-CLM-STS                         00423800
               IF WS-VALID-CLM-STS                                      00423900
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00424000
                   MOVE 'STS - 4' TO TRX-UPD-FIELD-NAME                 00424100
                   MOVE DE-STS(WS-SUB-COV)                              00424200
                     TO TRX-UPD-OLD-VALUE                               00424300
                   MOVE STATUS4I                                        00424400
                     TO DE-STS(WS-SUB-COV)                              00424500
                        WS-DISPLAY-STS(WS-SUB-DISPLAY)                  00424600
                   MOVE DE-STS(WS-SUB-COV)                              00424700
                     TO TRX-UPD-NEW-VALUE                               00424800
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00424900
               ELSE                                                     00425000
                   MOVE 'E698' TO WS-MESSAGE-CODE-HOLD                  00425100
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00425200
                   MOVE -1 TO STATUS4L                                  00425300
                   MOVE RED-COLOR TO STATUS4C                           00425400
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00425500
                                                                        00425600
           IF TITLE4L > ZERO                                            00425700
               MOVE TITLE4I TO WS-EDIT-COVERAGE                         00425800
               IF WS-VALID-NON-COV                                      00425900
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00426000
                   MOVE 'NON-COV - 4' TO TRX-UPD-FIELD-NAME             00426100
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00426200
                     TO TRX-UPD-OLD-VALUE                               00426300
                   MOVE TITLE4I                                         00426400
                     TO DE-PLAN-CODE(WS-SUB-COV)                        00426500
                        WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY)             00426600
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00426700
                     TO TRX-UPD-NEW-VALUE                               00426800
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00426900
               ELSE                                                     00427000
                   MOVE 'EC34' TO WS-MESSAGE-CODE-HOLD                  00427100
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00427200
                   MOVE -1 TO TITLE4L                                   00427300
                   MOVE RED-COLOR TO TITLE4C                            00427400
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00427500
                                                                        00427600
           IF PROAMT4L > ZERO                                           00427700
               IF PROAMT4I = SPACES                                     00427800
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00427900
                   MOVE 'PROCEEDS AMT -4' TO TRX-UPD-FIELD-NAME         00428000
                   MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2         00428100
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00428200
                   MOVE ZEROES TO DE-BEN-AMT(WS-SUB-COV)                00428300
                                  WS-DISPLAY-AMT(WS-SUB-DISPLAY)        00428400
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00428500
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00428600
               ELSE                                                     00428700
                   MOVE PROAMT4I TO WS-AMOUNT-IN-AREA                   00428800
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00428900
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00429000
                   IF FIELD-IS-VALID                                    00429100
                       MOVE WS-TRX-UPD-REC TO TRX-UPD-REC               00429200
                       MOVE 'PROCEEDS AMT -4' TO                        00429300
                         TRX-UPD-FIELD-NAME                             00429400
                       IF WS-NEG-NON-COV                                00429500
                           MOVE WS-AMOUNT-9-2 TO PROAMT4O               00429600
                           MOVE '-' TO OPERTR4O                         00429700
                           MOVE WS-AMOUNT-9-2-SIGNED                    00429800
                             TO TRX-UPD-NEW-VALUE                       00429900
                           MOVE DE-BEN-AMT(WS-SUB-COV)                  00430000
                             TO WS-AMOUNT-9-2-SIGNED                    00430100
                           MOVE WS-AMOUNT-9-2-SIGNED                    00430200
                             TO TRX-UPD-OLD-VALUE                       00430300
                           MOVE WS-AMOUNT-NO-COMMAS-SIGNED              00430400
                             TO DE-BEN-AMT(WS-SUB-COV)                  00430500
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00430600
                       ELSE                                             00430700
                           MOVE WS-AMOUNT-9-2 TO PROAMT4O               00430800
                                                 TRX-UPD-NEW-VALUE      00430900
                           MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2 00431000
                           MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE      00431100
                           MOVE WS-AMOUNT-NO-COMMAS                     00431200
                             TO DE-BEN-AMT(WS-SUB-COV)                  00431300
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00431400
                       END-IF                                           00431500
                       PERFORM 4600-HOLD-TRX THRU 4600-EXIT             00431600
                   ELSE                                                 00431700
                       MOVE 'E706' TO WS-MESSAGE-CODE-HOLD              00431800
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00431900
                       MOVE -1 TO PROAMT4L                              00432000
                       MOVE RED-COLOR TO PROAMT4C                       00432100
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00432200
                                                                        00432300
           IF REVAMT4L > ZERO                                           00432400
               IF REVAMT4I = SPACES                                     00432500
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00432600
                   IF DE-REV                                            00432700
                       MOVE 'REV AMT - 4' TO TRX-UPD-FIELD-NAME         00432800
                   ELSE                                                 00432900
                       MOVE 'ADJ AMT - 4' TO TRX-UPD-FIELD-NAME         00433000
                   END-IF                                               00433100
                   MOVE DE-BEN-AMT-REV(WS-SUB-COV) TO WS-AMOUNT-9-2     00433200
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00433300
                   MOVE ZEROES TO DE-BEN-AMT-REV(WS-SUB-COV)            00433400
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00433500
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00433600
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00433700
               ELSE                                                     00433800
                   MOVE REVAMT4I TO WS-AMOUNT-IN-AREA                   00433900
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00434000
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00434100
                   IF FIELD-IS-VALID                                    00434200
                       IF DE-REV AND                                    00434300
                         ((WS-NEG-NON-COV AND                           00434400
                           (WS-AMOUNT-NO-COMMAS-SIGNED                  00434500
                            < DE-BEN-AMT(WS-SUB-COV)))   OR             00434600
                          ((NOT WS-NEG-NON-COV) AND                     00434700
                           (WS-AMOUNT-NO-COMMAS                         00434800
                            > DE-BEN-AMT(WS-SUB-COV))))                 00434900
                           MOVE 'E840' TO WS-MESSAGE-CODE-HOLD          00435000
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00435100
                           MOVE -1 TO REVAMT4L                          00435200
                           MOVE RED-COLOR TO REVAMT4C                   00435300
                           MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG            00435400
                       ELSE                                             00435500
                           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC           00435600
                           IF DE-REV                                    00435700
                               MOVE 'REV AMT - 4' TO TRX-UPD-FIELD-NAME 00435800
                           ELSE                                         00435900
                               MOVE 'ADJ AMT - 4' TO TRX-UPD-FIELD-NAME 00436000
                           END-IF                                       00436100
                           IF WS-NEG-NON-COV                            00436200
                               MOVE WS-AMOUNT-9-2 TO REVAMT4O           00436300
                               MOVE '-' TO OPERTR4O                     00436400
                               MOVE WS-AMOUNT-9-2-SIGNED                00436500
                                 TO TRX-UPD-NEW-VALUE                   00436600
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00436700
                                 TO WS-AMOUNT-9-2-SIGNED                00436800
                               MOVE WS-AMOUNT-9-2-SIGNED                00436900
                                 TO TRX-UPD-OLD-VALUE                   00437000
                               MOVE WS-AMOUNT-NO-COMMAS-SIGNED          00437100
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00437200
                                    WS-DISPLAY-AMT(WS-SUB-DISPLAY)      00437300
                           ELSE                                         00437400
                               MOVE WS-AMOUNT-9-2 TO REVAMT4O           00437500
                                                     TRX-UPD-NEW-VALUE  00437600
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00437700
                                 TO WS-AMOUNT-9-2                       00437800
                               MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE  00437900
                               MOVE WS-AMOUNT-NO-COMMAS                 00438000
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00438100
                                    WS-DISPLAY-REV(WS-SUB-DISPLAY)      00438200
                           END-IF                                       00438300
                           PERFORM 4600-HOLD-TRX THRU 4600-EXIT         00438400
                   ELSE                                                 00438500
                       MOVE 'E714' TO WS-MESSAGE-CODE-HOLD              00438600
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00438700
                       MOVE -1 TO REVAMT4L                              00438800
                       MOVE RED-COLOR TO REVAMT4C                       00438900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00439000
                                                                        00439100
            IF RC4L > ZERO                                              00439200
                MOVE RC4I TO WS-EDIT-RC                                 00439300
                IF WS-VALID-RC                                          00439400
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00439500
                   MOVE 'RC -  4' TO TRX-UPD-FIELD-NAME                 00439600
                   MOVE DE-REAS-CODE(WS-SUB-COV) TO TRX-UPD-OLD-VALUE   00439700
                   MOVE RC4I TO DE-REAS-CODE(WS-SUB-COV)                00439800
                                WS-DISPLAY-RC(WS-SUB-DISPLAY)           00439900
                                TRX-UPD-NEW-VALUE                       00440000
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00440100
               ELSE                                                     00440200
                   MOVE 'E722' TO WS-MESSAGE-CODE-HOLD                  00440300
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00440400
                   MOVE -1 TO RC4L                                      00440500
                   MOVE RED-COLOR TO RC4C                               00440600
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00440700
                                                                        00440800
       2718-4-EXIT.                                                     00440900
           EXIT.                                                        00441000
       EJECT                                                            00441100
       2718-5-PERFORM-UPDATE.                                           00441200
                                                                        00441300
           MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB-COV.         00441400
                                                                        00441500
           IF STATUS5L > ZERO                                           00441600
               MOVE STATUS5I TO WS-EDIT-CLM-STS                         00441700
               IF WS-VALID-CLM-STS                                      00441800
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00441900
                   MOVE 'STS - 5' TO TRX-UPD-FIELD-NAME                 00442000
                   MOVE DE-STS(WS-SUB-COV)                              00442100
                     TO TRX-UPD-OLD-VALUE                               00442200
                   MOVE STATUS5I                                        00442300
                     TO DE-STS(WS-SUB-COV)                              00442400
                        WS-DISPLAY-STS(WS-SUB-DISPLAY)                  00442500
                   MOVE DE-STS(WS-SUB-COV)                              00442600
                     TO TRX-UPD-NEW-VALUE                               00442700
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00442800
               ELSE                                                     00442900
                   MOVE 'E699' TO WS-MESSAGE-CODE-HOLD                  00443000
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00443100
                   MOVE -1 TO STATUS5L                                  00443200
                   MOVE RED-COLOR TO STATUS5C                           00443300
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00443400
                                                                        00443500
           IF TITLE5L > ZERO                                            00443600
               MOVE TITLE5I TO WS-EDIT-COVERAGE                         00443700
               IF WS-VALID-NON-COV                                      00443800
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00443900
                   MOVE 'NON-COV - 5' TO TRX-UPD-FIELD-NAME             00444000
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00444100
                     TO TRX-UPD-OLD-VALUE                               00444200
                   MOVE TITLE5I                                         00444300
                     TO DE-PLAN-CODE(WS-SUB-COV)                        00444400
                        WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY)             00444500
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00444600
                     TO TRX-UPD-NEW-VALUE                               00444700
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00444800
               ELSE                                                     00444900
                   MOVE 'EC35' TO WS-MESSAGE-CODE-HOLD                  00445000
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00445100
                   MOVE -1 TO TITLE5L                                   00445200
                   MOVE RED-COLOR TO TITLE5C                            00445300
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00445400
                                                                        00445500
           IF PROAMT5L > ZERO                                           00445600
               IF PROAMT5I = SPACES                                     00445700
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00445800
                   MOVE 'PROCEEDS AMT -5' TO TRX-UPD-FIELD-NAME         00445900
                   MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2         00446000
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00446100
                   MOVE ZEROES TO DE-BEN-AMT(WS-SUB-COV)                00446200
                                  WS-DISPLAY-AMT(WS-SUB-DISPLAY)        00446300
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00446400
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00446500
               ELSE                                                     00446600
                   MOVE PROAMT5I TO WS-AMOUNT-IN-AREA                   00446700
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00446800
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00446900
                   IF FIELD-IS-VALID                                    00447000
                       MOVE WS-TRX-UPD-REC TO TRX-UPD-REC               00447100
                       MOVE 'PROCEEDS AMT -5' TO                        00447200
                         TRX-UPD-FIELD-NAME                             00447300
                       IF WS-NEG-NON-COV                                00447400
                           MOVE WS-AMOUNT-9-2 TO PROAMT5O               00447500
                           MOVE '-' TO OPERTR5O                         00447600
                           MOVE WS-AMOUNT-9-2-SIGNED                    00447700
                             TO TRX-UPD-NEW-VALUE                       00447800
                           MOVE DE-BEN-AMT(WS-SUB-COV)                  00447900
                             TO WS-AMOUNT-9-2-SIGNED                    00448000
                           MOVE WS-AMOUNT-9-2-SIGNED                    00448100
                             TO TRX-UPD-OLD-VALUE                       00448200
                           MOVE WS-AMOUNT-NO-COMMAS-SIGNED              00448300
                             TO DE-BEN-AMT(WS-SUB-COV)                  00448400
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00448500
                       ELSE                                             00448600
                           MOVE WS-AMOUNT-9-2 TO PROAMT5O               00448700
                                                 TRX-UPD-NEW-VALUE      00448800
                           MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2 00448900
                           MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE      00449000
                           MOVE WS-AMOUNT-NO-COMMAS                     00449100
                             TO DE-BEN-AMT(WS-SUB-COV)                  00449200
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00449300
                       END-IF                                           00449400
                       PERFORM 4600-HOLD-TRX THRU 4600-EXIT             00449500
                   ELSE                                                 00449600
                       MOVE 'E707' TO WS-MESSAGE-CODE-HOLD              00449700
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00449800
                       MOVE -1 TO PROAMT5L                              00449900
                       MOVE RED-COLOR TO PROAMT5C                       00450000
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00450100
                                                                        00450200
           IF REVAMT5L > ZERO                                           00450300
               IF REVAMT5I = SPACES                                     00450400
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00450500
                   IF DE-REV                                            00450600
                       MOVE 'REV AMT - 5' TO TRX-UPD-FIELD-NAME         00450700
                   ELSE                                                 00450800
                       MOVE 'ADJ AMT - 5' TO TRX-UPD-FIELD-NAME         00450900
                   END-IF                                               00451000
                   MOVE DE-BEN-AMT-REV(WS-SUB-COV) TO WS-AMOUNT-9-2     00451100
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00451200
                   MOVE ZEROES TO DE-BEN-AMT-REV(WS-SUB-COV)            00451300
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00451400
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00451500
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00451600
               ELSE                                                     00451700
                   MOVE REVAMT5I TO WS-AMOUNT-IN-AREA                   00451800
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00451900
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00452000
                   IF FIELD-IS-VALID                                    00452100
                       IF DE-REV AND                                    00452200
                         ((WS-NEG-NON-COV AND                           00452300
                           (WS-AMOUNT-NO-COMMAS-SIGNED                  00452400
                            < DE-BEN-AMT(WS-SUB-COV)))   OR             00452500
                          ((NOT WS-NEG-NON-COV) AND                     00452600
                           (WS-AMOUNT-NO-COMMAS                         00452700
                            > DE-BEN-AMT(WS-SUB-COV))))                 00452800
                           MOVE 'E841' TO WS-MESSAGE-CODE-HOLD          00452900
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00453000
                           MOVE -1 TO REVAMT5L                          00453100
                           MOVE RED-COLOR TO REVAMT5C                   00453200
                           MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG            00453300
                       ELSE                                             00453400
                           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC           00453500
                           IF DE-REV                                    00453600
                               MOVE 'REV AMT - 5' TO TRX-UPD-FIELD-NAME 00453700
                           ELSE                                         00453800
                               MOVE 'ADJ AMT - 5' TO TRX-UPD-FIELD-NAME 00453900
                           END-IF                                       00454000
                           IF WS-NEG-NON-COV                            00454100
                               MOVE WS-AMOUNT-9-2 TO REVAMT5O           00454200
                               MOVE '-' TO OPERTR5O                     00454300
                               MOVE WS-AMOUNT-9-2-SIGNED                00454400
                                 TO TRX-UPD-NEW-VALUE                   00454500
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00454600
                                 TO WS-AMOUNT-9-2-SIGNED                00454700
                               MOVE WS-AMOUNT-9-2-SIGNED                00454800
                                 TO TRX-UPD-OLD-VALUE                   00454900
                               MOVE WS-AMOUNT-NO-COMMAS-SIGNED          00455000
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00455100
                                    WS-DISPLAY-AMT(WS-SUB-DISPLAY)      00455200
                           ELSE                                         00455300
                               MOVE WS-AMOUNT-9-2 TO REVAMT5O           00455400
                                                     TRX-UPD-NEW-VALUE  00455500
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00455600
                                 TO WS-AMOUNT-9-2                       00455700
                               MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE  00455800
                               MOVE WS-AMOUNT-NO-COMMAS                 00455900
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00456000
                                    WS-DISPLAY-REV(WS-SUB-DISPLAY)      00456100
                           END-IF                                       00456200
                           PERFORM 4600-HOLD-TRX THRU 4600-EXIT         00456300
                   ELSE                                                 00456400
                       MOVE 'E715' TO WS-MESSAGE-CODE-HOLD              00456500
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00456600
                       MOVE -1 TO REVAMT5L                              00456700
                       MOVE RED-COLOR TO REVAMT5C                       00456800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00456900
                                                                        00457000
            IF RC5L > ZERO                                              00457100
                MOVE RC5I TO WS-EDIT-RC                                 00457200
                IF WS-VALID-RC                                          00457300
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00457400
                   MOVE 'RC -  5' TO TRX-UPD-FIELD-NAME                 00457500
                   MOVE DE-REAS-CODE(WS-SUB-COV) TO TRX-UPD-OLD-VALUE   00457600
                   MOVE RC5I TO DE-REAS-CODE(WS-SUB-COV)                00457700
                                WS-DISPLAY-RC(WS-SUB-DISPLAY)           00457800
                                TRX-UPD-NEW-VALUE                       00457900
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00458000
               ELSE                                                     00458100
                   MOVE 'E723' TO WS-MESSAGE-CODE-HOLD                  00458200
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00458300
                   MOVE -1 TO RC5L                                      00458400
                   MOVE RED-COLOR TO RC5C                               00458500
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00458600
                                                                        00458700
       2718-5-EXIT.                                                     00458800
           EXIT.                                                        00458900
       EJECT                                                            00459000
       2718-6-PERFORM-UPDATE.                                           00459100
                                                                        00459200
           MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB-COV.         00459300
                                                                        00459400
           IF STATUS6L > ZERO                                           00459500
               MOVE STATUS6I TO WS-EDIT-CLM-STS                         00459600
               IF WS-VALID-CLM-STS                                      00459700
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00459800
                   MOVE 'STS - 6' TO TRX-UPD-FIELD-NAME                 00459900
                   MOVE DE-STS(WS-SUB-COV)                              00460000
                     TO TRX-UPD-OLD-VALUE                               00460100
                   MOVE STATUS6I                                        00460200
                     TO DE-STS(WS-SUB-COV)                              00460300
                        WS-DISPLAY-STS(WS-SUB-DISPLAY)                  00460400
                   MOVE DE-STS(WS-SUB-COV)                              00460500
                     TO TRX-UPD-NEW-VALUE                               00460600
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00460700
               ELSE                                                     00460800
                   MOVE 'E700' TO WS-MESSAGE-CODE-HOLD                  00460900
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00461000
                   MOVE -1 TO STATUS6L                                  00461100
                   MOVE RED-COLOR TO STATUS6C                           00461200
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00461300
                                                                        00461400
           IF TITLE6L > ZERO                                            00461500
               MOVE TITLE6I TO WS-EDIT-COVERAGE                         00461600
               IF WS-VALID-NON-COV                                      00461700
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00461800
                   MOVE 'NON-COV - 6' TO TRX-UPD-FIELD-NAME             00461900
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00462000
                     TO TRX-UPD-OLD-VALUE                               00462100
                   MOVE TITLE6I                                         00462200
                     TO DE-PLAN-CODE(WS-SUB-COV)                        00462300
                        WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY)             00462400
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00462500
                     TO TRX-UPD-NEW-VALUE                               00462600
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00462700
               ELSE                                                     00462800
                   MOVE 'EC36' TO WS-MESSAGE-CODE-HOLD                  00462900
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00463000
                   MOVE -1 TO TITLE6L                                   00463100
                   MOVE RED-COLOR TO TITLE6C                            00463200
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00463300
                                                                        00463400
           IF PROAMT6L > ZERO                                           00463500
               IF PROAMT6I = SPACES                                     00463600
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00463700
                   MOVE 'PROCEEDS AMT -6' TO TRX-UPD-FIELD-NAME         00463800
                   MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2         00463900
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00464000
                   MOVE ZEROES TO DE-BEN-AMT(WS-SUB-COV)                00464100
                                  WS-DISPLAY-AMT(WS-SUB-DISPLAY)        00464200
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00464300
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00464400
               ELSE                                                     00464500
                   MOVE PROAMT6I TO WS-AMOUNT-IN-AREA                   00464600
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00464700
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00464800
                   IF FIELD-IS-VALID                                    00464900
                       MOVE WS-TRX-UPD-REC TO TRX-UPD-REC               00465000
                       MOVE 'PROCEEDS AMT -6' TO                        00465100
                         TRX-UPD-FIELD-NAME                             00465200
                       IF WS-NEG-NON-COV                                00465300
                           MOVE WS-AMOUNT-9-2 TO PROAMT6O               00465400
                           MOVE '-' TO OPERTR6O                         00465500
                           MOVE WS-AMOUNT-9-2-SIGNED                    00465600
                             TO TRX-UPD-NEW-VALUE                       00465700
                           MOVE DE-BEN-AMT(WS-SUB-COV)                  00465800
                             TO WS-AMOUNT-9-2-SIGNED                    00465900
                           MOVE WS-AMOUNT-9-2-SIGNED                    00466000
                             TO TRX-UPD-OLD-VALUE                       00466100
                           MOVE WS-AMOUNT-NO-COMMAS-SIGNED              00466200
                             TO DE-BEN-AMT(WS-SUB-COV)                  00466300
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00466400
                       ELSE                                             00466500
                           MOVE WS-AMOUNT-9-2 TO PROAMT6O               00466600
                                                 TRX-UPD-NEW-VALUE      00466700
                           MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2 00466800
                           MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE      00466900
                           MOVE WS-AMOUNT-NO-COMMAS                     00467000
                             TO DE-BEN-AMT(WS-SUB-COV)                  00467100
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00467200
                       END-IF                                           00467300
                       PERFORM 4600-HOLD-TRX THRU 4600-EXIT             00467400
                   ELSE                                                 00467500
                       MOVE 'E708' TO WS-MESSAGE-CODE-HOLD              00467600
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00467700
                       MOVE -1 TO PROAMT6L                              00467800
                       MOVE RED-COLOR TO PROAMT6C                       00467900
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00468000
                                                                        00468100
           IF REVAMT6L > ZERO                                           00468200
               IF REVAMT6I = SPACES                                     00468300
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00468400
                   IF DE-REV                                            00468500
                       MOVE 'REV AMT - 6' TO TRX-UPD-FIELD-NAME         00468600
                   ELSE                                                 00468700
                       MOVE 'ADJ AMT - 6' TO TRX-UPD-FIELD-NAME         00468800
                   END-IF                                               00468900
                   MOVE DE-BEN-AMT-REV(WS-SUB-COV) TO WS-AMOUNT-9-2     00469000
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00469100
                   MOVE ZEROES TO DE-BEN-AMT-REV(WS-SUB-COV)            00469200
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00469300
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00469400
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00469500
               ELSE                                                     00469600
                   MOVE REVAMT6I TO WS-AMOUNT-IN-AREA                   00469700
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00469800
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00469900
                   IF FIELD-IS-VALID                                    00470000
                       IF DE-REV AND                                    00470100
                         ((WS-NEG-NON-COV AND                           00470200
                           (WS-AMOUNT-NO-COMMAS-SIGNED                  00470300
                            < DE-BEN-AMT(WS-SUB-COV)))   OR             00470400
                          ((NOT WS-NEG-NON-COV) AND                     00470500
                           (WS-AMOUNT-NO-COMMAS                         00470600
                            > DE-BEN-AMT(WS-SUB-COV))))                 00470700
                           MOVE 'E842' TO WS-MESSAGE-CODE-HOLD          00470800
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00470900
                           MOVE -1 TO REVAMT6L                          00471000
                           MOVE RED-COLOR TO REVAMT6C                   00471100
                           MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG            00471200
                       ELSE                                             00471300
                           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC           00471400
                           IF DE-REV                                    00471500
                               MOVE 'REV AMT - 6' TO TRX-UPD-FIELD-NAME 00471600
                           ELSE                                         00471700
                               MOVE 'ADJ AMT - 6' TO TRX-UPD-FIELD-NAME 00471800
                           END-IF                                       00471900
                           IF WS-NEG-NON-COV                            00472000
                               MOVE WS-AMOUNT-9-2 TO REVAMT6O           00472100
                               MOVE '-' TO OPERTR6O                     00472200
                               MOVE WS-AMOUNT-9-2-SIGNED                00472300
                                 TO TRX-UPD-NEW-VALUE                   00472400
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00472500
                                 TO WS-AMOUNT-9-2-SIGNED                00472600
                               MOVE WS-AMOUNT-9-2-SIGNED                00472700
                                 TO TRX-UPD-OLD-VALUE                   00472800
                               MOVE WS-AMOUNT-NO-COMMAS-SIGNED          00472900
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00473000
                                    WS-DISPLAY-AMT(WS-SUB-DISPLAY)      00473100
                           ELSE                                         00473200
                               MOVE WS-AMOUNT-9-2 TO REVAMT6O           00473300
                                                     TRX-UPD-NEW-VALUE  00473400
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00473500
                                 TO WS-AMOUNT-9-2                       00473600
                               MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE  00473700
                               MOVE WS-AMOUNT-NO-COMMAS                 00473800
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00473900
                                    WS-DISPLAY-REV(WS-SUB-DISPLAY)      00474000
                           END-IF                                       00474100
                           PERFORM 4600-HOLD-TRX THRU 4600-EXIT         00474200
                   ELSE                                                 00474300
                       MOVE 'E716' TO WS-MESSAGE-CODE-HOLD              00474400
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00474500
                       MOVE -1 TO REVAMT6L                              00474600
                       MOVE RED-COLOR TO REVAMT6C                       00474700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00474800
                                                                        00474900
            IF RC6L > ZERO                                              00475000
                MOVE RC6I TO WS-EDIT-RC                                 00475100
                IF WS-VALID-RC                                          00475200
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00475300
                   MOVE 'RC -  6' TO TRX-UPD-FIELD-NAME                 00475400
                   MOVE DE-REAS-CODE(WS-SUB-COV) TO TRX-UPD-OLD-VALUE   00475500
                   MOVE RC6I TO DE-REAS-CODE(WS-SUB-COV)                00475600
                                WS-DISPLAY-RC(WS-SUB-DISPLAY)           00475700
                                TRX-UPD-NEW-VALUE                       00475800
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00475900
               ELSE                                                     00476000
                   MOVE 'E724' TO WS-MESSAGE-CODE-HOLD                  00476100
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00476200
                   MOVE -1 TO RC6L                                      00476300
                   MOVE RED-COLOR TO RC6C                               00476400
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00476500
                                                                        00476600
       2718-6-EXIT.                                                     00476700
           EXIT.                                                        00476800
       EJECT                                                            00476900
       2718-7-PERFORM-UPDATE.                                           00477000
                                                                        00477100
           MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB-COV.         00477200
                                                                        00477300
           IF STATUS7L > ZERO                                           00477400
               MOVE STATUS7I TO WS-EDIT-CLM-STS                         00477500
               IF WS-VALID-CLM-STS                                      00477600
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00477700
                   MOVE 'STS - 7' TO TRX-UPD-FIELD-NAME                 00477800
                   MOVE DE-STS(WS-SUB-COV)                              00477900
                     TO TRX-UPD-OLD-VALUE                               00478000
                   MOVE STATUS7I                                        00478100
                     TO DE-STS(WS-SUB-COV)                              00478200
                        WS-DISPLAY-STS(WS-SUB-DISPLAY)                  00478300
                   MOVE DE-STS(WS-SUB-COV)                              00478400
                     TO TRX-UPD-NEW-VALUE                               00478500
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00478600
               ELSE                                                     00478700
                   MOVE 'E701' TO WS-MESSAGE-CODE-HOLD                  00478800
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00478900
                   MOVE -1 TO STATUS7L                                  00479000
                   MOVE RED-COLOR TO STATUS7C                           00479100
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00479200
                                                                        00479300
           IF TITLE7L > ZERO                                            00479400
               MOVE TITLE7I TO WS-EDIT-COVERAGE                         00479500
               IF WS-VALID-NON-COV                                      00479600
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00479700
                   MOVE 'NON-COV - 7' TO TRX-UPD-FIELD-NAME             00479800
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00479900
                     TO TRX-UPD-OLD-VALUE                               00480000
                   MOVE TITLE7I                                         00480100
                     TO DE-PLAN-CODE(WS-SUB-COV)                        00480200
                        WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY)             00480300
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00480400
                     TO TRX-UPD-NEW-VALUE                               00480500
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00480600
               ELSE                                                     00480700
                   MOVE 'EC37' TO WS-MESSAGE-CODE-HOLD                  00480800
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00480900
                   MOVE -1 TO TITLE7L                                   00481000
                   MOVE RED-COLOR TO TITLE7C                            00481100
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00481200
                                                                        00481300
           IF PROAMT7L > ZERO                                           00481400
               IF PROAMT7I = SPACES                                     00481500
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00481600
                   MOVE 'PROCEEDS AMT -7' TO TRX-UPD-FIELD-NAME         00481700
                   MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2         00481800
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00481900
                   MOVE ZEROES TO DE-BEN-AMT(WS-SUB-COV)                00482000
                                  WS-DISPLAY-AMT(WS-SUB-DISPLAY)        00482100
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00482200
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00482300
               ELSE                                                     00482400
                   MOVE PROAMT7I TO WS-AMOUNT-IN-AREA                   00482500
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00482600
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00482700
                   IF FIELD-IS-VALID                                    00482800
                       MOVE WS-TRX-UPD-REC TO TRX-UPD-REC               00482900
                       MOVE 'PROCEEDS AMT -7' TO                        00483000
                         TRX-UPD-FIELD-NAME                             00483100
                       IF WS-NEG-NON-COV                                00483200
                           MOVE WS-AMOUNT-9-2 TO PROAMT7O               00483300
                           MOVE '-' TO OPERTR7O                         00483400
                           MOVE WS-AMOUNT-9-2-SIGNED                    00483500
                             TO TRX-UPD-NEW-VALUE                       00483600
                           MOVE DE-BEN-AMT(WS-SUB-COV)                  00483700
                             TO WS-AMOUNT-9-2-SIGNED                    00483800
                           MOVE WS-AMOUNT-9-2-SIGNED                    00483900
                             TO TRX-UPD-OLD-VALUE                       00484000
                           MOVE WS-AMOUNT-NO-COMMAS-SIGNED              00484100
                             TO DE-BEN-AMT(WS-SUB-COV)                  00484200
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00484300
                       ELSE                                             00484400
                           MOVE WS-AMOUNT-9-2 TO PROAMT7O               00484500
                                                 TRX-UPD-NEW-VALUE      00484600
                           MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2 00484700
                           MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE      00484800
                           MOVE WS-AMOUNT-NO-COMMAS                     00484900
                             TO DE-BEN-AMT(WS-SUB-COV)                  00485000
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00485100
                       END-IF                                           00485200
                       PERFORM 4600-HOLD-TRX THRU 4600-EXIT             00485300
                   ELSE                                                 00485400
                       MOVE 'E709' TO WS-MESSAGE-CODE-HOLD              00485500
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00485600
                       MOVE -1 TO PROAMT7L                              00485700
                       MOVE RED-COLOR TO PROAMT7C                       00485800
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00485900
                                                                        00486000
           IF REVAMT7L > ZERO                                           00486100
               IF REVAMT7I = SPACES                                     00486200
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00486300
                   IF DE-REV                                            00486400
                       MOVE 'REV AMT - 7' TO TRX-UPD-FIELD-NAME         00486500
                   ELSE                                                 00486600
                       MOVE 'ADJ AMT - 7' TO TRX-UPD-FIELD-NAME         00486700
                   END-IF                                               00486800
                   MOVE DE-BEN-AMT-REV(WS-SUB-COV) TO WS-AMOUNT-9-2     00486900
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00487000
                   MOVE ZEROES TO DE-BEN-AMT-REV(WS-SUB-COV)            00487100
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00487200
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00487300
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00487400
               ELSE                                                     00487500
                   MOVE REVAMT7I TO WS-AMOUNT-IN-AREA                   00487600
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00487700
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00487800
                   IF FIELD-IS-VALID                                    00487900
                       IF DE-REV AND                                    00488000
                         ((WS-NEG-NON-COV AND                           00488100
                           (WS-AMOUNT-NO-COMMAS-SIGNED                  00488200
                            < DE-BEN-AMT(WS-SUB-COV)))   OR             00488300
                          ((NOT WS-NEG-NON-COV) AND                     00488400
                           (WS-AMOUNT-NO-COMMAS                         00488500
                            > DE-BEN-AMT(WS-SUB-COV))))                 00488600
                           MOVE 'E843' TO WS-MESSAGE-CODE-HOLD          00488700
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00488800
                           MOVE -1 TO REVAMT7L                          00488900
                           MOVE RED-COLOR TO REVAMT7C                   00489000
                           MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG            00489100
                       ELSE                                             00489200
                           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC           00489300
                           IF DE-REV                                    00489400
                               MOVE 'REV AMT - 7' TO TRX-UPD-FIELD-NAME 00489500
                           ELSE                                         00489600
                               MOVE 'ADJ AMT - 7' TO TRX-UPD-FIELD-NAME 00489700
                           END-IF                                       00489800
                           IF WS-NEG-NON-COV                            00489900
                               MOVE WS-AMOUNT-9-2 TO REVAMT7O           00490000
                               MOVE '-' TO OPERTR7O                     00490100
                               MOVE WS-AMOUNT-9-2-SIGNED                00490200
                                 TO TRX-UPD-NEW-VALUE                   00490300
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00490400
                                 TO WS-AMOUNT-9-2-SIGNED                00490500
                               MOVE WS-AMOUNT-9-2-SIGNED                00490600
                                 TO TRX-UPD-OLD-VALUE                   00490700
                               MOVE WS-AMOUNT-NO-COMMAS-SIGNED          00490800
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00490900
                                    WS-DISPLAY-AMT(WS-SUB-DISPLAY)      00491000
                           ELSE                                         00491100
                             MOVE WS-AMOUNT-9-2 TO REVAMT7O             00491200
                                                   TRX-UPD-NEW-VALUE    00491300
                             MOVE DE-BEN-AMT-REV(WS-SUB-COV)            00491400
                               TO WS-AMOUNT-9-2                         00491500
                             MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE    00491600
                             MOVE WS-AMOUNT-NO-COMMAS                   00491700
                               TO DE-BEN-AMT-REV(WS-SUB-COV)            00491800
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00491900
                           END-IF                                       00492000
                           PERFORM 4600-HOLD-TRX THRU 4600-EXIT         00492100
                   ELSE                                                 00492200
                       MOVE 'E717' TO WS-MESSAGE-CODE-HOLD              00492300
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00492400
                       MOVE -1 TO REVAMT7L                              00492500
                       MOVE RED-COLOR TO REVAMT7C                       00492600
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00492700
                                                                        00492800
            IF RC7L > ZERO                                              00492900
                MOVE RC7I TO WS-EDIT-RC                                 00493000
                IF WS-VALID-RC                                          00493100
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00493200
                   MOVE 'RC -  7' TO TRX-UPD-FIELD-NAME                 00493300
                   MOVE DE-REAS-CODE(WS-SUB-COV) TO TRX-UPD-OLD-VALUE   00493400
                   MOVE RC7I TO DE-REAS-CODE(WS-SUB-COV)                00493500
                                WS-DISPLAY-RC(WS-SUB-DISPLAY)           00493600
                                TRX-UPD-NEW-VALUE                       00493700
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00493800
               ELSE                                                     00493900
                   MOVE 'E725' TO WS-MESSAGE-CODE-HOLD                  00494000
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00494100
                   MOVE -1 TO RC7L                                      00494200
                   MOVE RED-COLOR TO RC7C                               00494300
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00494400
                                                                        00494500
       2718-7-EXIT.                                                     00494600
           EXIT.                                                        00494700
       EJECT                                                            00494800
       2718-8-PERFORM-UPDATE.                                           00494900
                                                                        00495000
           MOVE WS-DISPLAY-OCCUR(WS-SUB-DISPLAY) TO WS-SUB-COV.         00495100
                                                                        00495200
           IF STATUS8L > ZERO                                           00495300
               MOVE STATUS8I TO WS-EDIT-CLM-STS                         00495400
               IF WS-VALID-CLM-STS                                      00495500
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00495600
                   MOVE 'STS - 8' TO TRX-UPD-FIELD-NAME                 00495700
                   MOVE DE-STS(WS-SUB-COV)                              00495800
                     TO TRX-UPD-OLD-VALUE                               00495900
                   MOVE STATUS8I                                        00496000
                     TO DE-STS(WS-SUB-COV)                              00496100
                        WS-DISPLAY-STS(WS-SUB-DISPLAY)                  00496200
                   MOVE DE-STS(WS-SUB-COV)                              00496300
                     TO TRX-UPD-NEW-VALUE                               00496400
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00496500
               ELSE                                                     00496600
                   MOVE 'E702' TO WS-MESSAGE-CODE-HOLD                  00496700
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00496800
                   MOVE -1 TO STATUS8L                                  00496900
                   MOVE RED-COLOR TO STATUS8C                           00497000
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00497100
                                                                        00497200
           IF TITLE8L > ZERO                                            00497300
               MOVE TITLE8I TO WS-EDIT-COVERAGE                         00497400
               IF WS-VALID-NON-COV                                      00497500
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00497600
                   MOVE 'NON-COV - 8' TO TRX-UPD-FIELD-NAME             00497700
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00497800
                     TO TRX-UPD-OLD-VALUE                               00497900
                   MOVE TITLE8I                                         00498000
                     TO DE-PLAN-CODE(WS-SUB-COV)                        00498100
                        WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY)             00498200
                   MOVE DE-PLAN-CODE(WS-SUB-COV)                        00498300
                     TO TRX-UPD-NEW-VALUE                               00498400
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00498500
               ELSE                                                     00498600
                   MOVE 'EC38' TO WS-MESSAGE-CODE-HOLD                  00498700
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00498800
                   MOVE -1 TO TITLE8L                                   00498900
                   MOVE RED-COLOR TO TITLE8C                            00499000
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00499100
                                                                        00499200
           IF PROAMT8L > ZERO                                           00499300
               IF PROAMT8I = SPACES                                     00499400
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00499500
                   MOVE 'PROCEEDS AMT -8' TO TRX-UPD-FIELD-NAME         00499600
                   MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2         00499700
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00499800
                   MOVE ZEROES TO DE-BEN-AMT(WS-SUB-COV)                00499900
                                  WS-DISPLAY-AMT(WS-SUB-DISPLAY)        00500000
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00500100
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00500200
               ELSE                                                     00500300
                   MOVE PROAMT8I TO WS-AMOUNT-IN-AREA                   00500400
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00500500
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00500600
                   IF FIELD-IS-VALID                                    00500700
                       MOVE WS-TRX-UPD-REC TO TRX-UPD-REC               00500800
                       MOVE 'PROCEEDS AMT -8' TO                        00500900
                         TRX-UPD-FIELD-NAME                             00501000
                       IF WS-NEG-NON-COV                                00501100
                           MOVE WS-AMOUNT-9-2 TO PROAMT8O               00501200
                           MOVE '-' TO OPERTR8O                         00501300
                           MOVE WS-AMOUNT-9-2-SIGNED                    00501400
                             TO TRX-UPD-NEW-VALUE                       00501500
                           MOVE DE-BEN-AMT(WS-SUB-COV)                  00501600
                             TO WS-AMOUNT-9-2-SIGNED                    00501700
                           MOVE WS-AMOUNT-9-2-SIGNED                    00501800
                             TO TRX-UPD-OLD-VALUE                       00501900
                           MOVE WS-AMOUNT-NO-COMMAS-SIGNED              00502000
                             TO DE-BEN-AMT(WS-SUB-COV)                  00502100
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00502200
                       ELSE                                             00502300
                           MOVE WS-AMOUNT-9-2 TO PROAMT8O               00502400
                                                 TRX-UPD-NEW-VALUE      00502500
                           MOVE DE-BEN-AMT(WS-SUB-COV) TO WS-AMOUNT-9-2 00502600
                           MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE      00502700
                           MOVE WS-AMOUNT-NO-COMMAS                     00502800
                             TO DE-BEN-AMT(WS-SUB-COV)                  00502900
                                WS-DISPLAY-AMT(WS-SUB-DISPLAY)          00503000
                       END-IF                                           00503100
                       PERFORM 4600-HOLD-TRX THRU 4600-EXIT             00503200
                   ELSE                                                 00503300
                       MOVE 'E710' TO WS-MESSAGE-CODE-HOLD              00503400
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00503500
                       MOVE -1 TO PROAMT8L                              00503600
                       MOVE RED-COLOR TO PROAMT8C                       00503700
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00503800
                                                                        00503900
           IF REVAMT8L > ZERO                                           00504000
               IF REVAMT8I = SPACES                                     00504100
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00504200
                   IF DE-REV                                            00504300
                       MOVE 'REV AMT - 8' TO TRX-UPD-FIELD-NAME         00504400
                   ELSE                                                 00504500
                       MOVE 'ADJ AMT - 8' TO TRX-UPD-FIELD-NAME         00504600
                   END-IF                                               00504700
                   MOVE DE-BEN-AMT-REV(WS-SUB-COV) TO WS-AMOUNT-9-2     00504800
                   MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE              00504900
                   MOVE ZEROES TO DE-BEN-AMT-REV(WS-SUB-COV)            00505000
                                  WS-DISPLAY-REV(WS-SUB-DISPLAY)        00505100
                   MOVE SPACES TO TRX-UPD-NEW-VALUE                     00505200
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00505300
               ELSE                                                     00505400
                   MOVE REVAMT8I TO WS-AMOUNT-IN-AREA                   00505500
                   MOVE DE-PLAN-CODE(WS-SUB-COV) TO WS-EDIT-COVERAGE    00505600
                   PERFORM 2777-EDIT-AMOUNT THRU 2777-EXIT              00505700
                   IF FIELD-IS-VALID                                    00505800
                       IF DE-REV AND                                    00505900
                         ((WS-NEG-NON-COV AND                           00506000
                           (WS-AMOUNT-NO-COMMAS-SIGNED                  00506100
                            < DE-BEN-AMT(WS-SUB-COV)))   OR             00506200
                          ((NOT WS-NEG-NON-COV) AND                     00506300
                           (WS-AMOUNT-NO-COMMAS                         00506400
                            > DE-BEN-AMT(WS-SUB-COV))))                 00506500
                           MOVE 'E844' TO WS-MESSAGE-CODE-HOLD          00506600
                           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT00506700
                           MOVE -1 TO REVAMT8L                          00506800
                           MOVE RED-COLOR TO REVAMT8C                   00506900
                           MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG            00507000
                       ELSE                                             00507100
                           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC           00507200
                           IF DE-REV                                    00507300
                               MOVE 'REV AMT - 8' TO TRX-UPD-FIELD-NAME 00507400
                           ELSE                                         00507500
                               MOVE 'ADJ AMT - 8' TO TRX-UPD-FIELD-NAME 00507600
                           END-IF                                       00507700
                           IF WS-NEG-NON-COV                            00507800
                               MOVE WS-AMOUNT-9-2 TO REVAMT8O           00507900
                               MOVE '-' TO OPERTR8O                     00508000
                               MOVE WS-AMOUNT-9-2-SIGNED                00508100
                                 TO TRX-UPD-NEW-VALUE                   00508200
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00508300
                                 TO WS-AMOUNT-9-2-SIGNED                00508400
                               MOVE WS-AMOUNT-9-2-SIGNED                00508500
                                 TO TRX-UPD-OLD-VALUE                   00508600
                               MOVE WS-AMOUNT-NO-COMMAS-SIGNED          00508700
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00508800
                                    WS-DISPLAY-AMT(WS-SUB-DISPLAY)      00508900
                           ELSE                                         00509000
                               MOVE WS-AMOUNT-9-2 TO REVAMT8O           00509100
                                                     TRX-UPD-NEW-VALUE  00509200
                               MOVE DE-BEN-AMT-REV(WS-SUB-COV)          00509300
                                 TO WS-AMOUNT-9-2                       00509400
                               MOVE WS-AMOUNT-9-2 TO TRX-UPD-OLD-VALUE  00509500
                               MOVE WS-AMOUNT-NO-COMMAS                 00509600
                                 TO DE-BEN-AMT-REV(WS-SUB-COV)          00509700
                                    WS-DISPLAY-REV(WS-SUB-DISPLAY)      00509800
                           END-IF                                       00509900
                           PERFORM 4600-HOLD-TRX THRU 4600-EXIT         00510000
                   ELSE                                                 00510100
                       MOVE 'E718' TO WS-MESSAGE-CODE-HOLD              00510200
                       PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT    00510300
                       MOVE -1 TO REVAMT8L                              00510400
                       MOVE RED-COLOR TO REVAMT8C                       00510500
                       MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.               00510600
                                                                        00510700
            IF RC8L > ZERO                                              00510800
                MOVE RC8I TO WS-EDIT-RC                                 00510900
                IF WS-VALID-RC                                          00511000
                   MOVE WS-TRX-UPD-REC TO TRX-UPD-REC                   00511100
                   MOVE 'RC -  8' TO TRX-UPD-FIELD-NAME                 00511200
                   MOVE DE-REAS-CODE(WS-SUB-COV) TO TRX-UPD-OLD-VALUE   00511300
                   MOVE RC8I TO DE-REAS-CODE(WS-SUB-COV)                00511400
                                WS-DISPLAY-RC(WS-SUB-DISPLAY)           00511500
                                TRX-UPD-NEW-VALUE                       00511600
                   PERFORM 4600-HOLD-TRX THRU 4600-EXIT                 00511700
               ELSE                                                     00511800
                   MOVE 'E726' TO WS-MESSAGE-CODE-HOLD                  00511900
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00512000
                   MOVE -1 TO RC8L                                      00512100
                   MOVE RED-COLOR TO RC8C                               00512200
                   MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG.                   00512300
                                                                        00512400
       2718-8-EXIT.                                                     00512500
           EXIT.                                                        00512600
       EJECT                                                            00512700
      ***********************************************************       00512800
      *          E D I T   A M O U N T   F I E L D              *       00512900
      ***********************************************************       00513000
       2777-EDIT-AMOUNT.                                                00513100
                                                                        00513200
      *  INITIALIZE ERROR SWITCH                                        00513300
           MOVE 0 TO WS-FIELD-RESULT-SWITCH.                            00513400
                                                                        00513500
      *  CHECK FOR ONE AND ONLY ONE DECIMAL                             00513600
           INITIALIZE WS-TALLY.                                         00513700
           INSPECT WS-AMOUNT-IN-AREA TALLYING WS-TALLY FOR ALL '.'.     00513800
           IF WS-TALLY NOT = 1                                          00513900
               COMPUTE WS-FIELD-RESULT-SWITCH = 1                       00514000
               GO TO 2777-EXIT.                                         00514100
                                                                        00514200
      *  CHANGE ANY SPACES TO ZERO                                      00514300
           INSPECT WS-AMOUNT-IN-AREA REPLACING ALL SPACES BY '0'.       00514400
                                                                        00514500
      *  IF THE DECIMAL IS ALREADY POSITIONED, GO AHEAD AND MOVE        00514600
           INITIALIZE WS-TALLY.                                         00514700
           IF WS-AMOUNT-IN-SINGLE(12) = '.'                             00514800
               INSPECT WS-AMOUNT-IN-AREA TALLYING WS-TALLY FOR ALL ','  00514900
               IF WS-TALLY > 0                                          00515000
                   MOVE WS-AMOUNT-IN-1 TO WS-AMOUNT-1                   00515100
                   MOVE WS-AMOUNT-IN-2 TO WS-AMOUNT-2                   00515200
                   MOVE WS-AMOUNT-IN-3 TO WS-AMOUNT-3                   00515300
                   MOVE WS-AMOUNT-IN-4 TO WS-AMOUNT-4                   00515400
               ELSE                                                     00515500
                   MOVE WS-AMOUNT-IN-AREA TO WS-AMOUNT-ONLY-DECIMAL     00515600
                   MOVE WS-AMOUNT-OD-1 TO WS-AMOUNT-1                   00515700
                   MOVE WS-AMOUNT-OD-2 TO WS-AMOUNT-2                   00515800
                   MOVE WS-AMOUNT-OD-3 TO WS-AMOUNT-3                   00515900
                   MOVE WS-AMOUNT-OD-4 TO WS-AMOUNT-4.                  00516000
                                                                        00516100
      *  FIND THE DECIMAL                                               00516200
           MOVE SPACES TO WS-END-FLAG.                                  00516300
           PERFORM 2778-FIND-DECIMAL THRU 2778-EXIT                     00516400
               VARYING WS-SUB FROM +1 BY +1                             00516500
               UNTIL WS-END.                                            00516600
           COMPUTE WS-SUB = WS-SUB - 1.                                 00516700
                                                                        00516800
      *  IF THE DECIMAL IS IN THE LAST TWO PLACES, THEN THE ENTERED     00516900
      *   AMOUNT IS TOO LARGE, SEND ERROR                               00517000
           IF WS-SUB = 13 OR 14                                         00517100
               COMPUTE WS-FIELD-RESULT-SWITCH = 1                       00517200
               GO TO 2777-EXIT.                                         00517300
                                                                        00517400
      *  POSITION VALUE IN NO-COMMA FIELD                               00517500
           MOVE +0 TO WS-AMOUNT-NO-COMMAS.                              00517600
           COMPUTE WS-SUB-2 = WS-SUB + 2.                               00517700
           COMPUTE WS-SUB-3 = 11.                                       00517800
           PERFORM 2779-POSITION-FIELD THRU 2779-EXIT                   00517900
               VARYING WS-SUB FROM WS-SUB-2 BY -1                       00518000
               UNTIL WS-SUB = 0.                                        00518100
                                                                        00518200
      *  CHECK FOR NUMERICS                                             00518300
           IF WS-AMOUNT-NO-COMMAS NOT NUMERIC                           00518400
               COMPUTE WS-FIELD-RESULT-SWITCH = 1                       00518500
               GO TO 2777-EXIT.                                         00518600
                                                                        00518700
      *  SET OUTPUT FIELDS                                              00518800
      *  IF NEGATIVE NON-COV VALUE, MULTIPLE BY -1                      00518900
           IF WS-NEG-NON-COV                                            00519000
               COMPUTE WS-AMOUNT-NO-COMMAS-SIGNED =                     00519100
                   WS-AMOUNT-NO-COMMAS * -1                             00519200
           ELSE                                                         00519300
               COMPUTE WS-AMOUNT-NO-COMMAS-SIGNED =                     00519400
                   WS-AMOUNT-NO-COMMAS * +1.                            00519500
           MOVE WS-AMOUNT-NO-COMMAS-SIGNED TO WS-AMOUNT-9-2             00519600
                                              WS-AMOUNT-9-2-SIGNED.     00519700
                                                                        00519800
       2777-EXIT.                                                       00519900
           EXIT.                                                        00520000
                                                                        00520100
                                                                        00520200
       2778-FIND-DECIMAL.                                               00520300
                                                                        00520400
           IF WS-AMOUNT-IN-SINGLE(WS-SUB) = '.'                         00520500
               MOVE 'Y' TO WS-END-FLAG.                                 00520600
                                                                        00520700
       2778-EXIT.                                                       00520800
           EXIT.                                                        00520900
                                                                        00521000
                                                                        00521100
       2779-POSITION-FIELD.                                             00521200
                                                                        00521300
           IF WS-AMOUNT-IN-SINGLE(WS-SUB) NOT = ',' AND '.'             00521400
               MOVE WS-AMOUNT-IN-SINGLE(WS-SUB)                         00521500
                 TO WS-AMOUNT-SINGLE(WS-SUB-3)                          00521600
               SUBTRACT +1 FROM WS-SUB-3.                               00521700
                                                                        00521800
       2779-EXIT.                                                       00521900
           EXIT.                                                        00522000
       EJECT                                                            00522100
      ***********************************************************       00522200
      *               A D D   N E W   R E C O R D               *       00522300
      ***********************************************************       00522400
       2780-ADD-NEW-RECORD.                                             00522500
                                                                        00522600
      *  SET RECORD ID                                                  00522700
           MOVE 'DE' TO DE-REC-ID.                                      00522800
                                                                        00522900
      *  SET ADD DATE                                                   00523000
           MOVE CA-SYSTEM-DATE TO DE-REC-ADD-DT.                        00523100
                                                                        00523200
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00523300
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00523400
                                                                        00523500
      *   FIND THE LAST PAYMENT RECORD                                  00523600
           MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM.                          00523700
           MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM.                        00523800
           MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM.                        00523900
           MOVE '50' TO CA-AK-REC-CODE.                                 00524000
           MOVE '001' TO CA-AK-REC-NUM.                                 00524100
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00524200
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00524300
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00524400
           MOVE SPACES TO WS-END-FLAG.                                  00524500
           MOVE 'RN' TO CA-ACCESS-TYPE.                                 00524600
           MOVE CA-PREV-PAGE-NUM TO WS-BUILD-PAGE-IND.                  00524700
           PERFORM 2781-GET-LAST-RECORD THRU 2781-EXIT                  00524800
               UNTIL WS-END.                                            00524900
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00525000
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00525100
           MOVE CA-ITEM-NUM TO WS-DE-ITEM-NUM.                          00525200
           IF WS-FIRST-PYMT                                             00525300
               MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                       00525400
               MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM                     00525500
               MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM                     00525600
               MOVE '50' TO CA-AK-REC-CODE                              00525700
               MOVE '001' TO CA-AK-REC-NUM                              00525800
           ELSE                                                         00525900
               MOVE WS-HOLD-KEY TO CA-AK-FILE-KEY                       00526000
               ADD +1 TO CA-AK-REC-NUM.                                 00526100
                                                                        00526200
      *  WRITE NEW RECORD TO TS                                         00526300
           MOVE 'WT' TO CA-ACCESS-TYPE.                                 00526400
           MOVE CA-AK-FILE-KEY TO WS-RECORD-KEY                         00526500
                                  WS-DISPLAYED-RECORD-KEY.              00526600
           MOVE DE-INFO TO WS-RECORD-INFO.                              00526700
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00526800
           IF WS-DE-ITEM-NUM > 0                                        00526900
               PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT             00527000
           ELSE                                                         00527100
               PERFORM 4920-WRITE-TS-QUEUE THRU 4920-EXIT.              00527200
                                                                        00527300
           MOVE CA-ITEM-NUM TO WS-DE-ITEM-NUM.                          00527400
                                                                        00527500
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00527600
                                                                        00527700
           MOVE 'I009' TO WS-MESSAGE-CODE-HOLD.                         00527800
           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.               00527900
                                                                        00528000
      *  ADD TRX REG RECORD FOR AN ADD                                  00528100
           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC.                          00528200
           IF DE-REV                                                    00528300
               MOVE ' ADD/REV       ' TO TRX-UPD-TYPE                   00528400
           ELSE IF DE-ADJ                                               00528500
               MOVE ' ADD/ADJ       ' TO TRX-UPD-TYPE                   00528600
           ELSE                                                         00528700
               MOVE ' ADD           ' TO TRX-UPD-TYPE.                  00528800
           MOVE CA-AK-FILE-KEY TO TRX-UPD-ADD-KEY.                      00528900
           PERFORM 4600-HOLD-TRX THRU 4600-EXIT.                        00529000
                                                                        00529100
       2780-EXIT.                                                       00529200
           EXIT.                                                        00529300
       EJECT                                                            00529400
       2781-GET-LAST-RECORD.                                            00529500
                                                                        00529600
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00529700
                                                                        00529800
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00529900
                                                                        00530000
           MOVE WS-RECORD-KEY TO AK-MST-KEY.                            00530100
                                                                        00530200
           IF (AK-CLM-NUM = CA-EST-CLM-NUM) AND (AK-PYMT-REC)           00530300
               MOVE AK-MST-KEY TO WS-HOLD-KEY                           00530400
               MOVE 'N' TO WS-FIRST-PYMT-FLAG                           00530500
           ELSE                                                         00530600
               MOVE 'Y' TO WS-END-FLAG.                                 00530700
                                                                        00530800
       2781-EXIT.                                                       00530900
           EXIT.                                                        00531000
       EJECT                                                            00531100
      ***********************************************************       00531200
      *               R E W R I T E   R E C O R D               *       00531300
      ***********************************************************       00531400
       2790-REWRITE-RECORD.                                             00531500
                                                                        00531600
           PERFORM 2791-REWRITE-DE-RECORD THRU 2791-EXIT.               00531700
           PERFORM 2792-REWRITE-CL-RECORD THRU 2792-EXIT.               00531800
                                                                        00531900
       2790-EXIT.                                                       00532000
           EXIT.                                                        00532100
       EJECT                                                            00532200
       2791-REWRITE-DE-RECORD.                                          00532300
                                                                        00532400
      *  READ RECORD FOR UPDATE.                                        00532500
           MOVE 'RU' TO CA-ACCESS-TYPE.                                 00532600
           MOVE 'F' TO CA-READ-TYPE.                                    00532700
           MOVE WS-ORG-RECORD-DE-KEY TO CA-AK-FILE-KEY.                 00532800
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00532900
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00533000
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00533100
                                                                        00533200
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00533300
                                                                        00533400
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00533500
                                                                        00533600
      *  IF THE TS QUEUE CANNOT BE READ, UNLOCK THE RECORD              00533700
           IF WS-RESPONSE-CODE = DFHRESP(QIDERR)                        00533800
               EXEC CICS UNLOCK                                         00533900
                         DATASET('ACTMAST')                             00534000
               END-EXEC                                                 00534100
               MOVE 'E023' TO WS-MESSAGE-CODE-HOLD                      00534200
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00534300
               PERFORM 8000-SEND-PAGE                                   00534400
           ELSE                                                         00534500
               MOVE WS-RECORD TO WS-CUR-RECORD-DE.                      00534600
                                                                        00534700
      *  COMPARE ORIGINAL RECORD TO CUR RECORD                          00534800
           IF WS-ORG-RECORD-DE NOT = WS-CUR-RECORD-DE                   00534900
               EXEC CICS UNLOCK                                         00535000
                         DATASET('ACTMAST')                             00535100
               END-EXEC                                                 00535200
               MOVE WS-ORG-RECORD-CHANGED TO MESSAG1O                   00535300
               MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG                  00535400
               PERFORM 1100-BUILD-SCREEN.                               00535500
                                                                        00535600
      *  REWRITE MASTER RECORD                                          00535700
           MOVE 'RW' TO CA-ACCESS-TYPE.                                 00535800
           MOVE DE-INFO TO WS-RECORD-INFO.                              00535900
                                                                        00536000
           PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT.                00536100
                                                                        00536200
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00536300
                                                                        00536400
       2791-EXIT.                                                       00536500
           EXIT.                                                        00536600
       EJECT                                                            00536700
       2792-REWRITE-CL-RECORD.                                          00536800
                                                                        00536900
      *  UPDATE LAST ACTIVITY DATE                                      00537000
           IF CL-LAST-ACT-DT = CA-SYSTEM-DATE                           00537100
               GO TO 2792-EXIT                                          00537200
           ELSE                                                         00537300
               MOVE CA-SYSTEM-DATE TO CL-LAST-ACT-DT.                   00537400
                                                                        00537500
      *  READ RECORD FOR UPDATE.                                        00537600
           MOVE 'RU' TO CA-ACCESS-TYPE.                                 00537700
           MOVE 'F' TO CA-READ-TYPE.                                    00537800
           MOVE WS-ORG-RECORD-CL-KEY TO CA-AK-FILE-KEY.                 00537900
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00538000
           MOVE WS-CL-ITEM-NUM TO CA-ITEM-NUM.                          00538100
           MOVE WS-CL-RECORD-LENGTH TO CA-RECORD-LENGTH.                00538200
                                                                        00538300
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00538400
                                                                        00538500
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00538600
                                                                        00538700
      *  IF THE TS QUEUE CANNOT BE READ, UNLOCK THE RECORD              00538800
           IF WS-RESPONSE-CODE = DFHRESP(QIDERR)                        00538900
               EXEC CICS UNLOCK                                         00539000
                         DATASET('ACTMAST')                             00539100
               END-EXEC                                                 00539200
               MOVE 'E023' TO WS-MESSAGE-CODE-HOLD                      00539300
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00539400
               PERFORM 8000-SEND-PAGE                                   00539500
           ELSE                                                         00539600
               MOVE WS-RECORD TO WS-CUR-RECORD-CL.                      00539700
                                                                        00539800
      *  COMPARE ORIGINAL RECORD TO CUR RECORD                          00539900
           IF WS-ORG-RECORD-CL NOT = WS-CUR-RECORD-CL                   00540000
               EXEC CICS UNLOCK                                         00540100
                         DATASET('ACTMAST')                             00540200
               END-EXEC                                                 00540300
               MOVE WS-ORG-RECORD-CHANGED TO MESSAG1O                   00540400
               MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG                  00540500
               PERFORM 1100-BUILD-SCREEN.                               00540600
                                                                        00540700
      *  REWRITE MASTER RECORD                                          00540800
           MOVE 'RW' TO CA-ACCESS-TYPE.                                 00540900
           MOVE CL-INFO TO WS-RECORD-INFO.                              00541000
                                                                        00541100
           PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT.                00541200
                                                                        00541300
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00541400
                                                                        00541500
      *  UPDATE HEADER                                                  00541600
           MOVE CA-HEADER-MAP TO MAPHDERI.                              00541700
           MOVE CA-SYSTEM-MO TO WS-DATE-FORMAT-1.                       00541800
           MOVE CA-SYSTEM-DY TO WS-DATE-FORMAT-2.                       00541900
           MOVE CA-SYSTEM-YR TO WS-DATE-FORMAT-3.                       00542000
           MOVE WS-DATE-FORMAT TO LACTYDTI.                             00542100
           MOVE MAPHDERI TO CA-HEADER-MAP.                              00542200
                                                                        00542300
       2792-EXIT.                                                       00542400
           EXIT.                                                        00542500
       EJECT                                                            00542600
      ***********************************************************       00542700
      *          P F 7     B R O W S E   B A C K W A R D        *       00542800
      ***********************************************************       00542900
       2800-PF7-FUNCTION.                                               00543000
                                                                        00543100
      *  DETERMINE WHICH PAGE SHOULD BE BUILT                           00543200
           IF CA-PREV-PAGE-NUM = 2                                      00543300
               MOVE 1 TO WS-BUILD-PAGE-IND                              00543400
               PERFORM 1100-BUILD-SCREEN                                00543500
           ELSE IF CA-PREV-PAGE-NUM = 3                                 00543600
               MOVE 2 TO WS-BUILD-PAGE-IND                              00543700
               PERFORM 1100-BUILD-SCREEN                                00543800
           ELSE                                                         00543900
               MOVE 'E002' TO WS-MESSAGE-CODE-HOLD                      00544000
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00544100
               PERFORM 8000-SEND-PAGE.                                  00544200
                                                                        00544300
       2800-EXIT.                                                       00544400
           EXIT.                                                        00544500
       EJECT                                                            00544600
      ***********************************************************       00544700
      *            P F 8     B R O W S E   F O R W A R D        *       00544800
      ***********************************************************       00544900
       2900-PF8-FUNCTION.                                               00545000
                                                                        00545100
      *  DETERMINE WHICH PAGE SHOULD BE BUILT                           00545200
           IF CA-PREV-PAGE-NUM = 1                                      00545300
               MOVE 2 TO WS-BUILD-PAGE-IND                              00545400
               PERFORM 1100-BUILD-SCREEN                                00545500
           ELSE IF CA-PREV-PAGE-NUM = 2                                 00545600
               MOVE 3 TO WS-BUILD-PAGE-IND                              00545700
               PERFORM 1100-BUILD-SCREEN                                00545800
           ELSE                                                         00545900
               MOVE 'E002' TO WS-MESSAGE-CODE-HOLD                      00546000
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00546100
               PERFORM 8000-SEND-PAGE.                                  00546200
                                                                        00546300
       2900-EXIT.                                                       00546400
           EXIT.                                                        00546500
       EJECT                                                            00546600
      ***********************************************************       00546700
      *                P F 9   F U N C T I O N                  *       00546800
      ***********************************************************       00546900
       3000-PF9-FUNCTION.                                               00547000
                                                                        00547100
      *  READ DE RECORD FROM TS                                         00547200
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00547300
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00547400
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00547500
                                                                        00547600
           MOVE WS-RECORD TO WS-ORG-RECORD-DE.                          00547700
           MOVE WS-RECORD-INFO TO DE-INFO.                              00547800
                                                                        00547900
      *  READ CL RECORD                                                 00548000
           MOVE WS-CL-ITEM-NUM TO CA-ITEM-NUM.                          00548100
           MOVE WS-CL-RECORD-LENGTH TO CA-RECORD-LENGTH.                00548200
                                                                        00548300
           IF WS-CL-ITEM-NUM = 0                                        00548400
               MOVE 'RD' TO CA-ACCESS-TYPE                              00548500
               MOVE 'F' TO CA-READ-TYPE                                 00548600
               MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                       00548700
               MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM                     00548800
               MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM                     00548900
               MOVE '05' TO CA-AK-REC-CODE                              00549000
               MOVE '001' TO CA-AK-REC-NUM                              00549100
               MOVE SPACES TO CA-ACCESS-MSG-CODE                        00549200
               PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT           00549300
               MOVE CA-ITEM-NUM TO WS-CL-ITEM-NUM.                      00549400
                                                                        00549500
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00549600
           MOVE WS-RECORD TO WS-ORG-RECORD-CL.                          00549700
           MOVE WS-RECORD-INFO TO CL-INFO.                              00549800
                                                                        00549900
      *  READ PI RECORD FOR STATE LIFE                                  00550000
           IF CA-SL-ID                                                  00550100
AC9430        AND CA-GSYS-POLICY                                        00550200
               MOVE WS-PI-ITEM-NUM TO CA-ITEM-NUM                       00550300
               MOVE WS-PI-RECORD-LENGTH TO CA-RECORD-LENGTH             00550400
               MOVE 'RD' TO CA-ACCESS-TYPE                              00550500
               MOVE 'F' TO CA-READ-TYPE                                 00550600
               MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                       00550700
               MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM                     00550800
               MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM                     00550900
               MOVE '10' TO CA-AK-REC-CODE                              00551000
               MOVE '001' TO CA-AK-REC-NUM                              00551100
               MOVE SPACES TO CA-ACCESS-MSG-CODE                        00551200
               PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT           00551300
               MOVE CA-ITEM-NUM TO WS-PI-ITEM-NUM                       00551400
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00551500
               MOVE WS-RECORD-INFO TO PI-INFO.                          00551600
                                                                        00551700
      *  READ DI RECORD FOR STATE LIFE                                  00551800
           IF CA-SL-ID                                                  00551900
AC9430        AND CA-GSYS-POLICY                                        00552000
               MOVE WS-DI-ITEM-NUM TO CA-ITEM-NUM                       00552100
               MOVE WS-DI-RECORD-LENGTH TO CA-RECORD-LENGTH             00552200
               IF WS-CL-ITEM-NUM = 0                                    00552300
                   MOVE 'RD' TO CA-ACCESS-TYPE                          00552400
                   MOVE 'F' TO CA-READ-TYPE                             00552500
                   MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                   00552600
                                         WS-DI-CT-NUM                   00552700
                   MOVE ZEROES TO CA-AK-POL-NUM                         00552800
                   MOVE WS-DI-AK-CLM-NUM TO CA-AK-CLM-NUM               00552900
                   MOVE '01' TO CA-AK-REC-CODE                          00553000
                   MOVE '001' TO CA-AK-REC-NUM                          00553100
                   MOVE SPACES TO CA-ACCESS-MSG-CODE                    00553200
                   PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT       00553300
                   MOVE CA-ITEM-NUM TO WS-DI-ITEM-NUM                   00553400
                   PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT            00553500
                   MOVE WS-RECORD-INFO TO DI-INFO                       00553600
               ELSE                                                     00553700
                   PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT            00553800
                   MOVE WS-RECORD-INFO TO DI-INFO.                      00553900
                                                                        00554000
      *  IF MSL CLAIM, DETERMINE IF IT IS FOR LIENREF ONLY              00554100
AC9430*****IF WS-MSL-POLICY                                             00554200
AC9430     IF CA-ALIS-POLICY                                            00554300
AC9430       AND CA-COMPANY-INTERNAL-CHAR-M                             00554400
               IF DE-BEN-OCCUR-NUM > 1                                  00554500
                   NEXT SENTENCE                                        00554600
               END-IF                                                   00554700
               PERFORM                                                  00554800
                 VARYING WS-SUB-4 FROM +1 BY +1                         00554900
                 UNTIL WS-MSL-LIENREF-CLAIM OR                          00555000
                      (WS-SUB-4 > DE-BEN-OCCUR-NUM)                     00555100
                   IF DE-PLAN-CODE(WS-SUB-4) = 'LIENREF'                00555200
                       MOVE 'Y' TO WS-MSL-LIENREF-CLAIM-FLAG            00555300
                   END-IF                                               00555400
               END-PERFORM.                                             00555500
                                                                        00555600
           IF (DE-ORIG) AND (DE-PAID-DT NOT NUMERIC)                    00555700
               PERFORM 3300-PF9-FUNCTION-PAY                            00555800
           ELSE IF (DE-REV OR DE-ADJ) AND (DE-REV-ADJ-DT NOT NUMERIC)   00555900
               PERFORM 3300-PF9-FUNCTION-PAY                            00556000
           ELSE                                                         00556100
               MOVE 'E728' TO WS-MESSAGE-CODE-HOLD                      00556200
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00556300
               PERFORM 8000-SEND-PAGE.                                  00556400
                                                                        00556500
       3000-EXIT.                                                       00556600
           EXIT.                                                        00556700
       EJECT                                                            00556800
      ***********************************************************       00556900
      *                  P A Y   F U N C T I O N                *       00557000
      ***********************************************************       00557100
       3300-PF9-FUNCTION-PAY.                                           00557200
                                                                        00557300
      *  PAYMENT CANNOT BE PAID ON THE SAME DATE IT WAS PROCESSED, THIS 00557400
      *   IS BECAUSE THE PROCESS FUNCTION MUST SEND AN INTERFACE TO THE 00557500
      *   ADMN CYCLE FOR THAT NIGHT.                                    00557600
      *  READ PR RECORD                                                 00557700
Q16162     IF CA-LOB-FIXED-ANNUITY                                      00557800
Q16162         NEXT SENTENCE                                            00557900
Q16162     ELSE                                                         00558000
AC9430*****IF NOT WS-NON-ADMN-POLICY                                    00558100
AC9430     IF NOT CA-NON-ADMN-POLICY                                    00558200
               MOVE WS-PR-ITEM-NUM TO CA-ITEM-NUM                       00558300
               MOVE WS-PR-RECORD-LENGTH TO CA-RECORD-LENGTH             00558400
               IF WS-PR-ITEM-NUM NOT > 0                                00558500
                   MOVE 'RD' TO CA-ACCESS-TYPE                          00558600
                   MOVE 'F' TO CA-READ-TYPE                             00558700
                   MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                   00558800
                   MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM                 00558900
                   MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM                 00559000
                   MOVE '50' TO CA-AK-REC-CODE                          00559100
                   MOVE '001' TO CA-AK-REC-NUM                          00559200
                   MOVE SPACES TO CA-ACCESS-MSG-CODE                    00559300
                   PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT       00559400
                   MOVE CA-ITEM-NUM TO WS-PR-ITEM-NUM.                  00559500
      *  READ THE PROCESS RECORD FROM TS                                00559600
Q16162     IF CA-LOB-FIXED-ANNUITY                                      00559700
Q16162         NEXT SENTENCE                                            00559800
Q16162     ELSE                                                         00559900
AC9430*****IF NOT WS-NON-ADMN-POLICY                                    00560000
AC9430     IF NOT CA-NON-ADMN-POLICY                                    00560100
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00560200
      *  MOVE WS-RECORD TO RECORD LAYOUT                                00560300
               MOVE WS-RECORD-INFO TO PR-INFO                           00560400
               IF PR-PROCESS-DT = CA-SYSTEM-DATE                        00560500
                   MOVE 'CANNOT PAY ON PRS DATE' TO MESSAG1O            00560600
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00560700
                   MOVE YELLOW-COLOR TO MESSAG1C                        00560800
                   PERFORM 8000-SEND-PAGE.                              00560900
                                                                        00561000
           IF DE-TOT-BEN < ZERO                                         00561100
               MOVE 'EA36' TO WS-MESSAGE-CODE-HOLD                      00561200
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00561300
               PERFORM 8000-SEND-PAGE.                                  00561400
                                                                        00561500
      *  COVERAGE CANNOT BE RELEASED FOR ZERO AMOUNT                    00561600
           PERFORM 3310-FIND-ZERO-AMT THRU 3310-EXIT                    00561700
               VARYING WS-SUB FROM +1 BY +1                             00561800
                   UNTIL WS-SUB > DE-BEN-OCCUR-NUM.                     00561900
           IF WS-ZERO-COV-AMT                                           00562000
               MOVE 'EA39' TO WS-MESSAGE-CODE-HOLD                      00562100
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00562200
               PERFORM 8000-SEND-PAGE.                                  00562300
                                                                        00562400
      *  CALL PROGRAM TO CHECK FOR VALID DATA                           00562500
           MOVE 'ID' TO WS-PYMT-TYPE                                    00562600
                                                                        00562700
           MOVE WS-DE-ITEM-NUM TO WS-ITEM-NUM-1.                        00562800
           MOVE WS-DE-RECORD-LENGTH TO WS-RECORD-LENGTH-1.              00562900
                                                                        00563000
           MOVE WS-VALIDATE-RECORD TO CA-GENERAL.                       00563100
                                                                        00563200
           IF WS-MSL-LIENREF-CLAIM                                      00563300
               NEXT SENTENCE                                            00563400
           ELSE                                                         00563500
           EXEC CICS LINK                                               00563600
                     PROGRAM('D681VALD')                                00563700
                     COMMAREA(DFHCOMMAREA)                              00563800
                     LENGTH(EIBCALEN)                                   00563900
           END-EXEC.                                                    00564000
                                                                        00564100
           MOVE CA-GENERAL TO WS-VALIDATE-RECORD.                       00564200
                                                                        00564300
           IF WS-VALIDATED OR WS-MSL-LIENREF-CLAIM                      00564400
               NEXT SENTENCE                                            00564500
           ELSE                                                         00564600
               PERFORM 2310-SEND-MSGS THRU 2310-EXIT                    00564700
                   VARYING WS-SUB FROM +1 BY +1                         00564800
                   UNTIL WS-SUB > 9                                     00564900
               PERFORM 8000-SEND-PAGE.                                  00565000
                                                                        00565100
      **  CHECK TO MAKE SURE BENE % = 100                               00565200
           MOVE WS-BN-ITEM-NUM TO CA-ITEM-NUM.                          00565300
           MOVE WS-BN-RECORD-LENGTH TO CA-RECORD-LENGTH.                00565400
                                                                        00565500
           MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM.                          00565600
           MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM.                        00565700
           MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM.                        00565800
           MOVE '40' TO CA-AK-REC-CODE.                                 00565900
           MOVE '001' TO CA-AK-REC-NUM.                                 00566000
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00566100
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00566200
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00566300
           MOVE SPACES TO WS-END-FLAG.                                  00566400
           MOVE 'RN' TO CA-ACCESS-TYPE.                                 00566500
           MOVE +0 TO WS-BUILD-PAGE-IND.                                00566600
           PERFORM 3320-TOTAL-BENE-PCT THRU 3320-EXIT                   00566700
               UNTIL WS-END.                                            00566800
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00566900
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00567000
           MOVE CA-ITEM-NUM TO WS-BN-ITEM-NUM.                          00567100
                                                                        00567200
           IF WS-TOTAL-PCT-BEN NOT = 1                                  00567300
               MOVE 'E746' TO WS-MESSAGE-CODE-HOLD                      00567400
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00567500
               PERFORM 8000-SEND-PAGE.                                  00567600
                                                                        00567700
           COMPUTE WS-MISSING-PENNIES ROUNDED =                         00567800
               DE-TOT-BEN - WS-TOTAL-BEN-AMT.                           00567900
           IF WS-MISSING-PENNIES > WS-TOTAL-NUM-OF-BENES                00568000
               MOVE 'E963' TO WS-MESSAGE-CODE-HOLD                      00568100
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00568200
               PERFORM 8000-SEND-PAGE.                                  00568300
                                                                        00568400
      *  CREATE TRX REG ENTRY                                           00568500
           MOVE CA-EST-CLM-NUM TO WS-TRX-PRS-CLM-NUM.                   00568600
           MOVE CA-SYSTEM-DATE TO WS-TRX-PRS-DT.                        00568700
           EXEC CICS ASKTIME                                            00568800
               ABSTIME(WS-ASK-TIME)                                     00568900
           END-EXEC.                                                    00569000
           EXEC CICS FORMATTIME                                         00569100
               ABSTIME(WS-ASK-TIME)                                     00569200
               TIME(WS-TIME)                                            00569300
               TIMESEP                                                  00569400
           END-EXEC.                                                    00569500
           MOVE WS-TIME TO WS-TRX-PRS-TIME.                             00569600
           IF DE-REV                                                    00569700
               MOVE 'PAYMENT/REV' TO WS-TRX-PRS-TYPE                    00569800
           ELSE IF DE-ADJ                                               00569900
               MOVE 'PAYMENT/ADJ' TO WS-TRX-PRS-TYPE                    00570000
           ELSE                                                         00570100
               MOVE 'PAYMENT' TO WS-TRX-PRS-TYPE.                       00570200
           MOVE CA-EXAM TO WS-TRX-PRS-EXAM.                             00570300
           MOVE CL-LAST-ACT-DT TO WS-TRX-PRS-LAST-CHANGE-DT.            00570400
           MOVE 'ASPD' TO WS-TRX-PRS-SCREEN-ID.                         00570500
           MOVE SPACES TO WS-TRX-PRS-OPEN.                              00570600
           MOVE WS-ORG-RECORD-DE-KEY TO WS-TRX-REC-KEY.                 00570700
           MOVE WS-TRX-PRS-REC TO TRX-PRS-REC.                          00570800
           PERFORM 4620-WRITE-TRX-RPT-PRS THRU 4620-EXIT.               00570900
                                                                        00571000
      *  SET PAID EXAM                                                  00571100
           IF CL-REOPEN-EXAM NOT = SPACES AND LOW-VALUES                00571200
               MOVE CL-REOPEN-EXAM TO DE-PAID-EXAM                      00571300
           ELSE IF CL-WORKED-EXAM NOT = SPACES AND LOW-VALUE            00571400
               MOVE CL-WORKED-EXAM TO DE-PAID-EXAM                      00571500
           ELSE                                                         00571600
               MOVE CL-ASSIGNED-EXAM TO DE-PAID-EXAM.                   00571700
           MOVE DE-PAID-EXAM TO PDEXAMO.                                00571800
                                                                        00571900
           IF CA-SENIOR-VICE-PRESIDENT                                  00572000
               MOVE CA-EXAM TO DE-APROV-OTH                             00572100
                               OTHAPROO                                 00572200
           ELSE IF CA-VICE-PRESIDENT                                    00572300
               MOVE CA-EXAM TO DE-APROV-VP                              00572400
                               VPAPROVO                                 00572500
           ELSE                                                         00572600
               MOVE CA-EXAM TO DE-APROV-PB                              00572700
                               PBAPROVO.                                00572800
                                                                        00572900
      *  SET PAID DATE                                                  00573000
           IF DE-ORIG                                                   00573100
               MOVE CA-SYSTEM-DATE TO DE-PAID-DT                        00573200
               MOVE DE-PAID-MO TO WS-DATE-FORMAT-1                      00573300
               MOVE DE-PAID-DY TO WS-DATE-FORMAT-2                      00573400
               MOVE DE-PAID-YR TO WS-DATE-FORMAT-3                      00573500
               MOVE WS-DATE-FORMAT TO RLSEDDTO                          00573600
           ELSE                                                         00573700
               MOVE CA-SYSTEM-DATE TO DE-REV-ADJ-DT                     00573800
               MOVE DE-REV-ADJ-MO TO WS-DATE-FORMAT-1                   00573900
               MOVE DE-REV-ADJ-DY TO WS-DATE-FORMAT-2                   00574000
               MOVE DE-REV-ADJ-YR TO WS-DATE-FORMAT-3                   00574100
               MOVE WS-DATE-FORMAT TO REVDTO.                           00574200
                                                                        00574300
      *  BUILD BP RECORD BASED OFF PAYMENT RECORD AND BN RECORD         00574400
           IF DE-REV OR DE-ADJ                                          00574500
               NEXT SENTENCE                                            00574600
           ELSE                                                         00574700
               PERFORM 3330-BUILD-BP-RECS THRU 3330-EXIT.               00574800
                                                                        00574900
           PERFORM 2790-REWRITE-RECORD THRU 2790-EXIT.                  00575000
                                                                        00575100
           IF DE-REV                                                    00575200
               MOVE 'I053' TO WS-MESSAGE-CODE-HOLD                      00575300
           ELSE IF DE-ADJ                                               00575400
               MOVE 'I054' TO WS-MESSAGE-CODE-HOLD                      00575500
           ELSE                                                         00575600
               MOVE 'I046' TO WS-MESSAGE-CODE-HOLD.                     00575700
           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.               00575800
                                                                        00575900
      *  WRITE THE TRX REG RECORDS TO FILE                              00576000
           PERFORM 4610-WRITE-TRX-RPT THRU 4610-EXIT                    00576100
               VARYING WS-SUB FROM +1 BY +1                             00576200
               UNTIL WS-SUB > WS-TRX-HOLD-NUM.                          00576300
                                                                        00576400
      *  CREATE GSYS TRANS FOR ACCOUNTING FOR A DEATH CLAIM             00576500
           IF CA-SL-ID                                                  00576600
AC9430***** AND (WS-NON-ADMN-SL-ANNUITY-POLICY                          00576700
AC9430*****   OR WS-NON-ADMN-SL-TRAD-POLICY)                            00576800
AC9430      AND CA-GSYS-POLICY                                          00576900
            AND DE-ORIG                                                 00577000
            AND (DE-ACTG-CODE NOT = '99')                               00577100
               MOVE SPACES TO WS-SL-GROUP-LIFE-SWITCH                   00577200
               MOVE CA-EST-POL-NUM TO WS-POLICY-NUM-AREA                00577300
               PERFORM 3355-GET-GSYS-CLIENT-NAME                        00577400
      ****EAB***  BUILDS DEBIT FIRST THEN CREDIT                        00577500
               PERFORM                                                  00577600
               VARYING WS-DE-SUB FROM 1 BY 1                            00577700
                 UNTIL WS-DE-SUB > DE-BEN-OCCUR-NUM                     00577800
                   IF DE-PLAN-CODE(WS-DE-SUB) = 'LOINTRF'               00577900
                       MOVE DE-BEN-AMT(WS-DE-SUB) TO WS-LOINTRF-AMT     00578000
                   END-IF                                               00578100
               END-PERFORM                                              00578200
               PERFORM                                                  00578300
               VARYING WS-DE-SUB FROM 1 BY 1                            00578400
                 UNTIL WS-DE-SUB > DE-BEN-OCCUR-NUM                     00578500
                   MOVE CA-SYSTEM-MO   TO GPA-H04-TRANS-MM              00578600
                   MOVE CA-SYSTEM-DY   TO GPA-H04-TRANS-DD              00578700
                   COMPUTE WS-WORK-YEAR                                 00578800
                      = CA-SYSTEM-YR - 1800                             00578900
                   MOVE WS-WORK-YEAR   TO GPA-H04-TRANS-YYY             00579000
                   MOVE 'D' TO GPA-H04-DEBIT-CREDIT                     00579100
      **** GSYS CAN NOT HANDLE AMOUNTS > $999,999.99                    00579200
      **** IF ACTS AMOUNT IS > $999,999.99, NEED TO SPLIT INTO          00579300
      **** MULTIPLE H04S                                                00579400
                   MOVE +1 TO WS-GSYS-DIVIDE-BY                         00579500
                   MOVE ZERO TO WS-GSYS-EXTRA-CENTS                     00579600
                   IF DE-BEN-AMT (WS-DE-SUB) < ZERO                     00579700
                      COMPUTE WS-ACTS-AMOUNT                            00579800
                         = DE-BEN-AMT(WS-DE-SUB) * -1                   00579900
                   ELSE                                                 00580000
                      MOVE DE-BEN-AMT(WS-DE-SUB) TO WS-ACTS-AMOUNT      00580100
                   END-IF                                               00580200
                   PERFORM 3356-CALC-GSYS-AMOUNT THRU 3356-EXIT         00580300
                   EVALUATE DE-PLAN-CODE(WS-DE-SUB)                     00580400
                       WHEN 'LOAN'                                      00580500
                           PERFORM 3351-DE-PLAN-LOAN                    00580600
                       WHEN 'SLA'                                       00580700
                           MOVE '1230550000' TO GPA-H04-ACCOUNT-10      00580800
                           PERFORM 3350-BUILD-GSYS-TRANS                00580900
                       WHEN 'SLQA'                                      00581000
                           MOVE '1230550000' TO GPA-H04-ACCOUNT-10      00581100
                           PERFORM 3350-BUILD-GSYS-TRANS                00581200
                       WHEN 'SSA'                                       00581300
                           MOVE '1230550000' TO GPA-H04-ACCOUNT-10      00581400
                           PERFORM 3350-BUILD-GSYS-TRANS                00581500
                       WHEN 'SSQA'                                      00581600
                           MOVE '1230550000' TO GPA-H04-ACCOUNT-10      00581700
                           PERFORM 3350-BUILD-GSYS-TRANS                00581800
                       WHEN 'SLGPLIF'                                   00581900
                           MOVE '1230050000' TO GPA-H04-ACCOUNT-10      00582000
                           MOVE 'Y' TO WS-SL-GROUP-LIFE-SWITCH          00582100
                           PERFORM 3350-BUILD-GSYS-TRANS                00582200
                       WHEN 'SLUL'                                      00582300
                           IF WS-POL-SERIES-1 = 4                       00582400
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00582500
                           ELSE                                         00582600
                              MOVE '1230150YIZ' TO GPA-H04-ACCOUNT-10   00582700
                           END-IF                                       00582800
                           PERFORM 3350-BUILD-GSYS-TRANS                00582900
                       WHEN 'SSUL'                                      00583000
                           IF WS-POL-SERIES-1 = 4                       00583100
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00583200
                           ELSE                                         00583300
                              MOVE '1230150YIZ' TO GPA-H04-ACCOUNT-10   00583400
                           END-IF                                       00583500
                           PERFORM 3350-BUILD-GSYS-TRANS                00583600
                       WHEN 'SLABR'                                     00583700
                           IF WS-POL-SERIES-1 = 4                       00583800
                             MOVE '1230150000' TO GPA-H04-ACCOUNT-10    00583900
                           ELSE                                         00584000
AC9430*****                  IF WS-NON-ADMN-SL-TRAD-POLICY              00584100
AC9430                       IF CA-NON-ADMN-POLICY AND                  00584200
AC9430                          (CA-LOB-TERM OR CA-LOB-WHOLE-LIFE)      00584300
                                MOVE '1230150YBZ' TO GPA-H04-ACCOUNT-10 00584400
                             ELSE                                       00584500
                                MOVE '1230150YAZ' TO GPA-H04-ACCOUNT-10 00584600
                             END-IF                                     00584700
                           END-IF                                       00584800
                           PERFORM 3350-BUILD-GSYS-TRANS                00584900
                       WHEN 'SSABR'                                     00585000
                           IF WS-POL-SERIES-1 = 4                       00585100
                             MOVE '1230150000' TO GPA-H04-ACCOUNT-10    00585200
                           ELSE                                         00585300
AC9430*****                  IF WS-NON-ADMN-SL-TRAD-POLICY              00585400
AC9430                       IF CA-NON-ADMN-POLICY AND                  00585500
AC9430                          (CA-LOB-TERM OR CA-LOB-WHOLE-LIFE)      00585600
                                MOVE '1230150YBZ' TO GPA-H04-ACCOUNT-10 00585700
                             ELSE                                       00585800
                                MOVE '1230150YAZ' TO GPA-H04-ACCOUNT-10 00585900
                             END-IF                                     00586000
                           END-IF                                       00586100
                           PERFORM 3350-BUILD-GSYS-TRANS                00586200
                       WHEN 'SLTM'                                      00586300
                           IF WS-POL-SERIES-1 = 4                       00586400
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00586500
                           ELSE                                         00586600
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00586700
                           END-IF                                       00586800
                           PERFORM 3350-BUILD-GSYS-TRANS                00586900
                       WHEN 'SSTM'                                      00587000
                           IF WS-POL-SERIES-1 = 4                       00587100
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00587200
                           ELSE                                         00587300
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00587400
                           END-IF                                       00587500
                           PERFORM 3350-BUILD-GSYS-TRANS                00587600
                       WHEN 'SLTR'                                      00587700
                           IF WS-POL-SERIES-1 = 4                       00587800
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00587900
                           ELSE                                         00588000
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00588100
                           END-IF                                       00588200
                           PERFORM 3350-BUILD-GSYS-TRANS                00588300
                       WHEN 'SLUNI'                                     00588400
                           IF WS-POL-SERIES-1 = 4                       00588500
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00588600
                           ELSE                                         00588700
                              MOVE '1230150YIZ' TO GPA-H04-ACCOUNT-10   00588800
                           END-IF                                       00588900
                           PERFORM 3350-BUILD-GSYS-TRANS                00589000
                       WHEN 'SSTR'                                      00589100
                           IF WS-POL-SERIES-1 = 4                       00589200
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00589300
                           ELSE                                         00589400
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00589500
                           END-IF                                       00589600
                           PERFORM 3350-BUILD-GSYS-TRANS                00589700
                       WHEN 'SLT10'                                     00589800
                           IF WS-POL-SERIES-1 = 4                       00589900
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00590000
                           ELSE                                         00590100
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00590200
                           END-IF                                       00590300
                           PERFORM 3350-BUILD-GSYS-TRANS                00590400
                       WHEN 'SLT15'                                     00590500
                           IF WS-POL-SERIES-1 = 4                       00590600
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00590700
                           ELSE                                         00590800
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00590900
                           END-IF                                       00591000
                           PERFORM 3350-BUILD-GSYS-TRANS                00591100
                       WHEN 'SLT15P'                                    00591200
                           IF WS-POL-SERIES-1 = 4                       00591300
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00591400
                           ELSE                                         00591500
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00591600
                           END-IF                                       00591700
                           PERFORM 3350-BUILD-GSYS-TRANS                00591800
                       WHEN 'SLT20'                                     00591900
                           IF WS-POL-SERIES-1 = 4                       00592000
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00592100
                           ELSE                                         00592200
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00592300
                           END-IF                                       00592400
                           PERFORM 3350-BUILD-GSYS-TRANS                00592500
                       WHEN 'SLT20P'                                    00592600
                           IF WS-POL-SERIES-1 = 4                       00592700
                              MOVE '1230150000' TO GPA-H04-ACCOUNT-10   00592800
                           ELSE                                         00592900
                              MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10   00593000
                           END-IF                                       00593100
                           PERFORM 3350-BUILD-GSYS-TRANS                00593200
                       WHEN 'SLADB'                                     00593300
                           IF WS-POL-SERIES-1 = 4                       00593400
                             MOVE '1230350000' TO GPA-H04-ACCOUNT-10    00593500
                           ELSE                                         00593600
AC9430*****                  IF WS-NON-ADMN-SL-TRAD-POLICY              00593700
AC9430                       IF CA-NON-ADMN-POLICY AND                  00593800
AC9430                          (CA-LOB-TERM OR CA-LOB-WHOLE-LIFE)      00593900
                                MOVE '1230350YTZ' TO GPA-H04-ACCOUNT-10 00594000
                             ELSE                                       00594100
                                MOVE '1230350YIZ' TO GPA-H04-ACCOUNT-10 00594200
                             END-IF                                     00594300
                           END-IF                                       00594400
                           PERFORM 3350-BUILD-GSYS-TRANS                00594500
                       WHEN 'SLCHR'                                     00594600
                           PERFORM 3352-DE-PLAN-COMMON                  00594700
                           PERFORM 3350-BUILD-GSYS-TRANS                00594800
                       WHEN 'SLPUA'                                     00594900
                           PERFORM 3352-DE-PLAN-COMMON                  00595000
                           PERFORM 3350-BUILD-GSYS-TRANS                00595100
                       WHEN 'SLSR'                                      00595200
                           PERFORM 3352-DE-PLAN-COMMON                  00595300
                           PERFORM 3350-BUILD-GSYS-TRANS                00595400
                       WHEN 'SLTMR'                                     00595500
                           PERFORM 3352-DE-PLAN-COMMON                  00595600
                           PERFORM 3350-BUILD-GSYS-TRANS                00595700
                       WHEN 'SLCOV'                                     00595800
                           IF WS-POL-SERIES-1 = 4                       00595900
                             MOVE '1230150000' TO GPA-H04-ACCOUNT-10    00596000
                           ELSE                                         00596100
                             IF CL-PLAN-CODE = 'SLABR'                  00596200
                              OR CL-PLAN-CODE = 'SSABR'                 00596300
                                MOVE '1230150YAZ' TO GPA-H04-ACCOUNT-10 00596400
                             ELSE                                       00596500
                                MOVE '1230150YIZ' TO GPA-H04-ACCOUNT-10 00596600
                             END-IF                                     00596700
                           END-IF                                       00596800
                           PERFORM 3350-BUILD-GSYS-TRANS                00596900
                       WHEN 'SLDAGE'                                    00597000
                           PERFORM 3352-DE-PLAN-COMMON                  00597100
                           PERFORM 3350-BUILD-GSYS-TRANS                00597200
                       WHEN 'SLREF'                                     00597300
                           PERFORM 3352-DE-PLAN-COMMON                  00597400
                           PERFORM 3350-BUILD-GSYS-TRANS                00597500
                       WHEN 'SL210'                                     00597600
                           MOVE '1121026000' TO GPA-H04-ACCOUNT-10      00597700
                           PERFORM 3350-BUILD-GSYS-TRANS                00597800
                       WHEN 'PMDIV'                                     00597900
                           MOVE '1234857000' TO GPA-H04-ACCOUNT-10      00598000
                           PERFORM 3350-BUILD-GSYS-TRANS                00598100
                       WHEN 'DIVDEP'                                    00598200
                           MOVE '1235657000' TO GPA-H04-ACCOUNT-10      00598300
                           PERFORM 3350-BUILD-GSYS-TRANS                00598400
                       WHEN 'DIVDINT'                                   00598500
                           MOVE '1235657000' TO GPA-H04-ACCOUNT-10      00598600
                           PERFORM 3350-BUILD-GSYS-TRANS                00598700
                       WHEN 'PDF'                                       00598800
                           MOVE '2311720000' TO GPA-H04-ACCOUNT-10      00598900
                           PERFORM 3350-BUILD-GSYS-TRANS                00599000
                       WHEN 'SLCAGE'                                    00599100
                           MOVE 'C' TO GPA-H04-DEBIT-CREDIT             00599200
                           PERFORM 3352-DE-PLAN-COMMON                  00599300
                           PERFORM 3350-BUILD-GSYS-TRANS                00599400
                       WHEN 'PRMCHRG'                                   00599500
                           MOVE 'C' TO GPA-H04-DEBIT-CREDIT             00599600
                           MOVE '1121026000' TO GPA-H04-ACCOUNT-10      00599700
                           PERFORM 3350-BUILD-GSYS-TRANS                00599800
                       WHEN 'PRCRGIN'                                   00599900
                           MOVE 'C' TO GPA-H04-DEBIT-CREDIT             00600000
                           MOVE '1121026000' TO GPA-H04-ACCOUNT-10      00600100
                           PERFORM 3350-BUILD-GSYS-TRANS                00600200
                   END-EVALUATE                                         00600300
               END-PERFORM                                              00600400
               PERFORM 3353-TOTAL-BENEFIT                               00600500
           END-IF.                                                      00600600
                                                                        00600700
           PERFORM 8000-SEND-PAGE.                                      00600800
                                                                        00600900
       3300-EXIT.                                                       00601000
           EXIT.                                                        00601100
      /                                                                 00601200
       3310-FIND-ZERO-AMT.                                              00601300
           IF DE-BEN-AMT(WS-SUB) = ZERO                                 00601400
               AND DE-BEN-AMT-REV(WS-SUB) = ZERO                        00601500
                   MOVE 'Y' TO WS-ZERO-COV-AMT-FLAG.                    00601600
       3310-EXIT.                                                       00601700
           EXIT.                                                        00601800
                                                                        00601900
       3320-TOTAL-BENE-PCT.                                             00602000
                                                                        00602100
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00602200
                                                                        00602300
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00602400
                                                                        00602500
           MOVE WS-RECORD-KEY TO AK-MST-KEY.                            00602600
                                                                        00602700
           IF (AK-CLM-NUM = CA-EST-CLM-NUM) AND (AK-BENE-REC)           00602800
               MOVE WS-RECORD-INFO TO BN-INFO                           00602900
               ADD BN-PCT-BEN TO WS-TOTAL-PCT-BEN                       00603000
               ADD +1 TO WS-TOTAL-NUM-OF-BENES                          00603100
               COMPUTE WS-TOTAL-BEN-AMT ROUNDED =                       00603200
                   WS-TOTAL-BEN-AMT +                                   00603300
                   (DE-TOT-BEN * BN-PCT-BEN)                            00603400
           ELSE                                                         00603500
               MOVE 'Y' TO WS-END-FLAG.                                 00603600
                                                                        00603700
       3320-EXIT.                                                       00603800
           EXIT.                                                        00603900
       EJECT                                                            00604000
       3330-BUILD-BP-RECS.                                              00604100
                                                                        00604200
      *  FIND LAST BP RECORD                                            00604300
           MOVE ZERO TO WS-HOLD-BP-REC-NUM.                             00604400
           MOVE WS-BP-ITEM-NUM TO CA-ITEM-NUM.                          00604500
           MOVE WS-BP-RECORD-LENGTH TO CA-RECORD-LENGTH.                00604600
           MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM.                          00604700
           MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM.                        00604800
           MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM.                        00604900
           MOVE '45' TO CA-AK-REC-CODE.                                 00605000
           MOVE '001' TO CA-AK-REC-NUM.                                 00605100
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00605200
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00605300
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00605400
           MOVE SPACES TO WS-END-FLAG.                                  00605500
           MOVE 'RN' TO CA-ACCESS-TYPE.                                 00605600
           MOVE +0 TO WS-BUILD-PAGE-IND.                                00605700
           PERFORM 3331-GET-LAST-RECORD THRU 3331-EXIT                  00605800
               UNTIL WS-END.                                            00605900
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00606000
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00606100
           MOVE CA-ITEM-NUM TO WS-BP-ITEM-NUM.                          00606200
                                                                        00606300
      *  GET DI RECORD FOR DATE OF DEATH                                00606400
           MOVE WS-DI-ITEM-NUM TO CA-ITEM-NUM.                          00606500
           MOVE WS-DI-RECORD-LENGTH TO CA-RECORD-LENGTH.                00606600
                                                                        00606700
           IF WS-DI-ITEM-NUM = 0                                        00606800
               MOVE 'RD' TO CA-ACCESS-TYPE                              00606900
               MOVE 'F' TO CA-READ-TYPE                                 00607000
               MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                       00607100
                                     WS-DI-CT-NUM                       00607200
               MOVE ZEROES TO CA-AK-POL-NUM                             00607300
               MOVE WS-DI-AK-CLM-NUM TO CA-AK-CLM-NUM                   00607400
               MOVE '01' TO CA-AK-REC-CODE                              00607500
               MOVE '001' TO CA-AK-REC-NUM                              00607600
               MOVE SPACES TO CA-ACCESS-MSG-CODE                        00607700
               PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT           00607800
               MOVE CA-ITEM-NUM TO WS-DI-ITEM-NUM.                      00607900
                                                                        00608000
      *  READ THE DI RECORD FROM TS                                     00608100
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00608200
           MOVE WS-RECORD-INFO TO DI-INFO.                              00608300
                                                                        00608400
      *  BUILD BP REC                                                   00608500
           MOVE WS-BN-ITEM-NUM TO CA-ITEM-NUM.                          00608600
           MOVE WS-BN-RECORD-LENGTH TO CA-RECORD-LENGTH.                00608700
                                                                        00608800
           MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM.                          00608900
           MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM.                        00609000
           MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM.                        00609100
           MOVE '40' TO CA-AK-REC-CODE.                                 00609200
           MOVE '001' TO CA-AK-REC-NUM.                                 00609300
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00609400
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00609500
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00609600
           MOVE SPACES TO WS-END-FLAG.                                  00609700
           MOVE 'RN' TO CA-ACCESS-TYPE.                                 00609800
           MOVE +0 TO WS-BUILD-PAGE-IND.                                00609900
           PERFORM 3332-ADD-BP-REC THRU 3332-EXIT                       00610000
               UNTIL WS-END.                                            00610100
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00610200
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00610300
           MOVE CA-ITEM-NUM TO WS-BN-ITEM-NUM.                          00610400
                                                                        00610500
       3330-EXIT.                                                       00610600
           EXIT.                                                        00610700
       EJECT                                                            00610800
       3331-GET-LAST-RECORD.                                            00610900
                                                                        00611000
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00611100
                                                                        00611200
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00611300
                                                                        00611400
           MOVE WS-RECORD-KEY TO AK-MST-KEY.                            00611500
                                                                        00611600
           IF (AK-CLM-NUM = CA-EST-CLM-NUM) AND (AK-BENE-PYMT-REC)      00611700
               MOVE AK-REC-NUM TO WS-HOLD-BP-REC-NUM                    00611800
           ELSE                                                         00611900
               MOVE 'Y' TO WS-END-FLAG.                                 00612000
                                                                        00612100
       3331-EXIT.                                                       00612200
           EXIT.                                                        00612300
       EJECT                                                            00612400
       3332-ADD-BP-REC.                                                 00612500
                                                                        00612600
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00612700
                                                                        00612800
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00612900
                                                                        00613000
           MOVE WS-RECORD-KEY TO AK-MST-KEY.                            00613100
                                                                        00613200
           IF (AK-CLM-NUM = CA-EST-CLM-NUM) AND (AK-BENE-REC)           00613300
               MOVE WS-RECORD-INFO TO BN-INFO                           00613400
           ELSE                                                         00613500
               MOVE 'Y' TO WS-END-FLAG                                  00613600
               GO TO 3332-EXIT.                                         00613700
                                                                        00613800
      *  END BROWSE SO REC CAN BE WRITTEN                               00613900
           MOVE WS-RECORD-KEY TO WS-HOLD-KEY.                           00614000
           MOVE 'EB' TO CA-ACCESS-TYPE.                                 00614100
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00614200
                                                                        00614300
      *  BUILD BP RECORD                                                00614400
           MOVE 'BP' TO BP-REC-ID.                                      00614500
           MOVE CA-SYSTEM-DATE TO BP-REC-ADD-DT.                        00614600
           MOVE WS-ORG-RECORD-DE-KEY TO AK-MST-KEY.                     00614700
           MOVE AK-REC-NUM TO BP-DE-REC-NUM.                            00614800
           MOVE BN-CT-NUM TO BP-CT-NUM.                                 00614900
A13016     MOVE SPACES TO  BP-FED-TAX-IND                               00615000
A13016                     BP-STATE-TAX-IND.                            00615100
           MOVE +0 TO BP-TOT-BEN                                        00615200
                      BP-PCT-BEN-REV                                    00615300
                      BP-BEN-AMT                                        00615400
                      BP-BEN-AMT-REV                                    00615500
A13016                BP-FED-TAX-WTHHLD                                 00615600
A13016                BP-STATE-TAX-WTHHLD                               00615700
A13016                BP-FED-TAX-WTHHLD-REV                             00615800
A13016                BP-STATE-TAX-WTHHLD-REV                           00615900
                      BP-INT-PCT(1)                                     00616000
                      BP-INT-PCT(2)                                     00616100
                      BP-INT-PCT(3)                                     00616200
                      BP-INT-AMT(1)                                     00616300
                      BP-INT-AMT(2)                                     00616400
                      BP-INT-AMT(3)                                     00616500
                      BP-INT-AMT-REV(1)                                 00616600
                      BP-INT-AMT-REV(2)                                 00616700
                      BP-INT-AMT-REV(3).                                00616800
           MOVE DE-PAID-DT TO BP-PROCESS-DT.                            00616900
           MOVE DE-TOT-BEN TO BP-PROCESSED-AMT.                         00617000
           MOVE BN-PCT-BEN TO BP-PCT-BEN.                               00617100
           COMPUTE BP-BEN-AMT ROUNDED =                                 00617200
               BP-PROCESSED-AMT * BP-PCT-BEN.                           00617300
           IF WS-MISSING-PENNIES > 0                                    00617400
               ADD 0.01 TO BP-BEN-AMT                                   00617500
               SUBTRACT 0.01 FROM WS-MISSING-PENNIES                    00617600
           ELSE IF WS-MISSING-PENNIES < 0                               00617700
               SUBTRACT 0.01 FROM BP-BEN-AMT                            00617800
               ADD 0.01 TO WS-MISSING-PENNIES.                          00617900
AC9430*****IF WS-FLEX-POLICY OR WS-NON-ADMN-FLEX-POLICY                 00618000
AC9430*****  OR WS-NON-ADMN-EM-ANNUITY-POLICY                           00618100
AC9430*****  OR WS-NON-ADMN-SL-ANNUITY-POLICY                           00618200
AC9430*****  OR WS-CL-IVA-POLICY OR WS-NON-ADMN-CL-IVA-POLICY           00618300
A11065*AC9430     IF CA-LOB-FIXED-ANNUITY OR                            00618400
A11065*AC9430        CA-LOB-VARIABLE-ANNUITY                            00618500
A11065*               NEXT SENTENCE                                     00618600
A11065     IF (CA-LOB-FIXED-ANNUITY                                     00618700
A11065         OR CA-LOB-VARIABLE-ANNUITY)                              00618800
A11065         PERFORM 3334-BUILD-BEGIN-DATE THRU 3334-EXIT             00618900
A11065         MOVE WS-CKDCARTH-DATE2 TO BP-INT-BEG-DT(1)               00619000
A11065         MOVE WS-INT-PCT-DEFAULT TO BP-INT-PCT(1)                 00619100
           ELSE                                                         00619200
               MOVE DI-DEATH-DT TO BP-INT-BEG-DT(1)                     00619300
               MOVE WS-INT-PCT-DEFAULT TO BP-INT-PCT(1).                00619400
                                                                        00619500
      *  WRITE NEW RECORD TO TS                                         00619600
           MOVE 'WT' TO CA-ACCESS-TYPE.                                 00619700
           MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM.                          00619800
           MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM.                        00619900
           MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM.                        00620000
           MOVE '45' TO CA-AK-REC-CODE.                                 00620100
           ADD +1 TO WS-HOLD-BP-REC-NUM.                                00620200
           MOVE WS-HOLD-BP-REC-NUM TO CA-AK-REC-NUM.                    00620300
           MOVE CA-AK-FILE-KEY TO WS-RECORD-KEY                         00620400
                                  WS-DISPLAYED-RECORD-KEY.              00620500
           MOVE BP-INFO TO WS-RECORD-INFO.                              00620600
           MOVE WS-BP-ITEM-NUM TO CA-ITEM-NUM.                          00620700
           MOVE WS-BP-RECORD-LENGTH TO CA-RECORD-LENGTH.                00620800
           IF WS-BP-ITEM-NUM > 0                                        00620900
               PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT             00621000
           ELSE                                                         00621100
               PERFORM 4920-WRITE-TS-QUEUE THRU 4920-EXIT.              00621200
                                                                        00621300
           MOVE CA-ITEM-NUM TO WS-BP-ITEM-NUM.                          00621400
                                                                        00621500
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00621600
                                                                        00621700
      *  RESTART THE BROWSE                                             00621800
           MOVE WS-BN-ITEM-NUM TO CA-ITEM-NUM.                          00621900
           MOVE WS-BN-RECORD-LENGTH TO CA-RECORD-LENGTH.                00622000
           MOVE WS-HOLD-KEY TO CA-AK-FILE-KEY.                          00622100
           MOVE 'SB' TO CA-ACCESS-TYPE.                                 00622200
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00622300
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00622400
           MOVE 'RN' TO CA-ACCESS-TYPE.                                 00622500
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00622600
                                                                        00622700
       3332-EXIT.                                                       00622800
           EXIT.                                                        00622900
       EJECT                                                            00623000
                                                                        00623100
A11065 3334-BUILD-BEGIN-DATE.                                           00623200
A11065                                                                  00623300
A11065     INITIALIZE WS-CKDCARTH-DIFF                                  00623400
A11065     IF PR-PROCESS-DT NUMERIC                                     00623500
A11065         ADD +1 TO WS-DAYS-DIFF                                   00623600
A11065         CALL 'CKDCARTH' USING PR-PROCESS-DT                      00623700
A11065                               WS-CKDCARTH-DATE2                  00623800
A11065                               WS-MONTHS-DIFF                     00623900
A11065                               WS-DAYS-DIFF                       00624000
A11065                               WS-YEARS-DIFF                      00624100
A11065                               WS-CKDCARTH-ADD-CD                 00624200
A11065     ELSE                                                         00624300
A11065        MOVE CA-SYSTEM-DATE TO WS-CKDCARTH-DATE2                  00624400
A11065     END-IF                                                       00624500
A11065     .                                                            00624600
A11065                                                                  00624700
A11065 3334-EXIT.                                                       00624800
A11065     EXIT.                                                        00624900
A11065                                                                  00625000
       3350-BUILD-GSYS-TRANS.                                           00625100
      *** BUILD KEY FOR GSYS RECORD                                     00625200
           MOVE CA-EST-CLM-NUM                                          00625300
                             TO GPA-TRX-CLM-NUM.                        00625400
           MOVE CA-SYSTEM-DATE                                          00625500
                             TO GPA-TRX-DATE.                           00625600
           MOVE 'PA'         TO GPA-TRX-TRANS-TYPE.                     00625700
                                                                        00625800
      *** BUILD THE GSYS H04 ACCOUNTING RECORD                          00625900
      *** FOR GROUP LIFE PLAN, BUILD AN H05 INSTEAD OF AN H04           00626000
                                                                        00626100
           IF WS-SL-GROUP-LIFE                                          00626200
              MOVE 'H05 '    TO GPA-H04-TRANS-TYPE                      00626300
           ELSE                                                         00626400
              MOVE 'H04 '    TO GPA-H04-TRANS-TYPE.                     00626500
           IF WS-POL-SERIES-1 = 4                                       00626600
               MOVE '040'    TO GPA-H04-POLICY-NUM-3                    00626700
           ELSE                                                         00626800
               MOVE '000'    TO GPA-H04-POLICY-NUM-3                    00626900
           END-IF.                                                      00627000
           IF WS-SL-GROUP-LIFE                                          00627100
              MOVE SPACES    TO GPA-H04-POLICY-NUM-7                    00627200
           ELSE                                                         00627300
AC9430*****   MOVE WS-POLICY-7-SL                                       00627400
AC9430        MOVE CA-EST-POL-NUM(5:7)                                  00627500
                             TO GPA-H04-POLICY-NUM-7.                   00627600
           MOVE SPACES TO WS-NAME-STRING.                               00627700
      ***EAB*** MOVE INITIAL OF FIRST AND LAST NAME TO GPA-H04-INS-INIT 00627800
           MOVE CT-NAME TO WS-NAME-STRING.                              00627900
           MOVE WS-NAME-STR(1) TO WS-LAST-INITIAL.                      00628000
           PERFORM                                                      00628100
            VARYING WS-INIT-CNT FROM 1 BY 1                             00628200
              UNTIL WS-INIT-CNT > 30                                    00628300
                 OR WS-NAME-STR(WS-INIT-CNT) = ','                      00628400
           END-PERFORM.                                                 00628500
Q17189     IF WS-INIT-CNT < 31                                          00628600
             IF WS-NAME-STR(WS-INIT-CNT) = ','                          00628700
                 ADD 1 TO WS-INIT-CNT                                   00628800
                 IF WS-NAME-STR(WS-INIT-CNT) = SPACE                    00628900
                     ADD 1 TO WS-INIT-CNT                               00629000
                     MOVE WS-NAME-STR(WS-INIT-CNT) TO WS-FIRST-INITIAL  00629100
                 ELSE                                                   00629200
                     MOVE WS-NAME-STR(WS-INIT-CNT) TO WS-FIRST-INITIAL  00629300
             ELSE                                                       00629400
                 MOVE SPACE TO WS-FIRST-INITIAL                         00629500
Q17189*      END-IF.                                                    00629600
Q17189       END-IF                                                     00629700
Q17189     END-IF.                                                      00629800
           MOVE WS-INITIALS TO GPA-H04-INS-INIT.                        00629900
           IF DE-PLAN-CODE (WS-DE-SUB) = 'LOAN'                         00630000
              MOVE DI-DEATH-MO TO GPA-H04-TRANS-MM                      00630100
              MOVE DI-DEATH-DY TO GPA-H04-TRANS-DD                      00630200
              COMPUTE WS-WORK-YEAR =                                    00630300
                  DI-DEATH-YR - 1800                                    00630400
              MOVE WS-WORK-YEAR TO GPA-H04-TRANS-YYY                    00630500
           ELSE                                                         00630600
              MOVE CA-SYSTEM-MO TO GPA-H04-TRANS-MM                     00630700
              MOVE CA-SYSTEM-DY TO GPA-H04-TRANS-DD                     00630800
              COMPUTE WS-WORK-YEAR =                                    00630900
                 CA-SYSTEM-YR - 1800                                    00631000
              MOVE WS-WORK-YEAR TO GPA-H04-TRANS-YYY                    00631100
           END-IF.                                                      00631200
           MOVE 'SYS'        TO GPA-H04-EMP-CD.                         00631300
           MOVE PI-ISSUE-STATE                                          00631400
                             TO GPA-H04-STATE.                          00631500
           MOVE '3'          TO GPA-H04-CATEGORY.                       00631600
           MOVE '000'        TO GPA-H04-ACCOUNT-3.                      00631700
           MOVE 'ACTS CLAIM' TO GPA-H04-DESC.                           00631800
           MOVE SPACES       TO GPA-H04-UR-FILLER-9.                    00631900
           MOVE 'SYSACTS '   TO GPA-H04-UR-FILLER-8.                    00632000
           MOVE 'ACTSCLMP'   TO GPA-H04-USER.                           00632100
           MOVE ZEROES       TO GPA-H04-TRANS-NO.                       00632200
           MOVE SPACES       TO GPA-H04-MUNI                            00632300
                                GPA-H04-CHECK                           00632400
                                GPA-H04-CHECK-NO                        00632500
                                GPA-H04-DEL-CHK-CD                      00632600
                                GPA-H04-EARN-CODE                       00632700
                                GPA-H04-AGENT-CODE                      00632800
                                GPA-H04-DEPOSIT-CODE                    00632900
                                GPA-H04-DESC-NUM                        00633000
                                GPA-H04-G-ASSET                         00633100
                                GPA-H04-FM-TRAN                         00633200
                                GPA-H04-CONSOLE.                        00633300
                                                                        00633400
      **** AMOUNT MAY HAVE BEEN SPLIT INTO SEVERAL H04S                 00633500
      **** IF IT WAS > 999,999.99                                       00633600
           MOVE +1 TO WS-GSYS-H04-COUNT.                                00633700
           PERFORM 3357-WRITE-GSYS-TRANS THRU 3357-EXIT                 00633800
              UNTIL WS-GSYS-H04-COUNT > WS-GSYS-DIVIDE-BY.              00633900
                                                                        00634000
       3350-EXIT.                                                       00634100
           EXIT.                                                        00634200
                                                                        00634300
       3351-DE-PLAN-LOAN.                                               00634400
      ****                                                              00634500
      * THE LOGIC FOR THE DEBIT HAS BEEN COMMENTED OUT BECAUSE WE DON'T 00634600
      * THINK IT IS NECESSARY                                           00634700
      *                                                                 00634800
      *    MOVE 'D' TO GPA-H04-DEBIT-CREDIT.                            00634900
      *    COMPUTE GPA-H04-AMOUNT =                                     00635000
      *            (DE-BEN-AMT(WS-DE-SUB) * -1) - WS-LOINTRF-AMT.       00635100
      *    EVALUATE CA-NON-ADMN-POLICY                                  00635200
      *        WHEN 'A'                                                 00635300
      *            IF CL-PLAN-CODE = 'SLABR'                            00635400
      *             OR CL-PLAN-CODE = 'SSABR'                           00635500
      *                MOVE '1230150YBZ' TO GPA-H04-ACCOUNT-10          00635600
      *            ELSE                                                 00635700
      *                IF CL-PLAN-CODE = 'SLGPLIF'                      00635800
      *                    MOVE '1230050000' TO GPA-H04-ACCOUNT-10      00635900
      *                ELSE                                             00636000
      *                    MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10      00636100
      *                END-IF                                           00636200
      *            END-IF                                               00636300
      *        WHEN 'B'                                                 00636400
      *            IF CL-PLAN-CODE = 'SLABR'                            00636500
      *             OR CL-PLAN-CODE = 'SSABR'                           00636600
      *                MOVE '1230150YAZ' TO GPA-H04-ACCOUNT-10          00636700
      *            ELSE                                                 00636800
      *                MOVE '1230150YIZ' TO GPA-H04-ACCOUNT-10          00636900
      *            END-IF                                               00637000
      *    END-EVALUATE.                                                00637100
      *    PERFORM 3350-BUILD-GSYS-TRANS.                               00637200
      ***                                                               00637300
      *** END DEBIT LOGIC                                               00637400
      ***                                                               00637500
           MOVE 'C' TO GPA-H04-DEBIT-CREDIT.                            00637600
           MOVE '1302803000' TO GPA-H04-ACCOUNT-10.                     00637700
           PERFORM 3350-BUILD-GSYS-TRANS.                               00637800
                                                                        00637900
       3351-EXIT.                                                       00638000
           EXIT.                                                        00638100
                                                                        00638200
       3352-DE-PLAN-COMMON.                                             00638300
AC9430*****EVALUATE CA-NON-ADMN-POLICY                                  00638400
AC9430*****    WHEN 'A'                                                 00638500
AC9430     EVALUATE TRUE                                                00638600
AC9430         WHEN CA-LOB-FIXED-ANNUITY                                00638700
                   IF WS-POL-SERIES-1 = 4                               00638800
                       MOVE '1230150000' TO GPA-H04-ACCOUNT-10          00638900
                   ELSE                                                 00639000
                     IF CL-PLAN-CODE = 'SLABR'                          00639100
                      OR CL-PLAN-CODE = 'SSABR'                         00639200
                         MOVE '1230150YBZ' TO GPA-H04-ACCOUNT-10        00639300
                     ELSE                                               00639400
                         IF CL-PLAN-CODE = 'SLGPLIF'                    00639500
                             MOVE '1230050000' TO GPA-H04-ACCOUNT-10    00639600
                         ELSE                                           00639700
                             MOVE '1230150YTZ' TO GPA-H04-ACCOUNT-10    00639800
                         END-IF                                         00639900
                     END-IF                                             00640000
                   END-IF                                               00640100
AC9430*****    WHEN 'B'                                                 00640200
AC9430         WHEN CA-LOB-VARIABLE-ANNUITY                             00640300
                   IF WS-POL-SERIES-1 = 4                               00640400
                       MOVE '1230150000' TO GPA-H04-ACCOUNT-10          00640500
                   ELSE                                                 00640600
                     IF CL-PLAN-CODE = 'SLABR'                          00640700
                      OR CL-PLAN-CODE = 'SSABR'                         00640800
                         MOVE '1230150YAZ' TO GPA-H04-ACCOUNT-10        00640900
                     ELSE                                               00641000
                         MOVE '1230150YIZ' TO GPA-H04-ACCOUNT-10        00641100
                     END-IF                                             00641200
                   END-IF                                               00641300
           END-EVALUATE.                                                00641400
                                                                        00641500
       3352-EXIT.                                                       00641600
           EXIT.                                                        00641700
                                                                        00641800
       3353-TOTAL-BENEFIT.                                              00641900
#7549 *    MOVE '2310518000' TO GPA-H04-ACCOUNT-10.                     00642000
#7549      MOVE '2310818000' TO GPA-H04-ACCOUNT-10.                     00642100
           MOVE 'C' TO GPA-H04-DEBIT-CREDIT.                            00642200
      **** GSYS CAN NOT HANDLE AMOUNTS > $999,999.99                    00642300
      **** IF ACTS AMOUNT IS > $999,999.99, NEED TO SPLIT INTO          00642400
      **** MULTIPLE H04S                                                00642500
           MOVE +1 TO WS-GSYS-DIVIDE-BY.                                00642600
           MOVE ZERO TO WS-GSYS-EXTRA-CENTS.                            00642700
           MOVE DE-TOT-BEN TO WS-ACTS-AMOUNT.                           00642800
           PERFORM 3356-CALC-GSYS-AMOUNT THRU 3356-EXIT.                00642900
           PERFORM 3350-BUILD-GSYS-TRANS.                               00643000
                                                                        00643100
       3353-EXIT.                                                       00643200
           EXIT.                                                        00643300
                                                                        00643400
       3354-GET-TIME.                                                   00643500
                                                                        00643600
           EXEC CICS ASKTIME                                            00643700
               ABSTIME(WS-ASK-TIME)                                     00643800
           END-EXEC.                                                    00643900
           EXEC CICS FORMATTIME                                         00644000
               ABSTIME(WS-ASK-TIME)                                     00644100
               TIME(WS-TIME)                                            00644200
               TIMESEP                                                  00644300
           END-EXEC.                                                    00644400
                                                                        00644500
       3354-EXIT.                                                       00644600
           EXIT.                                                        00644700
                                                                        00644800
       3355-GET-GSYS-CLIENT-NAME.                                       00644900
                                                                        00645000
           MOVE WS-CT-ITEM-NUM TO CA-ITEM-NUM.                          00645100
           MOVE WS-CT-RECORD-LENGTH TO CA-RECORD-LENGTH.                00645200
           MOVE 'RD' TO CA-ACCESS-TYPE.                                 00645300
           MOVE 'F' TO CA-READ-TYPE.                                    00645400
           MOVE 'CT' TO CA-CT-REC-TYPE.                                 00645500
           MOVE ZEROS TO CA-CT-REC-NUM.                                 00645600
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00645700
           MOVE LOW-VALUES TO CT-INFO.                                  00645800
           IF NOT CL-BASIC                                              00645900
               MOVE PI-PRIM-INSURED-CT-NUM TO CA-CT-NUM.                00646000
           PERFORM 4200-ACCESS-CLIENT-FILE THRU 4200-EXIT.              00646100
           IF CA-ACCESS-MSG-CODE = 'E005'                               00646200
               MOVE SPACES TO CT-NAME                                   00646300
           ELSE                                                         00646400
               MOVE CA-ITEM-NUM TO WS-CT-ITEM-NUM                       00646500
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00646600
               MOVE WS-RECORD TO CT-INFO.                               00646700
                                                                        00646800
       3355-EXIT.                                                       00646900
           EXIT.                                                        00647000
                                                                        00647100
       3356-CALC-GSYS-AMOUNT.                                           00647200
           IF WS-ACTS-AMOUNT > 999999.99                                00647300
              MOVE +2 TO WS-GSYS-DIVIDE-BY                              00647400
              MOVE WS-ACTS-AMOUNT TO WS-GSYS-SPLIT-AMOUNT               00647500
              PERFORM UNTIL                                             00647600
                 WS-GSYS-SPLIT-AMOUNT < 1000000.00                      00647700
                 COMPUTE WS-GSYS-SPLIT-AMOUNT =                         00647800
                   WS-ACTS-AMOUNT / WS-GSYS-DIVIDE-BY                   00647900
                 IF WS-GSYS-SPLIT-AMOUNT > 999999.99                    00648000
                    ADD +2 TO WS-GSYS-DIVIDE-BY                         00648100
                 END-IF                                                 00648200
              END-PERFORM                                               00648300
              COMPUTE WS-GSYS-TOTAL-BEN =                               00648400
                  WS-GSYS-SPLIT-AMOUNT * WS-GSYS-DIVIDE-BY              00648500
              COMPUTE WS-GSYS-EXTRA-CENTS =                             00648600
                  WS-ACTS-AMOUNT - WS-GSYS-TOTAL-BEN                    00648700
           ELSE                                                         00648800
              MOVE WS-ACTS-AMOUNT TO WS-GSYS-SPLIT-AMOUNT               00648900
           END-IF.                                                      00649000
       3356-EXIT.                                                       00649100
           EXIT.                                                        00649200
                                                                        00649300
       3357-WRITE-GSYS-TRANS.                                           00649400
                                                                        00649500
      *** ESTABLISH UNIQUE TIME                                         00649600
           MOVE WS-TIME      TO WS-HOLD-TIME.                           00649700
           PERFORM 3354-GET-TIME THRU 3354-EXIT                         00649800
              UNTIL WS-TIME NOT = WS-HOLD-TIME.                         00649900
           MOVE WS-TIME      TO GPA-TRX-TIME.                           00650000
                                                                        00650100
           IF WS-GSYS-H04-COUNT = +1                                    00650200
              COMPUTE GPA-H04-AMOUNT =                                  00650300
                 WS-GSYS-SPLIT-AMOUNT + WS-GSYS-EXTRA-CENTS             00650400
              IF DE-PLAN-CODE (WS-DE-SUB) = 'LOAN'                      00650500
                 COMPUTE GPA-H04-AMOUNT =                               00650600
                     GPA-H04-AMOUNT - WS-LOINTRF-AMT                    00650700
              END-IF                                                    00650800
           ELSE                                                         00650900
              MOVE WS-GSYS-SPLIT-AMOUNT TO GPA-H04-AMOUNT               00651000
           END-IF.                                                      00651100
                                                                        00651200
           EXEC CICS WRITE                                              00651300
               DATASET('ACTGSYS')                                       00651400
               FROM(GSYS-POLICY-ACCT)                                   00651500
               LENGTH(WS-GSYS-TRX-LENGTH)                               00651600
               RIDFLD(GPA-TRX-KEY)                                      00651700
               KEYLENGTH(WS-GSYS-TRX-KEY-LENGTH)                        00651800
               NOHANDLE                                                 00651900
               RESP(WS-RESPONSE-CODE)                                   00652000
           END-EXEC.                                                    00652100
                                                                        00652200
      *  CHECK FOR ERRORS                                               00652300
           IF WS-RESPONSE-CODE NOT EQUAL ZEROES                         00652400
               PERFORM 5000-ROLLBACK THRU 5000-EXIT                     00652500
               IF WS-RESPONSE-CODE = DFHRESP(NOTOPEN)                   00652600
                   MOVE 'ACTGSYS: FILE NOT OPEN' TO MESSAG1O            00652700
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00652800
                   MOVE RED-COLOR TO MESSAG1C                           00652900
                   PERFORM 8000-SEND-PAGE                               00653000
               ELSE IF WS-RESPONSE-CODE = DFHRESP(NOSPACE)              00653100
                   MOVE 'ACTGSYS: FILE FULL' TO MESSAG1O                00653200
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00653300
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00653400
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00653500
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00653600
                   PERFORM 8000-SEND-PAGE                               00653700
               ELSE IF WS-RESPONSE-CODE = DFHRESP(DUPREC)               00653800
                   MOVE 'ACTGSYS: DUPLICATE REC' TO MESSAG1O            00653900
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00654000
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00654100
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00654200
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00654300
                   PERFORM 8000-SEND-PAGE                               00654400
               ELSE                                                     00654500
                   MOVE 'ACTGSYS: ERROR    ' TO MESSAG1O                00654600
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00654700
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00654800
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00654900
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00655000
                   PERFORM 8000-SEND-PAGE.                              00655100
                                                                        00655200
           ADD +1 TO WS-GSYS-H04-COUNT.                                 00655300
                                                                        00655400
       3357-EXIT.                                                       00655500
           EXIT.                                                        00655600
       EJECT                                                            00655700
      ***********************************************************       00655800
      *            A D D   N O N - C O V   V A L U E            *       00655900
      ***********************************************************       00656000
       3400-PF10-FUNCTION.                                              00656100
                                                                        00656200
      *  CHECK LAST REQUEST FOR NEW SCREEN                              00656300
           IF CA-LAST-REQ-NEW                                           00656400
               MOVE +0 TO DE-BEN-OCCUR-NUM                              00656500
               MOVE 'Y' TO WS-NEW-RECORD-FLAG                           00656600
           ELSE                                                         00656700
               MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM                       00656800
               MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH             00656900
               PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                00657000
               MOVE WS-RECORD TO WS-ORG-RECORD-DE                       00657100
               MOVE WS-RECORD-INFO TO DE-INFO.                          00657200
                                                                        00657300
      *  NON-COV VALUES CANNOT BE ADDED TO REV OR ADJ                   00657400
           IF DE-REV OR DE-ADJ                                          00657500
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00657600
               MOVE 'EC30' TO WS-MESSAGE-CODE-HOLD                      00657700
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00657800
               PERFORM 2200-SET-MDT THRU 2200-EXIT                      00657900
               PERFORM 8000-SEND-PAGE.                                  00658000
                                                                        00658100
      *  READ THE CURRENT CL RECORD FROM TEMP STORAGE                   00658200
           MOVE WS-CL-ITEM-NUM TO CA-ITEM-NUM.                          00658300
           MOVE WS-CL-RECORD-LENGTH TO CA-RECORD-LENGTH.                00658400
                                                                        00658500
           IF WS-CL-ITEM-NUM = 0                                        00658600
               MOVE 'RD' TO CA-ACCESS-TYPE                              00658700
               MOVE 'F' TO CA-READ-TYPE                                 00658800
               MOVE CA-EST-CT-NUM TO CA-AK-CT-NUM                       00658900
               MOVE CA-EST-POL-NUM TO CA-AK-POL-NUM                     00659000
               MOVE CA-EST-CLM-NUM TO CA-AK-CLM-NUM                     00659100
               MOVE '05' TO CA-AK-REC-CODE                              00659200
               MOVE '001' TO CA-AK-REC-NUM                              00659300
               MOVE SPACES TO CA-ACCESS-MSG-CODE                        00659400
               PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT           00659500
               MOVE CA-ITEM-NUM TO WS-CL-ITEM-NUM.                      00659600
                                                                        00659700
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00659800
                                                                        00659900
      *  SAVE ORG RECORD IN TS                                          00660000
           MOVE WS-RECORD TO WS-ORG-RECORD-CL.                          00660100
           MOVE WS-RECORD-INFO TO CL-INFO.                              00660200
                                                                        00660300
      *  CREATE TRX REG ENTRY                                           00660400
           MOVE CA-EST-CLM-NUM TO WS-TRX-UPD-CLM-NUM.                   00660500
           MOVE CA-SYSTEM-DATE TO WS-TRX-UPD-DT.                        00660600
           EXEC CICS ASKTIME                                            00660700
               ABSTIME(WS-ASK-TIME)                                     00660800
           END-EXEC.                                                    00660900
           EXEC CICS FORMATTIME                                         00661000
               ABSTIME(WS-ASK-TIME)                                     00661100
               TIME(WS-TIME)                                            00661200
               TIMESEP                                                  00661300
           END-EXEC.                                                    00661400
           MOVE WS-TIME TO WS-TRX-UPD-TIME.                             00661500
           MOVE CA-EXAM TO WS-TRX-UPD-EXAM.                             00661600
           MOVE CL-LAST-ACT-DT TO WS-TRX-UPD-LAST-CHANGE-DT.            00661700
           MOVE 'ASPD' TO WS-TRX-UPD-SCREEN-ID.                         00661800
           MOVE SPACES TO WS-TRX-UPD-FIELD-NAME                         00661900
                          WS-TRX-UPD-OLD-VALUE                          00662000
                          WS-TRX-UPD-NEW-VALUE.                         00662100
                                                                        00662200
           IF CA-LAST-REQ-NEW                                           00662300
               MOVE +0 TO DE-TOT-BEN.                                   00662400
                                                                        00662500
      *  CREATE NEW COV LINE                                            00662600
           ADD +1 TO DE-BEN-OCCUR-NUM.                                  00662700
           IF DE-BEN-OCCUR-NUM > 16                                     00662800
               MOVE 'Y' TO WS-SCREEN-ERRORS-FLAG                        00662900
               MOVE 'EC14' TO WS-MESSAGE-CODE-HOLD                      00663000
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT            00663100
               PERFORM 2200-SET-MDT THRU 2200-EXIT                      00663200
               PERFORM 8000-SEND-PAGE.                                  00663300
           MOVE DE-BEN-OCCUR-NUM TO WS-SUB-COV.                         00663400
           MOVE '???????' TO DE-PLAN-CODE(WS-SUB-COV).                  00663500
           MOVE ZERO TO DE-COV-REC-NUM(WS-SUB-COV).                     00663600
           MOVE 'NC' TO DE-STS(WS-SUB-COV).                             00663700
           MOVE +0 TO DE-BEN-AMT(WS-SUB-COV)                            00663800
                      DE-BEN-AMT-REV(WS-SUB-COV).                       00663900
           MOVE SPACES TO DE-REAS-CODE(WS-SUB-COV).                     00664000
           MOVE 'Y' TO WS-REBUILD-FLAG.                                 00664100
                                                                        00664200
      *  CREATE TRX REG RECORD                                          00664300
           MOVE WS-TRX-UPD-REC TO TRX-UPD-REC.                          00664400
           MOVE 'NEW LINE' TO TRX-UPD-FIELD-NAME.                       00664500
           MOVE SPACES TO TRX-UPD-OLD-VALUE.                            00664600
           MOVE WS-SUB-COV TO TRX-UPD-NEW-VALUE.                        00664700
           PERFORM 4600-HOLD-TRX THRU 4600-EXIT                         00664800
                                                                        00664900
      *  UPDATE MASTER FILE                                             00665000
           IF CA-LAST-REQ-NEW OR CA-LAST-REQ-REV OR CA-LAST-REQ-ADJ     00665100
               PERFORM 2780-ADD-NEW-RECORD THRU 2780-EXIT               00665200
               MOVE ' ' TO CA-LAST-REQUEST                              00665300
           ELSE                                                         00665400
               PERFORM 2790-REWRITE-RECORD THRU 2790-EXIT.              00665500
                                                                        00665600
           MOVE 'I001' TO WS-MESSAGE-CODE-HOLD.                         00665700
           PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.               00665800
                                                                        00665900
      *  WRITE THE TRX REG RECORDS TO FILE                              00666000
           PERFORM 4610-WRITE-TRX-RPT THRU 4610-EXIT                    00666100
               VARYING WS-SUB FROM +1 BY +1                             00666200
               UNTIL WS-SUB > WS-TRX-HOLD-NUM.                          00666300
                                                                        00666400
           IF WS-REBUILD                                                00666500
               MOVE CA-PREV-PAGE-NUM TO WS-BUILD-PAGE-IND               00666600
               PERFORM 1100-BUILD-SCREEN                                00666700
           ELSE                                                         00666800
               PERFORM 8000-SEND-PAGE.                                  00666900
                                                                        00667000
       3400-EXIT.                                                       00667100
           EXIT.                                                        00667200
       EJECT                                                            00667300
      ***********************************************************       00667400
      *            D E L E T E   F U N C T I O N                *       00667500
      ***********************************************************       00667600
       3500-PF11-FUNCTION.                                              00667700
                                                                        00667800
           IF NOT CA-LAST-REQ-DEL                                       00667900
               PERFORM 3510-CHECK-RECORD THRU 3510-EXIT                 00668000
               MOVE 'D' TO CA-LAST-REQUEST                              00668100
               MOVE 'PF11 TO CONFIRM DELETE' TO MESSAG1O                00668200
               MOVE YELLOW-COLOR TO MESSAG1C                            00668300
               MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG                  00668400
               PERFORM 8000-SEND-PAGE.                                  00668500
                                                                        00668600
      *  READ DISPLAYED DE RECORD                                       00668700
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00668800
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00668900
           MOVE 'RD' TO CA-ACCESS-TYPE.                                 00669000
           MOVE 'F' TO CA-READ-TYPE.                                    00669100
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00669200
           MOVE WS-DISPLAYED-RECORD-KEY TO CA-AK-FILE-KEY.              00669300
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00669400
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00669500
           MOVE WS-RECORD TO WS-ORG-RECORD-DE.                          00669600
           MOVE WS-RECORD-INFO TO DE-INFO.                              00669700
                                                                        00669800
      *  READ THE CURRENT CL RECORD FROM TEMP STORAGE                   00669900
           MOVE WS-CL-ITEM-NUM TO CA-ITEM-NUM.                          00670000
           MOVE WS-CL-RECORD-LENGTH TO CA-RECORD-LENGTH.                00670100
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00670200
           MOVE WS-RECORD-INFO TO CL-INFO.                              00670300
                                                                        00670400
      *  CREATE TRX TRX ENTRY                                           00670500
           MOVE CA-EST-CLM-NUM TO TRX-UPD-CLM-NUM.                      00670600
           MOVE CA-SYSTEM-DATE TO TRX-UPD-DT.                           00670700
           EXEC CICS ASKTIME                                            00670800
               ABSTIME(WS-ASK-TIME)                                     00670900
           END-EXEC.                                                    00671000
           EXEC CICS FORMATTIME                                         00671100
               ABSTIME(WS-ASK-TIME)                                     00671200
               TIME(WS-TIME)                                            00671300
               TIMESEP                                                  00671400
           END-EXEC.                                                    00671500
           MOVE WS-TIME TO TRX-UPD-TIME.                                00671600
           MOVE CA-EXAM TO TRX-UPD-EXAM.                                00671700
           MOVE CL-LAST-ACT-DT TO TRX-UPD-LAST-CHANGE-DT.               00671800
           MOVE 'ASPD' TO TRX-UPD-SCREEN-ID.                            00671900
           IF DE-REV                                                    00672000
               MOVE 'DELETE/REV     ' TO TRX-UPD-TYPE                   00672100
           ELSE IF DE-ADJ                                               00672200
               MOVE 'DELETE/ADJ     ' TO TRX-UPD-TYPE                   00672300
           ELSE                                                         00672400
               MOVE 'DELETE         ' TO TRX-UPD-TYPE.                  00672500
           MOVE WS-ORG-RECORD-DE-KEY TO TRX-UPD-DEL-KEY.                00672600
           PERFORM 4600-HOLD-TRX THRU 4600-EXIT.                        00672700
           PERFORM 4610-WRITE-TRX-RPT THRU 4610-EXIT                    00672800
               VARYING WS-SUB FROM +1 BY +1                             00672900
               UNTIL WS-SUB > WS-TRX-HOLD-NUM.                          00673000
                                                                        00673100
           MOVE 'DL' TO CA-ACCESS-TYPE.                                 00673200
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00673300
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00673400
           MOVE WS-ORG-RECORD-DE-KEY TO CA-AK-FILE-KEY.                 00673500
                                                                        00673600
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00673700
                                                                        00673800
      *  XCTL TO ASPC PROGRAM                                           00673900
           MOVE ' ' TO CA-LAST-REQUEST.                                 00674000
                                                                        00674100
           PERFORM 4940-DELETE-TS-QUEUE THRU 4940-EXIT.                 00674200
           PERFORM 6300-XCTL-ASPC.                                      00674300
                                                                        00674400
       3500-EXIT.                                                       00674500
           EXIT.                                                        00674600
                                                                        00674700
                                                                        00674800
       3510-CHECK-RECORD.                                               00674900
                                                                        00675000
      *  READ DISPLAYED DE RECORD                                       00675100
           MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM.                          00675200
           MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH.                00675300
                                                                        00675400
           MOVE 'RD' TO CA-ACCESS-TYPE.                                 00675500
           MOVE 'F' TO CA-READ-TYPE.                                    00675600
           MOVE SPACES TO CA-ACCESS-MSG-CODE.                           00675700
           MOVE WS-DISPLAYED-RECORD-KEY TO CA-AK-FILE-KEY.              00675800
           PERFORM 4000-ACCESS-MASTER-FILE THRU 4000-EXIT.              00675900
                                                                        00676000
AC8838     IF CA-AK-REC-CODE NOT = '50'                                 00676100
AC8838        MOVE 'ONLY PYMT REC CAN' TO MESSAG1O                      00676200
AC8838        MOVE 'BE DELETED' TO MESSAG2O                             00676300
AC8838        MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG                   00676400
AC8838        MOVE YELLOW-COLOR TO MESSAG1C MESSAG2C                    00676500
AC8838        PERFORM 8000-SEND-PAGE                                    00676600
AC8838     END-IF.                                                      00676700
                                                                        00676800
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00676900
                                                                        00677000
           MOVE WS-RECORD TO WS-ORG-RECORD-DE.                          00677100
           MOVE WS-RECORD-INFO TO DE-INFO.                              00677200
                                                                        00677300
           IF DE-ORIG                                                   00677400
               IF (DE-PAID-DT NUMERIC) AND                              00677500
                  (DE-PAID-DT NOT = CA-SYSTEM-DATE)                     00677600
                       MOVE 'CANNOT DEL PAID REC' TO MESSAG1O           00677700
                       MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG          00677800
                       MOVE YELLOW-COLOR TO MESSAG1C                    00677900
                       PERFORM 8000-SEND-PAGE                           00678000
               ELSE                                                     00678100
                   NEXT SENTENCE                                        00678200
           ELSE                                                         00678300
               IF (DE-REV-ADJ-DT NUMERIC) AND                           00678400
                  (DE-REV-ADJ-DT NOT = CA-SYSTEM-DATE)                  00678500
                       MOVE 'CANNOT DEL PAID REC' TO MESSAG1O           00678600
                       MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG          00678700
                       MOVE YELLOW-COLOR TO MESSAG1C                    00678800
                       PERFORM 8000-SEND-PAGE.                          00678900
                                                                        00679000
       3510-EXIT.                                                       00679100
           EXIT.                                                        00679200
       EJECT                                                            00679300
      ***********************************************************       00679400
      *              E N T E R   F U N C T I O N                *       00679500
      ***********************************************************       00679600
       3600-ENTER-FUNCTION.                                             00679700
                                                                        00679800
           PERFORM 2200-SET-MDT THRU 2200-EXIT.                         00679900
           PERFORM 8000-SEND-PAGE.                                      00680000
                                                                        00680100
       3600-EXIT.                                                       00680200
           EXIT.                                                        00680300
       EJECT                                                            00680400
      ***********************************************************       00680500
      *            L O A D   M E S S A G E S                    *       00680600
      ***********************************************************       00680700
       3900-LOAD-MESSAGE-CODE.                                          00680800
                                                                        00680900
      *  IF LESS THAN EIGHT MESSAGES LOADED, LOAD NEW MESSAGE           00681000
      * < 8                                                             00681100
           IF LESS-THAN-EIGHT-MESSAGES                                  00681200
               COMPUTE WS-MESSAGE-COUNT = WS-MESSAGE-COUNT + 1          00681300
               MOVE WS-MESSAGE-CODE-HOLD                                00681400
                   TO WS-MESSAGE-CODE(WS-MESSAGE-COUNT)                 00681500
           ELSE                                                         00681600
                                                                        00681700
      *  INSERT EXCESS MESSAGE ON EIGHTH MESSAGE                        00681800
      * = 8                                                             00681900
           IF MESSAGE-NUMBER-EIGHT                                      00682000
               COMPUTE WS-MESSAGE-COUNT = WS-MESSAGE-COUNT + 1          00682100
               MOVE 'I999' TO WS-MESSAGE-CODE(9).                       00682200
                                                                        00682300
      *  DO NOT ATTEMPT TO LOAD MESSAGE.                                00682400
      * > 8                                                             00682500
                                                                        00682600
       3900-EXIT.                                                       00682700
           EXIT.                                                        00682800
           EJECT                                                        00682900
      ***********************************************************       00683000
      *           A C C E S S   M A S T E R   F I L E           *       00683100
      ***********************************************************       00683200
       4000-ACCESS-MASTER-FILE.                                         00683300
                                                                        00683400
           EXEC CICS LINK                                               00683500
                     PROGRAM('D680MF00')                                00683600
                     COMMAREA(DFHCOMMAREA)                              00683700
                     LENGTH(EIBCALEN)                                   00683800
           END-EXEC.                                                    00683900
                                                                        00684000
           IF CA-ACCESS-MSG-CODE NOT EQUAL SPACES                       00684100
               PERFORM 5000-ROLLBACK THRU 5000-EXIT                     00684200
               IF CA-ACCESS-MSG-CODE = 'NOPN'                           00684300
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00684400
                   MOVE RED-COLOR TO MESSAG1C                           00684500
                   MOVE 'ACTMAST : FILE NOT OPEN' TO MESSAG1O           00684600
                   PERFORM 8000-SEND-PAGE                               00684700
               ELSE                                                     00684800
                   MOVE CA-ACCESS-MSG-CODE TO WS-MESSAGE-CODE-HOLD      00684900
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00685000
                   PERFORM 8000-SEND-PAGE.                              00685100
                                                                        00685200
       4000-EXIT.                                                       00685300
           EXIT.                                                        00685400
       EJECT                                                            00685500
      ***********************************************************       00685600
      *             A C C E S S  C L I E N T  F I L E           *       00685700
      ***********************************************************       00685800
        4200-ACCESS-CLIENT-FILE.                                        00685900
                                                                        00686000
            EXEC CICS LINK                                              00686100
                      PROGRAM('D680CF00')                               00686200
                      COMMAREA(DFHCOMMAREA)                             00686300
                      LENGTH(EIBCALEN)                                  00686400
            END-EXEC.                                                   00686500
                                                                        00686600
            IF CA-ACCESS-MSG-CODE NOT EQUAL SPACES                      00686700
                PERFORM 5000-ROLLBACK THRU 5000-EXIT                    00686800
                IF CA-ACCESS-MSG-CODE = 'NOPN'                          00686900
                    MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG             00687000
                    MOVE RED-COLOR TO MESSAG1C                          00687100
                    MOVE 'ACTCTFL : FILE NOT OPEN' TO MESSAG1O          00687200
                    PERFORM 8000-SEND-PAGE                              00687300
                ELSE                                                    00687400
                    MOVE CA-ACCESS-MSG-CODE TO WS-MESSAGE-CODE-HOLD     00687500
                    PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT       00687600
                    PERFORM 8000-SEND-PAGE.                             00687700
                                                                        00687800
       4200-EXIT.                                                       00687900
           EXIT.                                                        00688000
                                                                        00688100
      ***********************************************************       00688200
      *             R E A D   P L A N  C O D E                  *       00688300
      ***********************************************************       00688400
       4550-READ-PLAN-CODE.                                             00688500
                                                                        00688600
           MOVE CA-EST-POL-NUM TO WS-PLAN-POL-NUM.                      00688700
                                                                        00688800
           MOVE WS-PLAN-CODE-AREA TO CA-GENERAL.                        00688900
                                                                        00689000
           EXEC CICS LINK                                               00689100
                     PROGRAM('D680PC00')                                00689200
                     COMMAREA(DFHCOMMAREA)                              00689300
                     LENGTH(EIBCALEN)                                   00689400
           END-EXEC.                                                    00689500
                                                                        00689600
           MOVE CA-GENERAL TO WS-PLAN-CODE-AREA.                        00689700
                                                                        00689800
           IF WS-PLAN-NOT-FOUND                                         00689900
               MOVE WS-PLAN-CODE-NUM TO PC-PLAN-DESCR                   00690000
               MOVE 'Y' TO WS-PLAN-CODE-NOT-FOUND-FLAG                  00690100
           ELSE IF WS-PLAN-FILE-NOT-OPEN                                00690200
               MOVE 'ACTPLCD : FILE NOT OPEN' TO MESSAG1O               00690300
               MOVE RED-COLOR TO MESSAG1C                               00690400
               MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG                  00690500
               PERFORM 8000-SEND-PAGE                                   00690600
           ELSE IF WS-PLAN-CRITICAL-ERROR                               00690700
               MOVE 'ACTPLCD: CRITICAL ERROR' TO MESSAG1O               00690800
               MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG2O              00690900
               MOVE RED-COLOR TO MESSAG1C MESSAG2C                      00691000
               MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG                  00691100
               PERFORM 8000-SEND-PAGE                                   00691200
           ELSE                                                         00691300
               MOVE WS-PLAN-CODE-RECORD TO PC-PLAN-CODE-REC.            00691400
                                                                        00691500
       4550-EXIT.                                                       00691600
           EXIT.                                                        00691700
       EJECT                                                            00691800
      ***********************************************************       00691900
      *       W R I T E   T R X   R P T   E X T R A C T         *       00692000
      ***********************************************************       00692100
       4600-HOLD-TRX.                                                   00692200
                                                                        00692300
           ADD +1 TO WS-TRX-HOLD-NUM.                                   00692400
           IF TRX-UPD-OCCUR-NUM = (SPACES OR LOW-VALUES)                00692500
               MOVE WS-DISPLAYED-REC-NUM TO TRX-UPD-OCCUR-NUM.          00692600
           MOVE TRX-UPD-REC TO WS-TRX-HOLD(WS-TRX-HOLD-NUM).            00692700
                                                                        00692800
       4600-EXIT.                                                       00692900
           EXIT.                                                        00693000
                                                                        00693100
                                                                        00693200
       4610-WRITE-TRX-RPT.                                              00693300
                                                                        00693400
           MOVE WS-TRX-HOLD(WS-SUB) TO TRX-UPD-REC.                     00693500
                                                                        00693600
           EXEC CICS WRITE                                              00693700
                     DATASET('ACTTREG')                                 00693800
                     FROM(TRX-UPD-REC)                                  00693900
                     LENGTH(WS-TRX-REG-LENGTH)                          00694000
                     RIDFLD(TRX-UPD-KEY)                                00694100
                     KEYLENGTH(WS-TRX-REG-KEY-LENGTH)                   00694200
                     NOHANDLE                                           00694300
                     RESP(WS-RESPONSE-CODE)                             00694400
           END-EXEC.                                                    00694500
                                                                        00694600
      *  CHECK FOR ERRORS                                               00694700
           IF WS-RESPONSE-CODE NOT EQUAL ZEROES                         00694800
               PERFORM 5000-ROLLBACK THRU 5000-EXIT                     00694900
               IF WS-RESPONSE-CODE = DFHRESP(NOTOPEN)                   00695000
                   MOVE 'ACTTREG: FILE NOT OPEN' TO MESSAG1O            00695100
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00695200
                   MOVE RED-COLOR TO MESSAG1C                           00695300
                   PERFORM 8000-SEND-PAGE                               00695400
               ELSE IF WS-RESPONSE-CODE = DFHRESP(NOSPACE)              00695500
                   MOVE 'ACTTREG: FILE FULL' TO MESSAG1O                00695600
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00695700
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00695800
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00695900
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00696000
                   PERFORM 8000-SEND-PAGE                               00696100
               ELSE IF WS-RESPONSE-CODE = DFHRESP(DUPREC)               00696200
                   MOVE 'ACTTREG: DUPLICATE REC' TO MESSAG1O            00696300
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00696400
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00696500
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00696600
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00696700
                   PERFORM 8000-SEND-PAGE                               00696800
               ELSE                                                     00696900
                   MOVE 'ACTTREG: ERROR    ' TO MESSAG1O                00697000
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00697100
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00697200
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00697300
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00697400
                   PERFORM 8000-SEND-PAGE.                              00697500
                                                                        00697600
       4610-EXIT.                                                       00697700
           EXIT.                                                        00697800
                                                                        00697900
                                                                        00698000
       4620-WRITE-TRX-RPT-PRS.                                          00698100
                                                                        00698200
           EXEC CICS WRITE                                              00698300
                     DATASET('ACTTREG')                                 00698400
                     FROM(TRX-PRS-REC)                                  00698500
                     LENGTH(WS-TRX-REG-PRS-LENGTH)                      00698600
                     RIDFLD(TRX-PRS-KEY)                                00698700
                     KEYLENGTH(WS-TRX-REG-KEY-LENGTH)                   00698800
                     NOHANDLE                                           00698900
                     RESP(WS-RESPONSE-CODE)                             00699000
           END-EXEC.                                                    00699100
                                                                        00699200
      *  CHECK FOR ERRORS                                               00699300
           IF WS-RESPONSE-CODE NOT EQUAL ZEROES                         00699400
               PERFORM 5000-ROLLBACK THRU 5000-EXIT                     00699500
               IF WS-RESPONSE-CODE = DFHRESP(NOTOPEN)                   00699600
                   MOVE 'ACTTREG: FILE NOT OPEN' TO MESSAG1O            00699700
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00699800
                   MOVE RED-COLOR TO MESSAG1C                           00699900
                   PERFORM 8000-SEND-PAGE                               00700000
               ELSE IF WS-RESPONSE-CODE = DFHRESP(NOSPACE)              00700100
                   MOVE 'ACTTREG: FILE FULL' TO MESSAG1O                00700200
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00700300
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00700400
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00700500
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00700600
                   PERFORM 8000-SEND-PAGE                               00700700
               ELSE IF WS-RESPONSE-CODE = DFHRESP(DUPREC)               00700800
                   MOVE 'ACTTREG: DUPLICATE REC' TO MESSAG1O            00700900
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00701000
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00701100
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00701200
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00701300
                   PERFORM 8000-SEND-PAGE                               00701400
               ELSE                                                     00701500
                   MOVE 'ACTTREG: ERROR    ' TO MESSAG1O                00701600
                   MOVE 'STOP PROCESSING' TO MESSAG2O                   00701700
                   MOVE 'CONTACT I.S. IMMEDIATELY' TO MESSAG3O          00701800
                   MOVE 'Y' TO WS-HOLD-ALL-OTHER-MSGS-FLAG              00701900
                   MOVE RED-COLOR TO MESSAG1C MESSAG2C MESSAG3C         00702000
                   PERFORM 8000-SEND-PAGE.                              00702100
                                                                        00702200
       4620-EXIT.                                                       00702300
           EXIT.                                                        00702400
       EJECT                                                            00702500
      ***********************************************************       00702600
      *                  R E A D   Q U E U E                    *       00702700
      ***********************************************************       00702800
       4910-READ-TS-QUEUE.                                              00702900
                                                                        00703000
           EXEC CICS READQ TS                                           00703100
                     QUEUE(WS-TS-QUEUE)                                 00703200
                     INTO(WS-RECORD)                                    00703300
                     LENGTH(CA-RECORD-LENGTH)                           00703400
                     ITEM(CA-ITEM-NUM)                                  00703500
                     NOHANDLE                                           00703600
                     RESP(WS-RESPONSE-CODE)                             00703700
           END-EXEC.                                                    00703800
                                                                        00703900
       4910-EXIT.                                                       00704000
            EXIT.                                                       00704100
       EJECT                                                            00704200
      ***********************************************************       00704300
      *                W R I T E   Q U E U E                    *       00704400
      ***********************************************************       00704500
       4920-WRITE-TS-QUEUE.                                             00704600
                                                                        00704700
           EXEC CICS WRITEQ TS                                          00704800
                     QUEUE(WS-TS-QUEUE)                                 00704900
                     FROM(WS-RECORD)                                    00705000
                     LENGTH(CA-RECORD-LENGTH)                           00705100
                     ITEM(CA-ITEM-NUM)                                  00705200
                     NOHANDLE                                           00705300
                     RESP(WS-RESPONSE-CODE)                             00705400
           END-EXEC.                                                    00705500
                                                                        00705600
       4920-EXIT.                                                       00705700
            EXIT.                                                       00705800
       EJECT                                                            00705900
      ***********************************************************       00706000
      *              R E W R I T E   Q U E U E                  *       00706100
      ***********************************************************       00706200
       4930-REWRITE-TS-QUEUE.                                           00706300
                                                                        00706400
           EXEC CICS WRITEQ TS                                          00706500
                     QUEUE(WS-TS-QUEUE)                                 00706600
                     FROM(WS-RECORD)                                    00706700
                     LENGTH(CA-RECORD-LENGTH)                           00706800
                     ITEM(CA-ITEM-NUM)                                  00706900
                     REWRITE                                            00707000
                     NOHANDLE                                           00707100
                     RESP(WS-RESPONSE-CODE)                             00707200
           END-EXEC.                                                    00707300
                                                                        00707400
       4930-EXIT.                                                       00707500
            EXIT.                                                       00707600
       EJECT                                                            00707700
      ***********************************************************       00707800
      *               D E L E T E    Q U E U E                  *       00707900
      ***********************************************************       00708000
       4940-DELETE-TS-QUEUE.                                            00708100
      *  DELETE TEMPORARY STORAGE QUEUE AND IGNORE ERROR CONDITION      00708200
      *  IF THE QUEUE TO BE DELETED DOES NOT EXIST.                     00708300
                                                                        00708400
      *  REINITIALIZE WS-COMMAREA ITEM NUMBERS                          00708500
           MOVE ZEROES TO WS-MSG-ITEM-NUM                               00708600
                          WS-DISPLAY-ITEM-NUM                           00708700
                          WS-HOLD-SCREEN-ITEM-NUM                       00708800
                          WS-BN-ITEM-NUM                                00708900
                          WS-BP-ITEM-NUM                                00709000
                          WS-CL-ITEM-NUM                                00709100
                          WS-CV-ITEM-NUM                                00709200
                          WS-DI-ITEM-NUM                                00709300
                          WS-DE-ITEM-NUM                                00709400
                          WS-PR-ITEM-NUM.                               00709500
                                                                        00709600
           EXEC CICS IGNORE                                             00709700
                     CONDITION QIDERR                                   00709800
           END-EXEC.                                                    00709900
           EXEC CICS DELETEQ                                            00710000
                     TS QUEUE(WS-TS-QUEUE)                              00710100
           END-EXEC.                                                    00710200
                                                                        00710300
       4940-EXIT.                                                       00710400
            EXIT.                                                       00710500
       EJECT                                                            00710600
      ***********************************************************       00710700
      *                  R O L L   B A C K                      *       00710800
      ***********************************************************       00710900
       5000-ROLLBACK.                                                   00711000
      *  BACK OUT ALL UPDATES TO FILES                                  00711100
                                                                        00711200
           PERFORM 2200-SET-MDT THRU 2200-EXIT.                         00711300
                                                                        00711400
           EXEC CICS                                                    00711500
               SYNCPOINT ROLLBACK                                       00711600
           END-EXEC.                                                    00711700
                                                                        00711800
       5000-EXIT.                                                       00711900
           EXIT.                                                        00712000
       EJECT                                                            00712100
      ***********************************************************       00712200
      *                  X C T L   A S B N                      *       00712300
      ***********************************************************       00712400
       5200-XCTL-ASBN.                                                  00712500
                                                                        00712600
           EXEC CICS XCTL                                               00712700
                     PROGRAM('D681BN00')                                00712800
                     COMMAREA(DFHCOMMAREA)                              00712900
                     LENGTH(EIBCALEN)                                   00713000
           END-EXEC.                                                    00713100
                                                                        00713200
      ***********************************************************       00713300
      *                  X C T L   A S C D                      *       00713400
      ***********************************************************       00713500
       5300-XCTL-ASCD.                                                  00713600
                                                                        00713700
           EXEC CICS XCTL                                               00713800
                     PROGRAM('D681CD00')                                00713900
                     COMMAREA(DFHCOMMAREA)                              00714000
                     LENGTH(EIBCALEN)                                   00714100
           END-EXEC.                                                    00714200
                                                                        00714300
       EJECT                                                            00714400
      ***********************************************************       00714500
      *                  X C T L   A S C L                      *       00714600
      ***********************************************************       00714700
       5400-XCTL-ASCL.                                                  00714800
                                                                        00714900
           EXEC CICS XCTL                                               00715000
                     PROGRAM('D681CL00')                                00715100
                     COMMAREA(DFHCOMMAREA)                              00715200
                     LENGTH(EIBCALEN)                                   00715300
           END-EXEC.                                                    00715400
                                                                        00715500
       EJECT                                                            00715600
      ***********************************************************       00715700
      *                  X C T L   A S C T                      *       00715800
      ***********************************************************       00715900
       5600-XCTL-ASCT.                                                  00716000
                                                                        00716100
           EXEC CICS XCTL                                               00716200
                     PROGRAM('D681CT00')                                00716300
                     COMMAREA(DFHCOMMAREA)                              00716400
                     LENGTH(EIBCALEN)                                   00716500
           END-EXEC.                                                    00716600
                                                                        00716700
      ***********************************************************       00716800
      *                  X C T L   A S D T                      *       00716900
      ***********************************************************       00717000
       5800-XCTL-ASDT.                                                  00717100
                                                                        00717200
           EXEC CICS XCTL                                               00717300
                     PROGRAM('D681DT00')                                00717400
                     COMMAREA(DFHCOMMAREA)                              00717500
                     LENGTH(EIBCALEN)                                   00717600
           END-EXEC.                                                    00717700
                                                                        00717800
      ***********************************************************       00717900
      *                  X C T L   A S E I                      *       00718000
      ***********************************************************       00718100
       5900-XCTL-ASEI.                                                  00718200
                                                                        00718300
           EXEC CICS XCTL                                               00718400
                     PROGRAM('D681EI00')                                00718500
                     COMMAREA(DFHCOMMAREA)                              00718600
                     LENGTH(EIBCALEN)                                   00718700
           END-EXEC.                                                    00718800
                                                                        00718900
       EJECT                                                            00719000
      ***********************************************************       00719100
      *                  X C T L   A S E M                      *       00719200
      ***********************************************************       00719300
       6000-XCTL-ASEM.                                                  00719400
                                                                        00719500
           EXEC CICS XCTL                                               00719600
                     PROGRAM('D681EM00')                                00719700
                     COMMAREA(DFHCOMMAREA)                              00719800
                     LENGTH(EIBCALEN)                                   00719900
           END-EXEC.                                                    00720000
                                                                        00720100
      ***********************************************************       00720200
      *                  X C T L   A S M M                      *       00720300
      ***********************************************************       00720400
       6200-XCTL-ASMM.                                                  00720500
                                                                        00720600
           EXEC CICS XCTL                                               00720700
                     PROGRAM('D681MM00')                                00720800
                     COMMAREA(DFHCOMMAREA)                              00720900
                     LENGTH(EIBCALEN)                                   00721000
           END-EXEC.                                                    00721100
                                                                        00721200
      ***********************************************************       00721300
      *                  X C T L   A S P C                      *       00721400
      ***********************************************************       00721500
       6300-XCTL-ASPC.                                                  00721600
                                                                        00721700
           EXEC CICS XCTL                                               00721800
                     PROGRAM('D681PC00')                                00721900
                     COMMAREA(DFHCOMMAREA)                              00722000
                     LENGTH(EIBCALEN)                                   00722100
           END-EXEC.                                                    00722200
                                                                        00722300
       EJECT                                                            00722400
      ***********************************************************       00722500
      *                  X C T L   A S P I                      *       00722600
      ***********************************************************       00722700
       6500-XCTL-ASPI.                                                  00722800
                                                                        00722900
           EXEC CICS XCTL                                               00723000
                     PROGRAM('D681PI00')                                00723100
                     COMMAREA(DFHCOMMAREA)                              00723200
                     LENGTH(EIBCALEN)                                   00723300
           END-EXEC.                                                    00723400
                                                                        00723500
       EJECT                                                            00723600
      ***********************************************************       00723700
      *                  X C T L   A S P V                      *       00723800
      ***********************************************************       00723900
       6600-XCTL-ASPV.                                                  00724000
                                                                        00724100
           EXEC CICS XCTL                                               00724200
                     PROGRAM('D681PV00')                                00724300
                     COMMAREA(DFHCOMMAREA)                              00724400
                     LENGTH(EIBCALEN)                                   00724500
           END-EXEC.                                                    00724600
                                                                        00724700
      ***********************************************************       00724800
      *                  X C T L   A S R Q                      *       00724900
      ***********************************************************       00725000
       7000-XCTL-ASRQ.                                                  00725100
                                                                        00725200
           EXEC CICS XCTL                                               00725300
                     PROGRAM('D681RQ00')                                00725400
                     COMMAREA(DFHCOMMAREA)                              00725500
                     LENGTH(EIBCALEN)                                   00725600
           END-EXEC.                                                    00725700
                                                                        00725800
      ***********************************************************       00725900
      *                  X C T L   A S U W                      *       00726000
      ***********************************************************       00726100
       7100-XCTL-ASUW.                                                  00726200
                                                                        00726300
           EXEC CICS XCTL                                               00726400
                     PROGRAM('D681UW00')                                00726500
                     COMMAREA(DFHCOMMAREA)                              00726600
                     LENGTH(EIBCALEN)                                   00726700
           END-EXEC.                                                    00726800
                                                                        00726900
       EJECT                                                            00727000
      ***********************************************************       00727100
      *                 S E N D   M A P                         *       00727200
      ***********************************************************       00727300
       8000-SEND-PAGE.                                                  00727400
                                                                        00727500
      *  UPDATE COMM AREA                                               00727600
           MOVE 'PD01' TO CA-PREV-SCREEN-ID.                            00727700
           IF WS-BUILD-PAGE-IND > 0                                     00727800
               MOVE WS-BUILD-PAGE-IND TO CA-PREV-PAGE-NUM.              00727900
                                                                        00728000
      *  IF DE RECORD NOT IN WS, READ FROM TEMP STORAGE                 00728100
           IF WS-DE-ITEM-NUM = 0                                        00728200
               NEXT SENTENCE                                            00728300
           ELSE IF DE-REC-ID = LOW-VALUES                               00728400
             MOVE WS-DE-ITEM-NUM TO CA-ITEM-NUM                         00728500
             MOVE WS-DE-RECORD-LENGTH TO CA-RECORD-LENGTH               00728600
             PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT                  00728700
             MOVE WS-RECORD-INFO TO DE-INFO.                            00728800
                                                                        00728900
      *  UNPROT ENTRY FIELDS                                            00729000
           MOVE WS-DISPLAY-TOTAL TO WS-SUB-DISPLAY.                     00729100
           IF CA-PREV-PAGE-NUM = 3                                      00729200
               SUBTRACT 8 FROM WS-SUB-DISPLAY.                          00729300
                                                                        00729400
           IF WS-SUB-DISPLAY NOT < 1                                    00729500
               IF WS-SCREEN-ERRORS                                      00729600
                   NEXT SENTENCE                                        00729700
               ELSE                                                     00729800
                   MOVE '_' TO DENTY1O                                  00729900
                   MOVE UNPROT TO DENTY1F.                              00730000
           IF WS-SUB-DISPLAY NOT < 2                                    00730100
               IF WS-SCREEN-ERRORS                                      00730200
                   NEXT SENTENCE                                        00730300
               ELSE                                                     00730400
                   MOVE '_' TO DENTY2O                                  00730500
                   MOVE UNPROT TO DENTY2F.                              00730600
           IF WS-SUB-DISPLAY NOT < 3                                    00730700
               IF WS-SCREEN-ERRORS                                      00730800
                   NEXT SENTENCE                                        00730900
               ELSE                                                     00731000
                   MOVE '_' TO DENTY3O                                  00731100
                   MOVE UNPROT TO DENTY3F.                              00731200
           IF WS-SUB-DISPLAY NOT < 4                                    00731300
               IF WS-SCREEN-ERRORS                                      00731400
                   NEXT SENTENCE                                        00731500
               ELSE                                                     00731600
                   MOVE '_' TO DENTY4O                                  00731700
                   MOVE UNPROT TO DENTY4F.                              00731800
           IF WS-SUB-DISPLAY NOT < 5                                    00731900
               IF WS-SCREEN-ERRORS                                      00732000
                   NEXT SENTENCE                                        00732100
               ELSE                                                     00732200
                   MOVE '_' TO DENTY5O                                  00732300
                   MOVE UNPROT TO DENTY5F.                              00732400
           IF WS-SUB-DISPLAY NOT < 6                                    00732500
               IF WS-SCREEN-ERRORS                                      00732600
                   NEXT SENTENCE                                        00732700
               ELSE                                                     00732800
                   MOVE '_' TO DENTY6O                                  00732900
                   MOVE UNPROT TO DENTY6F.                              00733000
           IF WS-SUB-DISPLAY NOT < 7                                    00733100
               IF WS-SCREEN-ERRORS                                      00733200
                   NEXT SENTENCE                                        00733300
               ELSE                                                     00733400
                   MOVE '_' TO DENTY7O                                  00733500
                   MOVE UNPROT TO DENTY7F.                              00733600
           IF WS-SUB-DISPLAY NOT < 8                                    00733700
               IF WS-SCREEN-ERRORS                                      00733800
                   NEXT SENTENCE                                        00733900
               ELSE                                                     00734000
                   MOVE '_' TO DENTY8O                                  00734100
                   MOVE UNPROT TO DENTY8F.                              00734200
                                                                        00734300
           PERFORM 8001-OPEN-UPD-FIELDS THRU 8001-EXIT.                 00734400
                                                                        00734500
      *  IF NOT UPDATABLE PROT THE SCREEN                               00734600
           IF CA-ASPC-BROWSE OR CA-NOT-UPDATABLE OR WS-PYMT-PROT        00734700
               PERFORM 8050-PROTECT-SCREEN THRU 8050-EXIT               00734800
           ELSE IF DE-ORIG                                              00734900
               MOVE PROT-DARK TO REVLABF                                00735000
                                 REVDTF                                 00735100
                                 REVAREAF                               00735200
                                 REVAMT1F                               00735300
                                 REVAMT2F                               00735400
                                 REVAMT3F                               00735500
                                 REVAMT4F                               00735600
                                 REVAMT5F                               00735700
                                 REVAMT6F                               00735800
                                 REVAMT7F                               00735900
                                 REVAMT8F                               00736000
                                 HEADERF                                00736100
                                 REASLABF                               00736200
               IF (DE-PAID-DT NUMERIC) AND (DE-PAID-DT NOT = ZEROES)    00736300
                   PERFORM 8050-PROTECT-SCREEN THRU 8050-EXIT           00736400
               ELSE                                                     00736500
                   NEXT SENTENCE                                        00736600
           ELSE                                                         00736700
               MOVE PROT TO PROAMT1F                                    00736800
                            PROAMT2F                                    00736900
                            PROAMT3F                                    00737000
                            PROAMT4F                                    00737100
                            PROAMT5F                                    00737200
                            PROAMT6F                                    00737300
                            PROAMT7F                                    00737400
                            PROAMT8F                                    00737500
                            STATUS1F                                    00737600
                            STATUS2F                                    00737700
                            STATUS3F                                    00737800
                            STATUS4F                                    00737900
                            STATUS5F                                    00738000
                            STATUS6F                                    00738100
                            STATUS7F                                    00738200
                            STATUS8F                                    00738300
               IF (DE-REV-ADJ-DT NUMERIC) AND                           00738400
                  (DE-REV-ADJ-DT NOT = ZEROES)                          00738500
                   PERFORM 8050-PROTECT-SCREEN THRU 8050-EXIT.          00738600
                                                                        00738700
      *  IF DTH DT IS > PAID TO DATE, SEND WARNING MESSAGE              00738800
AC1043     IF CA-LOB-TERM OR CA-LOB-WHOLE-LIFE                          00738900
               MOVE CA-HEADER-MAP TO MAPHDERI                           00739000
               PERFORM 8010-CHECK-PAID-TO-DT THRU 8010-EXIT.            00739100
                                                                        00739200
      *  BUILD PFKEY MAP                                                00739300
           PERFORM 8100-BUILD-PFK-MAP THRU 8100-EXIT.                   00739400
                                                                        00739500
      *  MOVE HEADER MAP IN THE COMMAREA TO THE HEADER MAP              00739600
           MOVE CA-HEADER-MAP TO MAPHDERI.                              00739700
                                                                        00739800
      *  BUILD TITLE MAP                                                00739900
           MOVE 'ASPD' TO SCRNIDO.                                      00740000
           MOVE WS-DISPLAYED-REC-NUM TO WS-REC-NUM.                     00740100
           MOVE WS-REC-NUM-AREA TO RECNUMO.                             00740200
           MOVE CA-PREV-PAGE-NUM TO PAGENOO.                            00740300
                                                                        00740400
      *  DISPLAY WARNING MESSAGE IF ADMN STATUS IS NOT ACTIVE           00740500
           IF ADMNSTSI = 'CN' OR 'DE' OR 'LP'                           00740600
                      OR 'MT' OR 'SR' OR 'NB' OR 'EX'                   00740700
                      MOVE 'W013' TO WS-MESSAGE-CODE-HOLD               00740800
                      PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.    00740900
                                                                        00741000
      *  DISPLAY WARNING MESSAGE IF ADMN STATUS IS EI OR RP             00741100
A11313     IF ADMNSTSI = 'AN'                                           00741200
A11313                MOVE 'W057' TO WS-MESSAGE-CODE-HOLD               00741300
A11313                PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT     00741400
A11313     ELSE                                                         00741500
           IF ADMNSTSI = 'EI'                                           00741600
                      MOVE 'W016' TO WS-MESSAGE-CODE-HOLD               00741700
                      PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT     00741800
           ELSE                                                         00741900
           IF ADMNSTSI = 'RP'                                           00742000
                      MOVE 'W017' TO WS-MESSAGE-CODE-HOLD               00742100
                      PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT     00742200
           ELSE                                                         00742300
           IF ADMNSTSI = 'LH'                                           00742400
                      MOVE 'W018' TO WS-MESSAGE-CODE-HOLD               00742500
                      PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.    00742600
                                                                        00742700
      *  BUILD AS OF DATE                                               00742800
           MOVE CA-SYSTEM-MO TO WS-AS-OF-MO.                            00742900
           MOVE CA-SYSTEM-DY TO WS-AS-OF-DY.                            00743000
           MOVE CA-SYSTEM-YR TO WS-AS-OF-YR.                            00743100
           MOVE WS-SCREEN-TITLE TO TITLEO.                              00743200
                                                                        00743300
           IF DE-ADJ                                                    00743400
               MOVE 'ADJ DT:' TO REVLABO                                00743500
               MOVE '** ADJUSTMENT **' TO REVAREAO                      00743600
               MOVE 'ADJUSTMENT AMT' TO HEADERO.                        00743700
                                                                        00743800
      *  BUILD SCREEN MESSAGES - POSITION THE CURSOR IF NO MESSAGES     00743900
      *  IF MESSAGES CURSOR SHOULD HAVE BEEN POSTIONS IN THE SPOT WHERE 00744000
      *  THE MESSAGE CODE WAS SET. MESSAGES IN D686MSGX DO NOT ADD TO   00744100
      *  THE WS-MESSAGE-COUNT.                                          00744200
                                                                        00744300
           IF (WS-MESSAGE-COUNT > ZERO) AND (NOT WS-HOLD-ALL-OTHER-MSGS)00744400
               PERFORM 8200-LOAD-SCREEN-MESSAGES THRU 8200-EXIT.        00744500
                                                                        00744600
      *  IF CURSOR HAS NOT BEEN SET, SET IT                             00744700
           IF NOT WS-SCREEN-ERRORS                                      00744800
               IF CA-PREV-PAGE-NUM = 1                                  00744900
                   MOVE -1 TO TRXADDTL                                  00745000
               ELSE                                                     00745100
                   MOVE -1 TO DENTY1L.                                  00745200
                                                                        00745300
      *  SEND MAPS                                                      00745400
           IF WS-ERASE-SCREEN                                           00745500
               PERFORM 8300-SEND-MAPS-ERASE                             00745600
           ELSE                                                         00745700
               PERFORM 8400-SEND-MAPS-NO-ERASE.                         00745800
                                                                        00745900
                                                                        00746000
       EJECT                                                            00746100
       8001-OPEN-UPD-FIELDS.                                            00746200
                                                                        00746300
           IF CA-PREV-PAGE-NUM = 2                                      00746400
               MOVE +1 TO WS-SUB-DISPLAY                                00746500
           ELSE                                                         00746600
               MOVE +9 TO WS-SUB-DISPLAY.                               00746700
                                                                        00746800
           IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)                            00746900
               IF WS-SCREEN-ERRORS                                      00747000
                   NEXT SENTENCE                                        00747100
               ELSE IF DE-ORIG                                          00747200
                   MOVE UNPROT TO PROAMT1F                              00747300
               ELSE                                                     00747400
                   MOVE UNPROT TO REVAMT1F                              00747500
                                  RC1F.                                 00747600
           IF WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) = '???????'           00747700
               MOVE UNPROT TO TITLE1F                                   00747800
               MOVE GREEN-COLOR TO TITLE1C.                             00747900
           IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                        00748000
               MOVE BLUE-COLOR TO PROAMT1C                              00748100
                                  REVAMT1C                              00748200
                                  RC1C.                                 00748300
                                                                        00748400
           ADD +1 TO WS-SUB-DISPLAY.                                    00748500
                                                                        00748600
           IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)                            00748700
               IF WS-SCREEN-ERRORS                                      00748800
                   NEXT SENTENCE                                        00748900
               ELSE IF DE-ORIG                                          00749000
                   MOVE UNPROT TO PROAMT2F                              00749100
               ELSE                                                     00749200
                   MOVE UNPROT TO REVAMT2F                              00749300
                                  RC2F.                                 00749400
           IF WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) = '???????'           00749500
               MOVE UNPROT TO TITLE2F                                   00749600
               MOVE GREEN-COLOR TO TITLE2C.                             00749700
           IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                        00749800
               MOVE BLUE-COLOR TO PROAMT2C                              00749900
                                  REVAMT2C                              00750000
                                  RC2C.                                 00750100
                                                                        00750200
           ADD +1 TO WS-SUB-DISPLAY.                                    00750300
                                                                        00750400
           IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)                            00750500
               IF WS-SCREEN-ERRORS                                      00750600
                   NEXT SENTENCE                                        00750700
               ELSE IF DE-ORIG                                          00750800
                   MOVE UNPROT TO PROAMT3F                              00750900
               ELSE                                                     00751000
                   MOVE UNPROT TO REVAMT3F                              00751100
                                  RC3F.                                 00751200
           IF WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) = '???????'           00751300
               MOVE UNPROT TO TITLE3F                                   00751400
               MOVE GREEN-COLOR TO TITLE3C.                             00751500
           IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                        00751600
               MOVE BLUE-COLOR TO PROAMT3C                              00751700
                                  REVAMT3C                              00751800
                                  RC3C.                                 00751900
                                                                        00752000
           ADD +1 TO WS-SUB-DISPLAY.                                    00752100
                                                                        00752200
           IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)                            00752300
               IF WS-SCREEN-ERRORS                                      00752400
                   NEXT SENTENCE                                        00752500
               ELSE IF DE-ORIG                                          00752600
                   MOVE UNPROT TO PROAMT4F                              00752700
               ELSE                                                     00752800
                   MOVE UNPROT TO REVAMT4F                              00752900
                                  RC4F.                                 00753000
           IF WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) = '???????'           00753100
               MOVE UNPROT TO TITLE4F                                   00753200
               MOVE GREEN-COLOR TO TITLE4C.                             00753300
           IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                        00753400
               MOVE BLUE-COLOR TO PROAMT4C                              00753500
                                  REVAMT4C                              00753600
                                  RC4C.                                 00753700
                                                                        00753800
           ADD +1 TO WS-SUB-DISPLAY.                                    00753900
                                                                        00754000
           IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)                            00754100
               IF WS-SCREEN-ERRORS                                      00754200
                   NEXT SENTENCE                                        00754300
               ELSE IF DE-ORIG                                          00754400
                   MOVE UNPROT TO PROAMT5F                              00754500
               ELSE                                                     00754600
                   MOVE UNPROT TO REVAMT5F                              00754700
                                  RC5F.                                 00754800
           IF WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) = '???????'           00754900
               MOVE UNPROT TO TITLE5F                                   00755000
               MOVE GREEN-COLOR TO TITLE5C.                             00755100
           IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                        00755200
               MOVE BLUE-COLOR TO PROAMT5C                              00755300
                                  REVAMT5C                              00755400
                                  RC5C.                                 00755500
                                                                        00755600
           ADD +1 TO WS-SUB-DISPLAY.                                    00755700
                                                                        00755800
           IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)                            00755900
               IF WS-SCREEN-ERRORS                                      00756000
                   NEXT SENTENCE                                        00756100
               ELSE IF DE-ORIG                                          00756200
                   MOVE UNPROT TO PROAMT6F                              00756300
               ELSE                                                     00756400
                   MOVE UNPROT TO REVAMT6F                              00756500
                                  RC6F.                                 00756600
           IF WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) = '???????'           00756700
               MOVE UNPROT TO TITLE6F                                   00756800
               MOVE GREEN-COLOR TO TITLE6C.                             00756900
           IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                        00757000
               MOVE BLUE-COLOR TO PROAMT6C                              00757100
                                  REVAMT6C                              00757200
                                  RC6C.                                 00757300
                                                                        00757400
           ADD +1 TO WS-SUB-DISPLAY.                                    00757500
                                                                        00757600
           IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)                            00757700
               IF WS-SCREEN-ERRORS                                      00757800
                   NEXT SENTENCE                                        00757900
               ELSE IF DE-ORIG                                          00758000
                   MOVE UNPROT TO PROAMT7F                              00758100
               ELSE                                                     00758200
                   MOVE UNPROT TO REVAMT7F                              00758300
                                  RC7F.                                 00758400
           IF WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) = '???????'           00758500
               MOVE UNPROT TO TITLE7F                                   00758600
               MOVE GREEN-COLOR TO TITLE7C.                             00758700
           IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                        00758800
               MOVE BLUE-COLOR TO PROAMT7C                              00758900
                                  REVAMT7C                              00759000
                                  RC7C.                                 00759100
                                                                        00759200
           ADD +1 TO WS-SUB-DISPLAY.                                    00759300
                                                                        00759400
           IF WS-DISPLAY-SEL(WS-SUB-DISPLAY)                            00759500
               IF WS-SCREEN-ERRORS                                      00759600
                   NEXT SENTENCE                                        00759700
               ELSE IF DE-ORIG                                          00759800
                   MOVE UNPROT TO PROAMT8F                              00759900
               ELSE                                                     00760000
                   MOVE UNPROT TO REVAMT8F                              00760100
                                  RC8F.                                 00760200
           IF WS-DISPLAY-COVERAGE(WS-SUB-DISPLAY) = '???????'           00760300
               MOVE UNPROT TO TITLE8F                                   00760400
               MOVE GREEN-COLOR TO TITLE8C.                             00760500
           IF NOT WS-DISPLAY-SEL(WS-SUB-DISPLAY)                        00760600
               MOVE BLUE-COLOR TO PROAMT8C                              00760700
                                  REVAMT8C                              00760800
                                  RC8C.                                 00760900
                                                                        00761000
       8001-EXIT.                                                       00761100
           EXIT.                                                        00761200
       EJECT                                                            00761300
       8010-CHECK-PAID-TO-DT.                                           00761400
                                                                        00761500
           MOVE WS-DI-ITEM-NUM TO CA-ITEM-NUM.                          00761600
           MOVE WS-DI-RECORD-LENGTH TO CA-RECORD-LENGTH.                00761700
                                                                        00761800
      *  READ THE DI RECORD FROM TS                                     00761900
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00762000
                                                                        00762100
      *  MOVE WS RECORD TO RECORD LAYOUT                                00762200
           MOVE WS-RECORD-INFO TO DI-INFO.                              00762300
                                                                        00762400
           IF (DI-DEATH-DT NOT NUMERIC) OR                              00762500
              (DI-DEATH-DT NOT > ZERO) OR                               00762600
              (CA-PAID-TO-DT NOT NUMERIC) OR                            00762700
              (CA-PAID-TO-DT NOT > 0)                                   00762800
               GO TO 8010-EXIT.                                         00762900
                                                                        00763000
           MOVE DI-DEATH-MO TO WS-COMPARE-MO-1.                         00763100
           MOVE DI-DEATH-DY TO WS-COMPARE-DY-1.                         00763200
           MOVE DI-DEATH-YR TO WS-COMPARE-YR-1.                         00763300
                                                                        00763400
           MOVE CA-PAID-TO-MO TO WS-COMPARE-MO-2.                       00763500
           MOVE CA-PAID-TO-DY TO WS-COMPARE-DY-2.                       00763600
           MOVE CA-PAID-TO-YR TO WS-COMPARE-YR-2.                       00763700
                                                                        00763800
           IF WS-COMPARE-DT-1 NOT < WS-COMPARE-DT-2                     00763900
               MOVE 'W014' TO WS-MESSAGE-CODE-HOLD                      00764000
               PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.           00764100
                                                                        00764200
       8010-EXIT.                                                       00764300
           EXIT.                                                        00764400
       EJECT                                                            00764500
      ***********************************************************       00764600
      *             P R O T E C T   S C R E E N                 *       00764700
      ***********************************************************       00764800
       8050-PROTECT-SCREEN.                                             00764900
                                                                        00765000
           MOVE 'Y' TO WS-PYMT-PROT-FLAG.                               00765100
                                                                        00765200
           IF CA-PREV-PAGE-NUM = 1                                      00765300
               PERFORM 8051-PROT-1 THRU 8051-EXIT                       00765400
           ELSE                                                         00765500
               PERFORM 8052-PROT-2 THRU 8052-EXIT.                      00765600
                                                                        00765700
       8050-EXIT.                                                       00765800
           EXIT.                                                        00765900
       EJECT                                                            00766000
       8051-PROT-1.                                                     00766100
                                                                        00766200
           IF DE-ORIG                                                   00766300
               MOVE PROT-DARK TO REVLABF                                00766400
                                 REVDTF                                 00766500
                                 REVAREAF.                              00766600
                                                                        00766700
       8051-EXIT.                                                       00766800
           EXIT.                                                        00766900
       EJECT                                                            00767000
       8052-PROT-2.                                                     00767100
                                                                        00767200
           MOVE PROT TO PROAMT1F                                        00767300
                        REVAMT1F                                        00767400
                        RC1F                                            00767500
                        PROAMT2F                                        00767600
                        REVAMT2F                                        00767700
                        RC2F                                            00767800
                        PROAMT3F                                        00767900
                        REVAMT3F                                        00768000
                        RC3F                                            00768100
                        PROAMT4F                                        00768200
                        REVAMT4F                                        00768300
                        RC4F                                            00768400
                        PROAMT5F                                        00768500
                        REVAMT5F                                        00768600
                        RC5F                                            00768700
                        PROAMT6F                                        00768800
                        REVAMT6F                                        00768900
                        RC6F                                            00769000
                        PROAMT7F                                        00769100
                        REVAMT7F                                        00769200
                        RC7F                                            00769300
                        PROAMT8F                                        00769400
                        REVAMT8F                                        00769500
                        RC8F.                                           00769600
                                                                        00769700
           MOVE BLUE-COLOR TO PROAMT1C                                  00769800
                              REVAMT1C                                  00769900
                              RC1C                                      00770000
                              PROAMT2C                                  00770100
                              REVAMT2C                                  00770200
                              RC2C                                      00770300
                              PROAMT3C                                  00770400
                              REVAMT3C                                  00770500
                              RC3C                                      00770600
                              PROAMT4C                                  00770700
                              REVAMT4C                                  00770800
                              RC4C                                      00770900
                              PROAMT5C                                  00771000
                              REVAMT5C                                  00771100
                              RC5C                                      00771200
                              PROAMT6C                                  00771300
                              REVAMT6C                                  00771400
                              RC6C                                      00771500
                              PROAMT7C                                  00771600
                              REVAMT7C                                  00771700
                              RC7C                                      00771800
                              PROAMT8C                                  00771900
                              REVAMT8C                                  00772000
                              RC8C.                                     00772100
                                                                        00772200
           IF DE-ORIG                                                   00772300
               MOVE PROT-DARK TO REVAMT1F                               00772400
                                 REVAMT2F                               00772500
                                 REVAMT3F                               00772600
                                 REVAMT4F                               00772700
                                 REVAMT5F                               00772800
                                 REVAMT6F                               00772900
                                 REVAMT7F                               00773000
                                 REVAMT8F                               00773100
                                 REASLABF.                              00773200
                                                                        00773300
       8052-EXIT.                                                       00773400
           EXIT.                                                        00773500
       EJECT                                                            00773600
      ***********************************************************       00773700
      *             B U I L D   P F K E Y    M A P              *       00773800
      ***********************************************************       00773900
       8100-BUILD-PFK-MAP.                                              00774000
                                                                        00774100
           MOVE 'PF1  HLP' TO WS-PFKEY(WS-PFK-SUB).                     00774200
           ADD +1 TO WS-PFK-SUB.                                        00774300
      *                                                                 00774400
           MOVE 'PF2  TOP' TO WS-PFKEY(WS-PFK-SUB).                     00774500
           ADD +1 TO WS-PFK-SUB.                                        00774600
      *                                                                 00774700
           MOVE 'PF3  MM ' TO WS-PFKEY(WS-PFK-SUB).                     00774800
           ADD +1 TO WS-PFK-SUB.                                        00774900
      *                                                                 00775000
           MOVE 'PF4  PRV' TO WS-PFKEY(WS-PFK-SUB).                     00775100
           ADD +1 TO WS-PFK-SUB.                                        00775200
           MOVE 'PF5  NXT' TO WS-PFKEY(WS-PFK-SUB).                     00775300
           ADD +1 TO WS-PFK-SUB.                                        00775400
      *                                                                 00775500
           IF CA-ASPC-UPDATE AND (NOT WS-PYMT-PROT)                     00775600
               MOVE 'PF6  UPD' TO WS-PFKEY(WS-PFK-SUB)                  00775700
               ADD +1 TO WS-PFK-SUB.                                    00775800
      *                                                                 00775900
           IF CA-PREV-PAGE-NUM = 1                                      00776000
               MOVE 'PF8  FWD' TO WS-PFKEY(WS-PFK-SUB)                  00776100
               ADD +1 TO WS-PFK-SUB                                     00776200
               IF NOT WS-SCREEN-ERRORS                                  00776300
                   MOVE 'I007' TO WS-MESSAGE-CODE-HOLD                  00776400
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT        00776500
               ELSE                                                     00776600
                   NEXT SENTENCE                                        00776700
           ELSE                                                         00776800
               MOVE 'PF7  BWD' TO WS-PFKEY(WS-PFK-SUB)                  00776900
               ADD +1 TO WS-PFK-SUB                                     00777000
               IF NOT WS-SCREEN-ERRORS                                  00777100
                   MOVE 'I008' TO WS-MESSAGE-CODE-HOLD                  00777200
                   PERFORM 3900-LOAD-MESSAGE-CODE THRU 3900-EXIT.       00777300
      *                                                                 00777400
           IF CA-ASPC-UPDATE AND (NOT WS-PYMT-PROT)                     00777500
               MOVE 'PF9  PMT' TO WS-PFKEY(WS-PFK-SUB)                  00777600
               ADD +1 TO WS-PFK-SUB.                                    00777700
      *                                                                 00777800
           IF CA-ASPC-UPDATE AND (NOT WS-PYMT-PROT)                     00777900
               MOVE 'PF10 NEW' TO WS-PFKEY(WS-PFK-SUB)                  00778000
               ADD +1 TO WS-PFK-SUB.                                    00778100
      *                                                                 00778200
           IF CA-ASPC-UPDATE AND (NOT WS-PYMT-PROT)                     00778300
               MOVE 'PF11 DEL' TO WS-PFKEY(WS-PFK-SUB)                  00778400
               ADD +1 TO WS-PFK-SUB.                                    00778500
      *                                                                 00778600
           MOVE 'PF12 END' TO WS-PFKEY(WS-PFK-SUB).                     00778700
           ADD +1 TO WS-PFK-SUB.                                        00778800
      *                                                                 00778900
           IF CA-ASDT-UPDATE OR CA-ASDT-BROWSE                          00779000
               MOVE 'PF13 DT ' TO WS-PFKEY(WS-PFK-SUB)                  00779100
               ADD +1 TO WS-PFK-SUB.                                    00779200
      *                                                                 00779300
           IF CA-ASEI-UPDATE OR CA-ASEI-BROWSE                          00779400
               MOVE 'PF14 EI ' TO WS-PFKEY(WS-PFK-SUB)                  00779500
               ADD +1 TO WS-PFK-SUB.                                    00779600
      *                                                                 00779700
           IF CA-ASEM-UPDATE OR CA-ASEM-BROWSE                          00779800
               MOVE 'PF15 EM ' TO WS-PFKEY(WS-PFK-SUB)                  00779900
               ADD +1 TO WS-PFK-SUB.                                    00780000
      *                                                                 00780100
           IF CA-ASCT-UPDATE OR CA-ASCT-BROWSE                          00780200
               MOVE 'PF16 CT ' TO WS-PFKEY(WS-PFK-SUB)                  00780300
               ADD +1 TO WS-PFK-SUB.                                    00780400
      *                                                                 00780500
           IF CA-ASPC-UPDATE OR CA-ASPC-BROWSE                          00780600
               MOVE 'PF17 PC ' TO WS-PFKEY(WS-PFK-SUB)                  00780700
               ADD +1 TO WS-PFK-SUB.                                    00780800
      *                                                                 00780900
           IF CA-ASRQ-UPDATE OR CA-ASRQ-BROWSE                          00781000
               MOVE 'PF18 RQ ' TO WS-PFKEY(WS-PFK-SUB)                  00781100
               ADD +1 TO WS-PFK-SUB.                                    00781200
      *                                                                 00781300
           IF (CA-ASBN-UPDATE OR CA-ASBN-BROWSE) AND (CA-ID)            00781400
               MOVE 'PF19 BN ' TO WS-PFKEY(WS-PFK-SUB)                  00781500
               ADD +1 TO WS-PFK-SUB.                                    00781600
      *                                                                 00781700
           IF CA-ASCL-UPDATE OR CA-ASCL-BROWSE                          00781800
               MOVE 'PF20 CL ' TO WS-PFKEY(WS-PFK-SUB)                  00781900
               ADD +1 TO WS-PFK-SUB.                                    00782000
      *                                                                 00782100
           IF (CA-ASPV-UPDATE OR CA-ASPV-BROWSE) AND                    00782200
              (CA-MM OR CA-HS OR CA-INC-PROT OR                         00782300
               CA-IW OR CA-RW)                                          00782400
               MOVE 'PF21 PV ' TO WS-PFKEY(WS-PFK-SUB)                  00782500
               ADD +1 TO WS-PFK-SUB.                                    00782600
      *                                                                 00782700
           IF CA-ASCD-UPDATE OR CA-ASCD-BROWSE                          00782800
               MOVE 'PF22 CD ' TO WS-PFKEY(WS-PFK-SUB)                  00782900
               ADD +1 TO WS-PFK-SUB.                                    00783000
      *                                                                 00783100
Q16162*    IF CA-ASUW-UPDATE OR CA-ASUW-BROWSE                          00783200
Q16162     IF (CA-ASUW-UPDATE OR CA-ASUW-BROWSE)                        00783300
Q16162        AND (NOT CA-LOB-FIXED-ANNUITY)                            00783400
Q16162        AND (NOT CA-LOB-VARIABLE-ANNUITY)                         00783600
               MOVE 'PF23 UW ' TO WS-PFKEY(WS-PFK-SUB)                  00783700
               ADD +1 TO WS-PFK-SUB.                                    00783900
      *                                                                 00784000
           IF CA-ASPI-UPDATE OR CA-ASPI-BROWSE                          00784100
               MOVE 'PF24 PI ' TO WS-PFKEY(WS-PFK-SUB)                  00784200
               ADD +1 TO WS-PFK-SUB.                                    00784300
      *                                                                 00784400
           MOVE 'PA2  VAL' TO WS-PFKEY(WS-PFK-SUB).                     00784500
           ADD +1 TO WS-PFK-SUB.                                        00784600
                                                                        00784700
      *  MOVE WS TO MAP FIELDS                                          00784800
           MOVE WS-PFKEY(1)  TO PFR1K1O.                                00784900
           MOVE WS-PFKEY(2)  TO PFR1K2O.                                00785000
           MOVE WS-PFKEY(3)  TO PFR1K3O.                                00785100
           MOVE WS-PFKEY(4)  TO PFR1K4O.                                00785200
           MOVE WS-PFKEY(5)  TO PFR1K5O.                                00785300
           MOVE WS-PFKEY(6)  TO PFR1K6O.                                00785400
           MOVE WS-PFKEY(7)  TO PFR1K7O.                                00785500
           MOVE WS-PFKEY(8)  TO PFR1K8O.                                00785600
      *                                                                 00785700
           MOVE WS-PFKEY(9)  TO PFR2K1O.                                00785800
           MOVE WS-PFKEY(10) TO PFR2K2O.                                00785900
           MOVE WS-PFKEY(11) TO PFR2K3O.                                00786000
           MOVE WS-PFKEY(12) TO PFR2K4O.                                00786100
           MOVE WS-PFKEY(13) TO PFR2K5O.                                00786200
           MOVE WS-PFKEY(14) TO PFR2K6O.                                00786300
           MOVE WS-PFKEY(15) TO PFR2K7O.                                00786400
           MOVE WS-PFKEY(16) TO PFR2K8O.                                00786500
      *                                                                 00786600
      *                                                                 00786700
           MOVE WS-PFKEY(17) TO PFR3K1O.                                00786800
           MOVE WS-PFKEY(18) TO PFR3K2O.                                00786900
           MOVE WS-PFKEY(19) TO PFR3K3O.                                00787000
           MOVE WS-PFKEY(20) TO PFR3K4O.                                00787100
           MOVE WS-PFKEY(21) TO PFR3K5O.                                00787200
           MOVE WS-PFKEY(22) TO PFR3K6O.                                00787300
           MOVE WS-PFKEY(23) TO PFR3K7O.                                00787400
           MOVE WS-PFKEY(24) TO PFR3K8O.                                00787500
                                                                        00787600
       8100-EXIT.                                                       00787700
           EXIT.                                                        00787800
       EJECT                                                            00787900
      ***********************************************************       00788000
      *            S C R E E N   M E S S A G E S                *       00788100
      ***********************************************************       00788200
       8200-LOAD-SCREEN-MESSAGES.                                       00788300
                                                                        00788400
      *  WRITE MESSGE TABLE TO TEMPORARY STORAGE                        00788500
           MOVE EIBTRMID TO WS-TERM-ID.                                 00788600
                                                                        00788700
           MOVE WS-MSG-RECORD-LENGTH TO CA-RECORD-LENGTH.               00788800
           MOVE WS-MSG-ITEM-NUM TO CA-ITEM-NUM.                         00788900
                                                                        00789000
           MOVE WS-MESSAGE-TABLE TO WS-RECORD.                          00789100
                                                                        00789200
           IF WS-MSG-ITEM-NUM = ZERO                                    00789300
               PERFORM 4920-WRITE-TS-QUEUE THRU 4920-EXIT               00789400
           ELSE                                                         00789500
               PERFORM 4930-REWRITE-TS-QUEUE THRU 4930-EXIT.            00789600
                                                                        00789700
           MOVE CA-ITEM-NUM TO WS-MSG-ITEM-NUM.                         00789800
                                                                        00789900
           EXEC CICS                                                    00790000
               LINK PROGRAM('D681MSGS')                                 00790100
                    COMMAREA(DFHCOMMAREA)                               00790200
                    LENGTH(EIBCALEN)                                    00790300
           END-EXEC.                                                    00790400
                                                                        00790500
           PERFORM 4910-READ-TS-QUEUE THRU 4910-EXIT.                   00790600
           MOVE WS-RECORD TO WS-MESSAGE-TABLE.                          00790700
                                                                        00790800
      *  TURN YELLOW COLOR ON FOR ALL MESSAGES.                         00790900
           MOVE YELLOW-COLOR TO MESSAG1C                                00791000
                                MESSAG2C                                00791100
                                MESSAG3C                                00791200
                                MESSAG4C                                00791300
                                MESSAG5C                                00791400
                                MESSAG6C                                00791500
                                MESSAG7C                                00791600
                                MESSAG8C                                00791700
                                MESSAG9C.                               00791800
                                                                        00791900
           MOVE WS-MESSAGE(1) TO MESSAG1O.                              00792000
           IF ERROR-MESSAGE(1)                                          00792100
                MOVE RED-COLOR TO MESSAG1C.                             00792200
                                                                        00792300
           IF WS-MESSAGE-COUNT > 1                                      00792400
               MOVE WS-MESSAGE(2) TO MESSAG2O                           00792500
               IF ERROR-MESSAGE(2)                                      00792600
                    MOVE RED-COLOR TO MESSAG2C                          00792700
               ELSE                                                     00792800
                    NEXT SENTENCE                                       00792900
           ELSE                                                         00793000
               GO TO 8200-EXIT.                                         00793100
                                                                        00793200
           IF WS-MESSAGE-COUNT > 2                                      00793300
               MOVE WS-MESSAGE(3) TO MESSAG3O                           00793400
               IF ERROR-MESSAGE(3)                                      00793500
                    MOVE RED-COLOR TO MESSAG3C                          00793600
               ELSE                                                     00793700
                    NEXT SENTENCE                                       00793800
           ELSE                                                         00793900
               GO TO 8200-EXIT.                                         00794000
                                                                        00794100
           IF WS-MESSAGE-COUNT > 3                                      00794200
               MOVE WS-MESSAGE(4) TO MESSAG4O                           00794300
               IF ERROR-MESSAGE(4)                                      00794400
                    MOVE RED-COLOR TO MESSAG4C                          00794500
               ELSE                                                     00794600
                    NEXT SENTENCE                                       00794700
           ELSE                                                         00794800
               GO TO 8200-EXIT.                                         00794900
                                                                        00795000
           IF WS-MESSAGE-COUNT > 4                                      00795100
               MOVE WS-MESSAGE(5) TO MESSAG5O                           00795200
               IF ERROR-MESSAGE(5)                                      00795300
                    MOVE RED-COLOR TO MESSAG5C                          00795400
               ELSE                                                     00795500
                    NEXT SENTENCE                                       00795600
           ELSE                                                         00795700
               GO TO 8200-EXIT.                                         00795800
                                                                        00795900
           IF WS-MESSAGE-COUNT > 5                                      00796000
               MOVE WS-MESSAGE(6) TO MESSAG6O                           00796100
               IF ERROR-MESSAGE(6)                                      00796200
                    MOVE RED-COLOR TO MESSAG6C                          00796300
               ELSE                                                     00796400
                    NEXT SENTENCE                                       00796500
           ELSE                                                         00796600
               GO TO 8200-EXIT.                                         00796700
                                                                        00796800
           IF WS-MESSAGE-COUNT > 6                                      00796900
               MOVE WS-MESSAGE(7) TO MESSAG7O                           00797000
               IF ERROR-MESSAGE(7)                                      00797100
                    MOVE RED-COLOR TO MESSAG7C                          00797200
               ELSE                                                     00797300
                    NEXT SENTENCE                                       00797400
           ELSE                                                         00797500
               GO TO 8200-EXIT.                                         00797600
                                                                        00797700
           IF WS-MESSAGE-COUNT > 7                                      00797800
               MOVE WS-MESSAGE(8) TO MESSAG8O                           00797900
               IF ERROR-MESSAGE(8)                                      00798000
                    MOVE RED-COLOR TO MESSAG8C                          00798100
               ELSE                                                     00798200
                    NEXT SENTENCE                                       00798300
           ELSE                                                         00798400
               GO TO 8200-EXIT.                                         00798500
                                                                        00798600
           IF WS-MESSAGE-COUNT > 8                                      00798700
               MOVE WS-MESSAGE(9) TO MESSAG9O                           00798800
               IF ERROR-MESSAGE(9)                                      00798900
                    MOVE RED-COLOR TO MESSAG9C                          00799000
               ELSE                                                     00799100
                    NEXT SENTENCE                                       00799200
           ELSE                                                         00799300
               GO TO 8200-EXIT.                                         00799400
                                                                        00799500
       8200-EXIT.                                                       00799600
           EXIT.                                                        00799700
       EJECT                                                            00799800
      ***********************************************************       00799900
      *        S E N D   M A P S   W I T H   E R A S E          *       00800000
      ***********************************************************       00800100
       8300-SEND-MAPS-ERASE.                                            00800200
                                                                        00800300
      *  SEND TITLE MAP                                                 00800400
           EXEC CICS SEND                                               00800500
                     MAP('MAPTITL')                                     00800600
                     MAPSET('D682TIT')                                  00800700
                     ERASE                                              00800800
                     ACCUM                                              00800900
           END-EXEC.                                                    00801000
                                                                        00801100
      *  SEND TITLE HEADER                                              00801200
           EXEC CICS SEND                                               00801300
                     MAP('MAPHDER')                                     00801400
                     MAPSET('D682HDR')                                  00801500
                     ERASE                                              00801600
                     ACCUM                                              00801700
           END-EXEC.                                                    00801800
                                                                        00801900
      *  SEND BODY MAP                                                  00802000
           IF CA-PREV-PAGE-NUM = 1                                      00802100
               EXEC CICS SEND                                           00802200
                         MAP('MAPPD1A')                                 00802300
                         MAPSET('D682PD1')                              00802400
                         ERASE                                          00802500
                         ACCUM                                          00802600
                         CURSOR                                         00802700
               END-EXEC                                                 00802800
           ELSE                                                         00802900
               EXEC CICS SEND                                           00803000
                         MAP('MAPPD2A')                                 00803100
                         MAPSET('D682PD7')                              00803200
                         ERASE                                          00803300
                         ACCUM                                          00803400
                         CURSOR                                         00803500
               END-EXEC.                                                00803600
                                                                        00803700
      *  SEND PFKEY MAP                                                 00803800
           EXEC CICS SEND                                               00803900
                     MAP('MAPPFKY')                                     00804000
                     MAPSET('D682PFK')                                  00804100
                     ERASE                                              00804200
                     ACCUM                                              00804300
           END-EXEC.                                                    00804400
                                                                        00804500
      *  SEND PAGE                                                      00804600
           EXEC CICS SEND                                               00804700
                     PAGE                                               00804800
           END-EXEC.                                                    00804900
                                                                        00805000
           PERFORM 10000-RETURN-CICS.                                   00805100
                                                                        00805200
       8300-EXIT.                                                       00805300
           EXIT.                                                        00805400
       EJECT                                                            00805500
      ***********************************************************       00805600
      *     S E N D   M A P S   W I T H O U T   E R A S E       *       00805700
      ***********************************************************       00805800
       8400-SEND-MAPS-NO-ERASE.                                         00805900
                                                                        00806000
      *  SEND TITLE MAP                                                 00806100
           EXEC CICS SEND                                               00806200
                     MAP('MAPTITL')                                     00806300
                     MAPSET('D682TIT')                                  00806400
                     ACCUM                                              00806500
           END-EXEC.                                                    00806600
                                                                        00806700
      *  SEND TITLE HEADER                                              00806800
           EXEC CICS SEND                                               00806900
                     MAP('MAPHDER')                                     00807000
                     MAPSET('D682HDR')                                  00807100
                     ACCUM                                              00807200
           END-EXEC.                                                    00807300
                                                                        00807400
      *  SEND BODY MAP                                                  00807500
           IF CA-PREV-PAGE-NUM = 1                                      00807600
               EXEC CICS SEND                                           00807700
                         MAP('MAPPD1A')                                 00807800
                         MAPSET('D682PD1')                              00807900
                         ACCUM                                          00808000
                         CURSOR                                         00808100
               END-EXEC                                                 00808200
           ELSE                                                         00808300
               EXEC CICS SEND                                           00808400
                         MAP('MAPPD2A')                                 00808500
                         MAPSET('D682PD7')                              00808600
                         ACCUM                                          00808700
                         CURSOR                                         00808800
               END-EXEC.                                                00808900
                                                                        00809000
      *  SEND PFKEY MAP                                                 00809100
           EXEC CICS SEND                                               00809200
                     MAP('MAPPFKY')                                     00809300
                     MAPSET('D682PFK')                                  00809400
                     ACCUM                                              00809500
           END-EXEC.                                                    00809600
                                                                        00809700
      *  SEND PAGE                                                      00809800
           EXEC CICS SEND                                               00809900
                     PAGE                                               00810000
           END-EXEC.                                                    00810100
                                                                        00810200
           PERFORM 10000-RETURN-CICS.                                   00810300
                                                                        00810400
       8400-EXIT.                                                       00810500
           EXIT.                                                        00810600
       EJECT                                                            00810700
      ***********************************************************       00810800
      *             S E N D   H L P  S C R E E N                *       00810900
      ***********************************************************       00811000
       8500-SEND-HLP-SCREEN.                                            00811100
                                                                        00811200
      *  UPDATE COMMAREA                                                00811300
           MOVE 'H' TO CA-LAST-REQUEST.                                 00811400
                                                                        00811500
      *  SEND MAPS                                                      00811600
                                                                        00811700
           EXEC CICS SEND                                               00811800
                     MAP('MAPHELP')                                     00811900
                     MAPSET('D682HLP')                                  00812000
                     ERASE                                              00812100
           END-EXEC.                                                    00812200
                                                                        00812300
           PERFORM 10000-RETURN-CICS.                                   00812400
                                                                        00812500
       8500-EXIT.                                                       00812600
           EXIT.                                                        00812700
       EJECT                                                            00812800
      ***********************************************************       00812900
      *               S E N D   T E XT                          *       00813000
      ***********************************************************       00813100
       9100-SEND-TEXT.                                                  00813200
                                                                        00813300
           EXEC CICS SEND TEXT                                          00813400
                          FROM(WS-SEND-TEXT-DATA)                       00813500
                          LENGTH(78)                                    00813600
                          ERASE                                         00813700
                          FREEKB                                        00813800
           END-EXEC.                                                    00813900
                                                                        00814000
           PERFORM 10100-FINAL-RETURN-CICS.                             00814100
                                                                        00814200
       9100-EXIT.                                                       00814300
           EXIT.                                                        00814400
       EJECT                                                            00814500
      ***********************************************************       00814600
      * C I C S   R E T U R N   W I T H   D F H C O M M A R E A *       00814700
      ***********************************************************       00814800
       10000-RETURN-CICS.                                               00814900
                                                                        00815000
      *  MOVE WS-COMMAREA TO DFHCOMMAREA                                00815100
           MOVE WS-COMMAREA TO CA-GENERAL.                              00815200
                                                                        00815300
           EXEC CICS RETURN                                             00815400
                     TRANSID('ACTS')                                    00815500
                     COMMAREA(DFHCOMMAREA)                              00815600
                     LENGTH(EIBCALEN)                                   00815700
           END-EXEC.                                                    00815800
                                                                        00815900
      ***********************************************************       00816000
      *                  F I N A L   E X I T                    *       00816100
      ***********************************************************       00816200
       10100-FINAL-RETURN-CICS.                                         00816300
                                                                        00816400
           EXEC CICS RETURN                                             00816500
           END-EXEC.                                                    00816600
                                                                        00816700
                                                                        00816800
           EJECT                                                        00817000
