00001  IDENTIFICATION DIVISION.                                         02/10/04
00002  PROGRAM-ID.    D6502100.                                         D6502100
00003  AUTHOR.        KEVIN WESTON.                                        LV004
00004  DATE-WRITTEN.  06/01/89.                                         D6502100
00005  INSTALLATION.  AMERICAN UNITED LIFE.                             D6502100
00006                                                                   D6502100
00007 *************  P R O G R A M   U P D A T E   L O G  **************D6502100
00008 *                                                                *D6502100
00009 * DATE     PRG LVL VR SMR      REASON                            *D6502100
00010 *                                                                *D6502100
00011 * 08/08/89 KWW 001 C  IND0001  NEW PROGRAM TO CALCULATE 7-PAY    *D6502100
00012 *                              PREMIUMS FOR ALIS POLICIES.       *D6502100
00013 *                                                                *D6502100
00014 * 01/17/91 KAS 006 C1 IND0027  NEW PRODUCTS - ADDED LEVEL TERM   *D6502100
00015 *                              PORTION OF 7-PAY PREMIUM          *D6502100
00016 *                                                                *D6502100
00017 * 04/02/93 FDH 026 C  PI2010   NEW PRODUCTS - LAST SURVIVOR      *D6502100
00018 *                                                                *D6502100
00019 * 06/03/93 FDH 050 C1 PI2132   NEW PRODUCTS - LAST SURVIVOR      *D6502100
00020 *                                                                *D6502100
00021 * 10/11/94 FDH 090 C2 AI7780   NEW PRODUCTS - LEGACY             *D6502100
00022 *                                                                *D6502100
00023 * 10/31/94 FDH 091 C  AI7780   LEGACY-CHANGE INT RATE TO 5.5%    *D6502100
00024 *                                                                *D6502100
00025 * 12/29/94 FDH 092 C1 XXXXXX   1800 SERIES LAST SURVIVOR         *D6502100
00026 *                                                                *D6502100
00027 * 11/08/96 DMB 093 C2 IND0127  PREVENT LOOP IN 941000 PARAGRAPH  *D6502100
00028 *                              WHEN ACCEL RIDER TERMINATED IN    *D6502100
00029 *                              ERROR.                            *D6502100
00030 * 09/30/97 FDH 100 C  PI2348   NEW PRODUCTS - SELECTAUL          *D6502100
00031 * 01/XX/98 JME 101 C1 PROB     CORRECT CALL TO R2200000 FOR      *D6502100
00032 *               REPT 01/05/98  TERM                              *D6502100
00033 * 01/21/98 EAB XXX C2  Y2K     REPLACED CALL OF MVAA01 WITH CALL *D6502100
00034 *                              TO D1006011 FOR Y2K.              *D6502100
00035 *                                                                *D6502100
00036 * 06/05/03 DRG XXX     IND0222 MOVE OFF PAN.UL.PANLIB TO IND     *D6502100
00037 * 02/10/04 DRK XXX     IND0244 CONVERT TO MODERN                 *   CL**4
00037 * 09/28/10 LKM XXX     AL8775  ADJUST RESULT-AREA FOR CALLS TO   *
00037 *                              NEW R2200000.                     *
00037 *                              FIX R22-SPECIAL-TABLE-PARM FOR    *
00038 *                              COMMUTATION TABLE SINGLE LIVES.   *
00037 * 05/16/11 LKM XXX     AL8775  CHANGE COMMUTATION TABLE BUILD TO *
00038 *                              RESOLVE DIFFERENCES.              *
00038 *                                                                *D6502100
      * 06/16/25 SHA                 PRJ0124109 - COBOL 6.4 UPGRADE    *  Q17189
      *                              MADE CHANGES TO STOP AREA OUTSIDE *  Q17189
      *                              THE TABLE REGION ERROR FOR PERFORM*  Q17189
      *                              UNTIL COND TO SUPPORT COBOL 6.4   *  Q17189
00039 *************  P R O G R A M   U P D A T E   L O G  **************D6502100
00040 /                                                                 D6502100
00041 **********  P R O G R A M   D O C U M E N T A T I O N  ***********D6502100
00042 *                                                                *D6502100
00043 *       DATE:  06/01/89                                          *D6502100
00044 *                                                                *D6502100
00045 *    PURPOSE:  CALCULATE 7-PAY PREMIUMS FOR ALIS POLICIES.       *D6502100
00046 *                                                                *D6502100
00047 *      INPUT:  ACTION INDICATOR - 'I'  INITIALIZE                *D6502100
00048 *                                 ' '  CALCULATE PREMIUM         *D6502100
00049 *              7-PAY START DATE - YYYYMMDD                       *D6502100
00050 *              CALCULATION TYPE - 'I'  ISSUE                     *D6502100
00051 *                                 'M'  CALCULATE PREMIUM         *D6502100
00052 *              1035 MONEY AMT   - ONLY REQUIRED FOR ISSUE        *D6502100
00053 *              MASTER RECORD    - ALIS EXPANDED MASTER RECORD    *D6502100
00054 *                                                                *D6502100
00055 *     OUTPUT:  ANNUAL 7-PAY PREMIUM                              *D6502100
00056 *                                                                *D6502100
00057 *      CALLS:  OSCALLOS - (ALIS) ACCESS R2200000                 *D6502100
00058 *              d1006011 - (alis) DATE CONVERSION                 *D6502100
00059 *                                                                *D6502100
00060 *      FILES:  NONE                                              *D6502100
00061 *                                                                *D6502100
00062 *  COPYBOOKS:  Z650L7PA - LINKAGE PARAMETERS                     *D6502100
00063 *              Z10FMAST - (ALIS) ALIS MASTER FILE                *D6502100
00064 *              CVAADTE  - (UL) DATE CONVERSION PARAMETERS        *D6502100
00065 *                                                                *D6502100
00066 *   OVERVIEW:  THIS PROGRAM CALCULATES THE ANNUAL 7-PAY  PREMIUM *D6502100
00067 *              FOR ADVANTAGE POLICIES.  THIS PROGRAM WILL NOT    *D6502100
00068 *              CALCULATE A VALID 7-PAY PREMIUM FOR POLICIES WITH *D6502100
00069 *              OTHER TYPES OF BASIC COVERAGES.  THE 7-PAY        *D6502100
00070 *              PREMIUM IS DEPENDENT ON THE 7-PAY START DATE AND  *D6502100
00071 *              1035 MONEY (IF THE POLICY IS NEWLY ISSUED) AND    *D6502100
00072 *              THE STATUS OF THE POLICY (COVERAGES, AMOUNTS,     *D6502100
00073 *              CASH VALUE, ETC.).                                *D6502100
00074 *                                                                *D6502100
00075 *              BEFORE THE REQUEST FOR THE CALCULATION OF THE     *D6502100
00076 *              FIRST 7-PAY PREMIUM, THIS PROGRAM MUST BE CALLED  *D6502100
00077 *              ONCE USING 'I' IN THE ACTION INDICATOR FIELD.     *D6502100
00078 *              THIS CAUSES THE COMMUTATION VALUES TO BE OBTAINED *D6502100
00079 *              FROM R2200000 AND LOADED INTO WORKING STORAGE.    *D6502100
00080 *              NO SPECIAL TERMINATION PROCESSING IS REQUIRED.    *D6502100
00081 *                                                                *D6502100
00082 *              THE SAME FORMULAS ARE USED FOR THE ISSUE AND      *D6502100
00083 *              MATERIAL CHANGE 7-PAY PREMIUM CALCULATIONS.  THE  *D6502100
00084 *              ISSUE FORMULAS ARE ONLY A MORE SPECIAL CASE OF    *D6502100
00085 *              THE GENERAL FORMULAS WHERE T IS ZERO.  THE ONLY   *D6502100
00086 *              EXCEPTION IS THAT THE AT ISSUE, AN ADJUSTMENT IS  *D6502100
00087 *              MADE TO THE 7-PAY PREMIUM BASED ON 1035 MONEY,    *D6502100
00088 *              AND AT MATERIAL CHANGE TIME, THIS ADJUSTMENT IS   *D6502100
00089 *              BASED ON THE CASH VALUE.                          *D6502100
00090 *                                                                *D6502100
00091 *              THE CASH VALUE USED IN THE CALCULATION IS THAT    *D6502100
00092 *              REFLECTED IN THE POLICY IMMEDIATELY AFTER THE     *D6502100
00093 *              MATERIAL CHANGE, RATHER THAN IMMEDIATELY BEFORE   *D6502100
00094 *              AS DICTATED IN THE ORIGINAL FORMULAS.  THIS IS    *D6502100
00095 *              DONE BECAUSE OF DIFFICULT IN DETERMININE THE      *D6502100
00096 *              HISTORICAL CONDITION OF A POLICY.                 *D6502100
00097 *                                                                *D6502100
00098 *              THE PARTS OF THE 7-PAY PREMIUM ARE CALCULATED     *D6502100
00099 *              SEPERATELY AND FINALLY TOTALLED TOGETHER AS THE   *D6502100
00100 *              LAST PHASE OF THIS PROGRAM.                       *D6502100
00101 *                                                                *D6502100
00102 **********  P R O G R A M   D O C U M E N T A T I O N  ***********D6502100
00103 /                                                                 D6502100
00104  ENVIRONMENT DIVISION.                                            D6502100
00105  CONFIGURATION SECTION.                                           D6502100
00106  INPUT-OUTPUT SECTION.                                            D6502100
00107                                                                   D6502100
00108  FILE-CONTROL.                                                    D6502100
00109 /                                                                 D6502100
00110  DATA DIVISION.                                                   D6502100
00111  FILE SECTION.                                                    D6502100
00112 /                                                                 D6502100
00113  WORKING-STORAGE SECTION.                                         D6502100
00114                                                                   D6502100
00115 ******************************************************************D6502100
00116 *                                                                *D6502100
00117 *     D A T A   A R E A S                                        *D6502100
00118 *                                                                *D6502100
00119 ******************************************************************D6502100
00120                                                                   D6502100
00121 ******************************************************************D6502100
00122 *                                                                *D6502100
00123 *    R E A D   O N L Y   C O N S T A N T S                       *D6502100
00124 *                                                                *D6502100
00125 ******************************************************************D6502100
00126                                                                   D6502100
00127  01  MISCELLANEOUS-CONSTANTS.                                     D6502100
00128      05  HEX-160000              VALUE '  '    PIC X(03).        D6502100
00129      05  HEX-00                  VALUE ' '    PIC X(01).          D6502100
00130      05  HEX-20                  VALUE '€'    PIC X(01).          D6502100
00131      05  HEX-21                  VALUE ''    PIC X(01).          D6502100
00132      05  HEX-23                  VALUE 'ƒ'    PIC X(01).          D6502100
00133      05  HEX-24                  VALUE '„'    PIC X(01).          D6502100
00134      05  HEX-25                  VALUE '
'    PIC X(01).          D6502100
00135      05  HEX-28                  VALUE 'ˆ'    PIC X(01).          D6502100
00136      05  HEX-29                  VALUE '‰'    PIC X(01).          D6502100
00137      05  HEX-26                  VALUE ''    PIC X(01).          D6502100
00138      05  HEX-33                  VALUE '“'    PIC X(01).          D6502100
00139      05  HEX-42                  VALUE 'â'    PIC X(01).          D6502100
00140      05  HEX-43                  VALUE 'ä'    PIC X(01).          D6502100
00141      05  HEX-45                  VALUE 'á'    PIC X(01).          D6502100
00142      05  SMALLD-400  COMP-3 VALUE +.038461538 PIC SV9(9).         D6502100
00143      05  DELTA-400   COMP-3 VALUE +.039220713 PIC SV9(9).         D6502100
00144      05  SMALLD-450  COMP-3 VALUE +.043062201 PIC SV9(9).         D6502100
00145      05  DELTA-450   COMP-3 VALUE +.044016885 PIC SV9(9).         D6502100
00146      05  SMALLD-500  COMP-3 VALUE +.047619048 PIC SV9(9).         D6502100
00147      05  DELTA-500   COMP-3 VALUE +.048790164 PIC SV9(9).         D6502100
00148      05  SMALLD-550  COMP-3 VALUE +.052132701 PIC SV9(9).         D6502100
00149      05  DELTA-550   COMP-3 VALUE +.053540767 PIC SV9(9).         D6502100
00150                                                                   D6502100
00151  01  7-PAY-PREMIUM-TABLE.                                         D6502100
00152      05  MALE-7-PAY-PREMIUM-TABLE                         COMP-3. D6502100
00153          10  FILLER              VALUE   +9.19  PIC S9(5)V9(2).   D6502100
00154          10  FILLER              VALUE   +8.95  PIC S9(5)V9(2).   D6502100
00155          10  FILLER              VALUE   +9.22  PIC S9(5)V9(2).   D6502100
00156          10  FILLER              VALUE   +9.53  PIC S9(5)V9(2).   D6502100
00157          10  FILLER              VALUE   +9.84  PIC S9(5)V9(2).   D6502100
00158          10  FILLER              VALUE  +10.19  PIC S9(5)V9(2).   D6502100
00159          10  FILLER              VALUE  +10.55  PIC S9(5)V9(2).   D6502100
00160          10  FILLER              VALUE  +10.94  PIC S9(5)V9(2).   D6502100
00161          10  FILLER              VALUE  +11.36  PIC S9(5)V9(2).   D6502100
00162          10  FILLER              VALUE  +11.81  PIC S9(5)V9(2).   D6502100
00163          10  FILLER              VALUE  +12.29  PIC S9(5)V9(2).   D6502100
00164          10  FILLER              VALUE  +12.80  PIC S9(5)V9(2).   D6502100
00165          10  FILLER              VALUE  +13.32  PIC S9(5)V9(2).   D6502100
00166          10  FILLER              VALUE  +13.86  PIC S9(5)V9(2).   D6502100
00167          10  FILLER              VALUE  +14.41  PIC S9(5)V9(2).   D6502100
00168          10  FILLER              VALUE  +14.96  PIC S9(5)V9(2).   D6502100
00169          10  FILLER              VALUE  +15.51  PIC S9(5)V9(2).   D6502100
00170          10  FILLER              VALUE  +16.06  PIC S9(5)V9(2).   D6502100
00171          10  FILLER              VALUE  +16.61  PIC S9(5)V9(2).   D6502100
00172          10  FILLER              VALUE  +17.17  PIC S9(5)V9(2).   D6502100
00173          10  FILLER              VALUE  +17.75  PIC S9(5)V9(2).   D6502100
00174          10  FILLER              VALUE  +18.35  PIC S9(5)V9(2).   D6502100
00175          10  FILLER              VALUE  +18.97  PIC S9(5)V9(2).   D6502100
00176          10  FILLER              VALUE  +19.64  PIC S9(5)V9(2).   D6502100
00177          10  FILLER              VALUE  +20.34  PIC S9(5)V9(2).   D6502100
00178          10  FILLER              VALUE  +21.08  PIC S9(5)V9(2).   D6502100
00179          10  FILLER              VALUE  +21.88  PIC S9(5)V9(2).   D6502100
00180          10  FILLER              VALUE  +22.72  PIC S9(5)V9(2).   D6502100
00181          10  FILLER              VALUE  +23.60  PIC S9(5)V9(2).   D6502100
00182          10  FILLER              VALUE  +24.54  PIC S9(5)V9(2).   D6502100
00183          10  FILLER              VALUE  +25.53  PIC S9(5)V9(2).   D6502100
00184          10  FILLER              VALUE  +26.56  PIC S9(5)V9(2).   D6502100
00185          10  FILLER              VALUE  +27.65  PIC S9(5)V9(2).   D6502100
00186          10  FILLER              VALUE  +28.78  PIC S9(5)V9(2).   D6502100
00187          10  FILLER              VALUE  +29.97  PIC S9(5)V9(2).   D6502100
00188          10  FILLER              VALUE  +31.20  PIC S9(5)V9(2).   D6502100
00189          10  FILLER              VALUE  +32.49  PIC S9(5)V9(2).   D6502100
00190          10  FILLER              VALUE  +33.83  PIC S9(5)V9(2).   D6502100
00191          10  FILLER              VALUE  +35.23  PIC S9(5)V9(2).   D6502100
00192          10  FILLER              VALUE  +36.67  PIC S9(5)V9(2).   D6502100
00193          10  FILLER              VALUE  +38.17  PIC S9(5)V9(2).   D6502100
00194          10  FILLER              VALUE  +39.73  PIC S9(5)V9(2).   D6502100
00195          10  FILLER              VALUE  +41.33  PIC S9(5)V9(2).   D6502100
00196          10  FILLER              VALUE  +42.99  PIC S9(5)V9(2).   D6502100
00197          10  FILLER              VALUE  +44.71  PIC S9(5)V9(2).   D6502100
00198          10  FILLER              VALUE  +46.48  PIC S9(5)V9(2).   D6502100
00199          10  FILLER              VALUE  +48.31  PIC S9(5)V9(2).   D6502100
00200          10  FILLER              VALUE  +50.20  PIC S9(5)V9(2).   D6502100
00201          10  FILLER              VALUE  +52.17  PIC S9(5)V9(2).   D6502100
00202          10  FILLER              VALUE  +54.20  PIC S9(5)V9(2).   D6502100
00203          10  FILLER              VALUE  +56.31  PIC S9(5)V9(2).   D6502100
00204          10  FILLER              VALUE  +58.49  PIC S9(5)V9(2).   D6502100
00205          10  FILLER              VALUE  +60.75  PIC S9(5)V9(2).   D6502100
00206          10  FILLER              VALUE  +63.09  PIC S9(5)V9(2).   D6502100
00207          10  FILLER              VALUE  +65.50  PIC S9(5)V9(2).   D6502100
00208          10  FILLER              VALUE  +67.98  PIC S9(5)V9(2).   D6502100
00209          10  FILLER              VALUE  +70.53  PIC S9(5)V9(2).   D6502100
00210          10  FILLER              VALUE  +73.16  PIC S9(5)V9(2).   D6502100
00211          10  FILLER              VALUE  +75.88  PIC S9(5)V9(2).   D6502100
00212          10  FILLER              VALUE  +78.70  PIC S9(5)V9(2).   D6502100
00213          10  FILLER              VALUE  +81.63  PIC S9(5)V9(2).   D6502100
00214          10  FILLER              VALUE  +84.68  PIC S9(5)V9(2).   D6502100
00215          10  FILLER              VALUE  +87.85  PIC S9(5)V9(2).   D6502100
00216          10  FILLER              VALUE  +91.15  PIC S9(5)V9(2).   D6502100
00217          10  FILLER              VALUE  +94.56  PIC S9(5)V9(2).   D6502100
00218          10  FILLER              VALUE  +98.09  PIC S9(5)V9(2).   D6502100
00219          10  FILLER              VALUE +101.74  PIC S9(5)V9(2).   D6502100
00220          10  FILLER              VALUE +105.55  PIC S9(5)V9(2).   D6502100
00221          10  FILLER              VALUE +109.54  PIC S9(5)V9(2).   D6502100
00222          10  FILLER              VALUE +113.76  PIC S9(5)V9(2).   D6502100
00223          10  FILLER              VALUE +118.25  PIC S9(5)V9(2).   D6502100
00224          10  FILLER              VALUE +123.04  PIC S9(5)V9(2).   D6502100
00225          10  FILLER              VALUE +128.15  PIC S9(5)V9(2).   D6502100
00226          10  FILLER              VALUE +133.56  PIC S9(5)V9(2).   D6502100
00227          10  FILLER              VALUE +139.24  PIC S9(5)V9(2).   D6502100
00228          10  FILLER              VALUE +145.17  PIC S9(5)V9(2).   D6502100
00229          10  FILLER              VALUE +151.36  PIC S9(5)V9(2).   D6502100
00230          10  FILLER              VALUE +157.86  PIC S9(5)V9(2).   D6502100
00231          10  FILLER              VALUE +164.77  PIC S9(5)V9(2).   D6502100
00232          10  FILLER              VALUE +172.22  PIC S9(5)V9(2).   D6502100
00233          10  FILLER              VALUE +180.37  PIC S9(5)V9(2).   D6502100
00234          10  FILLER              VALUE +189.32  PIC S9(5)V9(2).   D6502100
00235          10  FILLER              VALUE +199.12  PIC S9(5)V9(2).   D6502100
00236          10  FILLER              VALUE +209.78  PIC S9(5)V9(2).   D6502100
00237          10  FILLER              VALUE +221.17  PIC S9(5)V9(2).   D6502100
00238          10  FILLER              VALUE +233.23  PIC S9(5)V9(2).   D6502100
00239          10  FILLER              VALUE +245.93  PIC S9(5)V9(2).   D6502100
00240          10  FILLER              VALUE +259.33  PIC S9(5)V9(2).   D6502100
00241          10  FILLER              VALUE +273.58  PIC S9(5)V9(2).   D6502100
00242          10  FILLER              VALUE +289.06  PIC S9(5)V9(2).   D6502100
00243          10  FILLER              VALUE +306.47  PIC S9(5)V9(2).   D6502100
00244          10  FILLER              VALUE +327.12  PIC S9(5)V9(2).   D6502100
00245          10  FILLER              VALUE +353.39  PIC S9(5)V9(2).   D6502100
00246          10  FILLER              VALUE +389.05  PIC S9(5)V9(2).   D6502100
00247          10  FILLER              VALUE +438.86  PIC S9(5)V9(2).   D6502100
00248          10  FILLER              VALUE +510.12  PIC S9(5)V9(2).   D6502100
00249          10  FILLER              VALUE +619.48  PIC S9(5)V9(2).   D6502100
00250          10  FILLER              VALUE +802.24  PIC S9(5)V9(2).   D6502100
00251          10  FILLER              VALUE +1145.67 PIC S9(5)V9(2).   D6502100
00252          10  FILLER              VALUE +1933.53 PIC S9(5)V9(2).   D6502100
00253      05  FEMALE-7-PAY-PREMIUM-TABLE                       COMP-3. D6502100
00254          10  FILLER              VALUE   +7.28  PIC S9(5)V9(2).   D6502100
00255          10  FILLER              VALUE   +7.16  PIC S9(5)V9(2).   D6502100
00256          10  FILLER              VALUE   +7.38  PIC S9(5)V9(2).   D6502100
00257          10  FILLER              VALUE   +7.62  PIC S9(5)V9(2).   D6502100
00258          10  FILLER              VALUE   +7.87  PIC S9(5)V9(2).   D6502100
00259          10  FILLER              VALUE   +8.14  PIC S9(5)V9(2).   D6502100
00260          10  FILLER              VALUE   +8.42  PIC S9(5)V9(2).   D6502100
00261          10  FILLER              VALUE   +8.73  PIC S9(5)V9(2).   D6502100
00262          10  FILLER              VALUE   +9.05  PIC S9(5)V9(2).   D6502100
00263          10  FILLER              VALUE   +9.39  PIC S9(5)V9(2).   D6502100
00264          10  FILLER              VALUE   +9.75  PIC S9(5)V9(2).   D6502100
00265          10  FILLER              VALUE  +10.13  PIC S9(5)V9(2).   D6502100
00266          10  FILLER              VALUE  +10.53  PIC S9(5)V9(2).   D6502100
00267          10  FILLER              VALUE  +10.94  PIC S9(5)V9(2).   D6502100
00268          10  FILLER              VALUE  +11.37  PIC S9(5)V9(2).   D6502100
00269          10  FILLER              VALUE  +11.82  PIC S9(5)V9(2).   D6502100
00270          10  FILLER              VALUE  +12.28  PIC S9(5)V9(2).   D6502100
00271          10  FILLER              VALUE  +12.75  PIC S9(5)V9(2).   D6502100
00272          10  FILLER              VALUE  +13.24  PIC S9(5)V9(2).   D6502100
00273          10  FILLER              VALUE  +13.75  PIC S9(5)V9(2).   D6502100
00274          10  FILLER              VALUE  +14.29  PIC S9(5)V9(2).   D6502100
00275          10  FILLER              VALUE  +14.84  PIC S9(5)V9(2).   D6502100
00276          10  FILLER              VALUE  +15.42  PIC S9(5)V9(2).   D6502100
00277          10  FILLER              VALUE  +16.02  PIC S9(5)V9(2).   D6502100
00278          10  FILLER              VALUE  +16.66  PIC S9(5)V9(2).   D6502100
00279          10  FILLER              VALUE  +17.32  PIC S9(5)V9(2).   D6502100
00280          10  FILLER              VALUE  +18.01  PIC S9(5)V9(2).   D6502100
00281          10  FILLER              VALUE  +18.74  PIC S9(5)V9(2).   D6502100
00282          10  FILLER              VALUE  +19.49  PIC S9(5)V9(2).   D6502100
00283          10  FILLER              VALUE  +20.28  PIC S9(5)V9(2).   D6502100
00284          10  FILLER              VALUE  +21.11  PIC S9(5)V9(2).   D6502100
00285          10  FILLER              VALUE  +21.97  PIC S9(5)V9(2).   D6502100
00286          10  FILLER              VALUE  +22.87  PIC S9(5)V9(2).   D6502100
00287          10  FILLER              VALUE  +23.81  PIC S9(5)V9(2).   D6502100
00288          10  FILLER              VALUE  +24.79  PIC S9(5)V9(2).   D6502100
00289          10  FILLER              VALUE  +25.81  PIC S9(5)V9(2).   D6502100
00290          10  FILLER              VALUE  +26.88  PIC S9(5)V9(2).   D6502100
00291          10  FILLER              VALUE  +27.99  PIC S9(5)V9(2).   D6502100
00292          10  FILLER              VALUE  +29.14  PIC S9(5)V9(2).   D6502100
00293          10  FILLER              VALUE  +30.34  PIC S9(5)V9(2).   D6502100
00294          10  FILLER              VALUE  +31.57  PIC S9(5)V9(2).   D6502100
00295          10  FILLER              VALUE  +32.84  PIC S9(5)V9(2).   D6502100
00296          10  FILLER              VALUE  +34.15  PIC S9(5)V9(2).   D6502100
00297          10  FILLER              VALUE  +35.49  PIC S9(5)V9(2).   D6502100
00298          10  FILLER              VALUE  +36.89  PIC S9(5)V9(2).   D6502100
00299          10  FILLER              VALUE  +38.32  PIC S9(5)V9(2).   D6502100
00300          10  FILLER              VALUE  +39.81  PIC S9(5)V9(2).   D6502100
00301          10  FILLER              VALUE  +41.35  PIC S9(5)V9(2).   D6502100
00302          10  FILLER              VALUE  +42.94  PIC S9(5)V9(2).   D6502100
00303          10  FILLER              VALUE  +44.59  PIC S9(5)V9(2).   D6502100
00304          10  FILLER              VALUE  +46.30  PIC S9(5)V9(2).   D6502100
00305          10  FILLER              VALUE  +48.07  PIC S9(5)V9(2).   D6502100
00306          10  FILLER              VALUE  +49.89  PIC S9(5)V9(2).   D6502100
00307          10  FILLER              VALUE  +51.78  PIC S9(5)V9(2).   D6502100
00308          10  FILLER              VALUE  +53.72  PIC S9(5)V9(2).   D6502100
00309          10  FILLER              VALUE  +55.72  PIC S9(5)V9(2).   D6502100
00310          10  FILLER              VALUE  +57.78  PIC S9(5)V9(2).   D6502100
00311          10  FILLER              VALUE  +59.91  PIC S9(5)V9(2).   D6502100
00312          10  FILLER              VALUE  +62.13  PIC S9(5)V9(2).   D6502100
00313          10  FILLER              VALUE  +64.45  PIC S9(5)V9(2).   D6502100
00314          10  FILLER              VALUE  +66.89  PIC S9(5)V9(2).   D6502100
00315          10  FILLER              VALUE  +69.45  PIC S9(5)V9(2).   D6502100
00316          10  FILLER              VALUE  +72.14  PIC S9(5)V9(2).   D6502100
00317          10  FILLER              VALUE  +74.95  PIC S9(5)V9(2).   D6502100
00318          10  FILLER              VALUE  +77.85  PIC S9(5)V9(2).   D6502100
00319          10  FILLER              VALUE  +80.83  PIC S9(5)V9(2).   D6502100
00320          10  FILLER              VALUE  +83.90  PIC S9(5)V9(2).   D6502100
00321          10  FILLER              VALUE  +87.08  PIC S9(5)V9(2).   D6502100
00322          10  FILLER              VALUE  +90.41  PIC S9(5)V9(2).   D6502100
00323          10  FILLER              VALUE  +93.93  PIC S9(5)V9(2).   D6502100
00324          10  FILLER              VALUE  +97.70  PIC S9(5)V9(2).   D6502100
00325          10  FILLER              VALUE +101.75  PIC S9(5)V9(2).   D6502100
00326          10  FILLER              VALUE +106.10  PIC S9(5)V9(2).   D6502100
00327          10  FILLER              VALUE +110.75  PIC S9(5)V9(2).   D6502100
00328          10  FILLER              VALUE +115.67  PIC S9(5)V9(2).   D6502100
00329          10  FILLER              VALUE +120.65  PIC S9(5)V9(2).   D6502100
00330          10  FILLER              VALUE +126.33  PIC S9(5)V9(2).   D6502100
00331          10  FILLER              VALUE +132.13  PIC S9(5)V9(2).   D6502100
00332          10  FILLER              VALUE +138.35  PIC S9(5)V9(2).   D6502100
00333          10  FILLER              VALUE +145.11  PIC S9(5)V9(2).   D6502100
00334          10  FILLER              VALUE +152.54  PIC S9(5)V9(2).   D6502100
00335          10  FILLER              VALUE +160.76  PIC S9(5)V9(2).   D6502100
00336          10  FILLER              VALUE +169.83  PIC S9(5)V9(2).   D6502100
00337          10  FILLER              VALUE +179.80  PIC S9(5)V9(2).   D6502100
00338          10  FILLER              VALUE +190.66  PIC S9(5)V9(2).   D6502100
00339          10  FILLER              VALUE +202.44  PIC S9(5)V9(2).   D6502100
00340          10  FILLER              VALUE +215.20  PIC S9(5)V9(2).   D6502100
00341          10  FILLER              VALUE +229.80  PIC S9(5)V9(2).   D6502100
00342          10  FILLER              VALUE +244.29  PIC S9(5)V9(2).   D6502100
00343          10  FILLER              VALUE +261.24  PIC S9(5)V9(2).   D6502100
00344          10  FILLER              VALUE +280.63  PIC S9(5)V9(2).   D6502100
00345          10  FILLER              VALUE +303.76  PIC S9(5)V9(2).   D6502100
00346          10  FILLER              VALUE +332.92  PIC S9(5)V9(2).   D6502100
00347          10  FILLER              VALUE +371.75  PIC S9(5)V9(2).   D6502100
00348          10  FILLER              VALUE +424.70  PIC S9(5)V9(2).   D6502100
00349          10  FILLER              VALUE +498.98  PIC S9(5)V9(2).   D6502100
00350          10  FILLER              VALUE +611.22  PIC S9(5)V9(2).   D6502100
00351          10  FILLER              VALUE +796.70  PIC S9(5)V9(2).   D6502100
00352          10  FILLER              VALUE +1142.82 PIC S9(5)V9(2).   D6502100
00353          10  FILLER              VALUE +1935.80 PIC S9(5)V9(2).   D6502100
00354                                                                   D6502100
00355  01  7-PAY-PREMIUMS REDEFINES 7-PAY-PREMIUM-TABLE.                D6502100
00356      05  7-PAY-PREMIUMS-BY-SEX                                    D6502100
00357              OCCURS 2 TIMES.                                      D6502100
00358          10  7-PAY-PREMIUM-ENTRIES                                D6502100
00359                  OCCURS 100 TIMES.                                D6502100
00360              15  7-PAY-PREMIUM                  PIC S9(5)V9(2)    D6502100
00361                                                           COMP-3. D6502100
00362                                                                   D6502100
00363  01  7-YEAR-ANNUITY-TABLE.                                        D6502100
00364      05  MALE-7-YEAR-ANNUITY-TABLE                        COMP-3. D6502100
00365          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00366          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00367          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00368          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00369          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00370          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00371          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00372          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00373          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00374          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00375                                                                   D6502100
00376          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00377          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00378          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00379          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00380          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00381          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00382          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00383          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00384          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00385          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00386                                                                   D6502100
00387          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00388          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00389          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00390          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00391          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00392          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00393          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00394          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00395          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00396          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00397                                                                   D6502100
00398          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00399          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00400          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00401          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00402          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00403          10  FILLER              VALUE  +6.02   PIC S9(3)V9(2).   D6502100
00404          10  FILLER              VALUE  +6.02   PIC S9(3)V9(2).   D6502100
00405          10  FILLER              VALUE  +6.02   PIC S9(3)V9(2).   D6502100
00406          10  FILLER              VALUE  +6.01   PIC S9(3)V9(2).   D6502100
00407          10  FILLER              VALUE  +6.01   PIC S9(3)V9(2).   D6502100
00408                                                                   D6502100
00409          10  FILLER              VALUE  +6.00   PIC S9(3)V9(2).   D6502100
00410          10  FILLER              VALUE  +5.99   PIC S9(3)V9(2).   D6502100
00411          10  FILLER              VALUE  +5.99   PIC S9(3)V9(2).   D6502100
00412          10  FILLER              VALUE  +5.98   PIC S9(3)V9(2).   D6502100
00413          10  FILLER              VALUE  +5.97   PIC S9(3)V9(2).   D6502100
00414          10  FILLER              VALUE  +5.97   PIC S9(3)V9(2).   D6502100
00415          10  FILLER              VALUE  +5.96   PIC S9(3)V9(2).   D6502100
00416          10  FILLER              VALUE  +5.95   PIC S9(3)V9(2).   D6502100
00417          10  FILLER              VALUE  +5.94   PIC S9(3)V9(2).   D6502100
00418          10  FILLER              VALUE  +5.93   PIC S9(3)V9(2).   D6502100
00419                                                                   D6502100
00420          10  FILLER              VALUE  +5.91   PIC S9(3)V9(2).   D6502100
00421          10  FILLER              VALUE  +5.90   PIC S9(3)V9(2).   D6502100
00422          10  FILLER              VALUE  +5.88   PIC S9(3)V9(2).   D6502100
00423          10  FILLER              VALUE  +5.87   PIC S9(3)V9(2).   D6502100
00424          10  FILLER              VALUE  +5.85   PIC S9(3)V9(2).   D6502100
00425          10  FILLER              VALUE  +5.83   PIC S9(3)V9(2).   D6502100
00426          10  FILLER              VALUE  +5.81   PIC S9(3)V9(2).   D6502100
00427          10  FILLER              VALUE  +5.78   PIC S9(3)V9(2).   D6502100
00428          10  FILLER              VALUE  +5.76   PIC S9(3)V9(2).   D6502100
00429          10  FILLER              VALUE  +5.73   PIC S9(3)V9(2).   D6502100
00430                                                                   D6502100
00431          10  FILLER              VALUE  +5.70   PIC S9(3)V9(2).   D6502100
00432          10  FILLER              VALUE  +5.67   PIC S9(3)V9(2).   D6502100
00433          10  FILLER              VALUE  +5.63   PIC S9(3)V9(2).   D6502100
00434          10  FILLER              VALUE  +5.59   PIC S9(3)V9(2).   D6502100
00435          10  FILLER              VALUE  +5.55   PIC S9(3)V9(2).   D6502100
00436          10  FILLER              VALUE  +5.50   PIC S9(3)V9(2).   D6502100
00437          10  FILLER              VALUE  +5.45   PIC S9(3)V9(2).   D6502100
00438          10  FILLER              VALUE  +5.40   PIC S9(3)V9(2).   D6502100
00439          10  FILLER              VALUE  +5.34   PIC S9(3)V9(2).   D6502100
00440          10  FILLER              VALUE  +5.27   PIC S9(3)V9(2).   D6502100
00441                                                                   D6502100
00442          10  FILLER              VALUE  +5.20   PIC S9(3)V9(2).   D6502100
00443          10  FILLER              VALUE  +5.12   PIC S9(3)V9(2).   D6502100
00444          10  FILLER              VALUE  +5.04   PIC S9(3)V9(2).   D6502100
00445          10  FILLER              VALUE  +4.94   PIC S9(3)V9(2).   D6502100
00446          10  FILLER              VALUE  +4.85   PIC S9(3)V9(2).   D6502100
00447          10  FILLER              VALUE  +4.75   PIC S9(3)V9(2).   D6502100
00448          10  FILLER              VALUE  +4.65   PIC S9(3)V9(2).   D6502100
00449          10  FILLER              VALUE  +4.54   PIC S9(3)V9(2).   D6502100
00450          10  FILLER              VALUE  +4.43   PIC S9(3)V9(2).   D6502100
00451          10  FILLER              VALUE  +4.31   PIC S9(3)V9(2).   D6502100
00452                                                                   D6502100
00453          10  FILLER              VALUE  +4.19   PIC S9(3)V9(2).   D6502100
00454          10  FILLER              VALUE  +4.06   PIC S9(3)V9(2).   D6502100
00455          10  FILLER              VALUE  +3.92   PIC S9(3)V9(2).   D6502100
00456          10  FILLER              VALUE  +3.77   PIC S9(3)V9(2).   D6502100
00457          10  FILLER              VALUE  +3.63   PIC S9(3)V9(2).   D6502100
00458          10  FILLER              VALUE  +3.49   PIC S9(3)V9(2).   D6502100
00459          10  FILLER              VALUE  +3.35   PIC S9(3)V9(2).   D6502100
00460          10  FILLER              VALUE  +3.21   PIC S9(3)V9(2).   D6502100
00461          10  FILLER              VALUE  +3.08   PIC S9(3)V9(2).   D6502100
00462          10  FILLER              VALUE  +2.95   PIC S9(3)V9(2).   D6502100
00463                                                                   D6502100
00464          10  FILLER              VALUE  +2.81   PIC S9(3)V9(2).   D6502100
00465          10  FILLER              VALUE  +2.66   PIC S9(3)V9(2).   D6502100
00466          10  FILLER              VALUE  +2.49   PIC S9(3)V9(2).   D6502100
00467          10  FILLER              VALUE  +2.29   PIC S9(3)V9(2).   D6502100
00468          10  FILLER              VALUE  +2.05   PIC S9(3)V9(2).   D6502100
00469          10  FILLER              VALUE  +1.79   PIC S9(3)V9(2).   D6502100
00470          10  FILLER              VALUE  +1.49   PIC S9(3)V9(2).   D6502100
00471          10  FILLER              VALUE  +1.17   PIC S9(3)V9(2).   D6502100
00472          10  FILLER              VALUE  +0.83   PIC S9(3)V9(2).   D6502100
00473          10  FILLER              VALUE  +0.50   PIC S9(3)V9(2).   D6502100
00474                                                                   D6502100
00475      05  FEMALE-7-YEAR-ANNUITY-TABLE                      COMP-3. D6502100
00476          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00477          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00478          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00479          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00480          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00481          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00482          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00483          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00484          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00485          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00486                                                                   D6502100
00487          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00488          10  FILLER              VALUE  +6.06   PIC S9(3)V9(2).   D6502100
00489          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00490          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00491          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00492          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00493          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00494          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00495          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00496          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00497                                                                   D6502100
00498          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00499          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00500          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00501          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00502          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00503          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00504          10  FILLER              VALUE  +6.05   PIC S9(3)V9(2).   D6502100
00505          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00506          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00507          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00508                                                                   D6502100
00509          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00510          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00511          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00512          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00513          10  FILLER              VALUE  +6.04   PIC S9(3)V9(2).   D6502100
00514          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00515          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00516          10  FILLER              VALUE  +6.03   PIC S9(3)V9(2).   D6502100
00517          10  FILLER              VALUE  +6.02   PIC S9(3)V9(2).   D6502100
00518          10  FILLER              VALUE  +6.02   PIC S9(3)V9(2).   D6502100
00519                                                                   D6502100
00520          10  FILLER              VALUE  +6.01   PIC S9(3)V9(2).   D6502100
00521          10  FILLER              VALUE  +6.01   PIC S9(3)V9(2).   D6502100
00522          10  FILLER              VALUE  +6.01   PIC S9(3)V9(2).   D6502100
00523          10  FILLER              VALUE  +6.00   PIC S9(3)V9(2).   D6502100
00524          10  FILLER              VALUE  +6.00   PIC S9(3)V9(2).   D6502100
00525          10  FILLER              VALUE  +5.99   PIC S9(3)V9(2).   D6502100
00526          10  FILLER              VALUE  +5.99   PIC S9(3)V9(2).   D6502100
00527          10  FILLER              VALUE  +5.98   PIC S9(3)V9(2).   D6502100
00528          10  FILLER              VALUE  +5.97   PIC S9(3)V9(2).   D6502100
00529          10  FILLER              VALUE  +5.97   PIC S9(3)V9(2).   D6502100
00530                                                                   D6502100
00531          10  FILLER              VALUE  +5.96   PIC S9(3)V9(2).   D6502100
00532          10  FILLER              VALUE  +5.95   PIC S9(3)V9(2).   D6502100
00533          10  FILLER              VALUE  +5.94   PIC S9(3)V9(2).   D6502100
00534          10  FILLER              VALUE  +5.93   PIC S9(3)V9(2).   D6502100
00535          10  FILLER              VALUE  +5.92   PIC S9(3)V9(2).   D6502100
00536          10  FILLER              VALUE  +5.91   PIC S9(3)V9(2).   D6502100
00537          10  FILLER              VALUE  +5.90   PIC S9(3)V9(2).   D6502100
00538          10  FILLER              VALUE  +5.89   PIC S9(3)V9(2).   D6502100
00539          10  FILLER              VALUE  +5.88   PIC S9(3)V9(2).   D6502100
00540          10  FILLER              VALUE  +5.87   PIC S9(3)V9(2).   D6502100
00541                                                                   D6502100
00542          10  FILLER              VALUE  +5.85   PIC S9(3)V9(2).   D6502100
00543          10  FILLER              VALUE  +5.84   PIC S9(3)V9(2).   D6502100
00544          10  FILLER              VALUE  +5.81   PIC S9(3)V9(2).   D6502100
00545          10  FILLER              VALUE  +5.79   PIC S9(3)V9(2).   D6502100
00546          10  FILLER              VALUE  +5.76   PIC S9(3)V9(2).   D6502100
00547          10  FILLER              VALUE  +5.74   PIC S9(3)V9(2).   D6502100
00548          10  FILLER              VALUE  +5.71   PIC S9(3)V9(2).   D6502100
00549          10  FILLER              VALUE  +5.68   PIC S9(3)V9(2).   D6502100
00550          10  FILLER              VALUE  +5.64   PIC S9(3)V9(2).   D6502100
00551          10  FILLER              VALUE  +5.60   PIC S9(3)V9(2).   D6502100
00552                                                                   D6502100
00553          10  FILLER              VALUE  +5.56   PIC S9(3)V9(2).   D6502100
00554          10  FILLER              VALUE  +5.50   PIC S9(3)V9(2).   D6502100
00555          10  FILLER              VALUE  +5.44   PIC S9(3)V9(2).   D6502100
00556          10  FILLER              VALUE  +5.37   PIC S9(3)V9(2).   D6502100
00557          10  FILLER              VALUE  +5.29   PIC S9(3)V9(2).   D6502100
00558          10  FILLER              VALUE  +5.20   PIC S9(3)V9(2).   D6502100
00559          10  FILLER              VALUE  +5.11   PIC S9(3)V9(2).   D6502100
00560          10  FILLER              VALUE  +5.01   PIC S9(3)V9(2).   D6502100
00561          10  FILLER              VALUE  +4.91   PIC S9(3)V9(2).   D6502100
00562          10  FILLER              VALUE  +4.79   PIC S9(3)V9(2).   D6502100
00563                                                                   D6502100
00564          10  FILLER              VALUE  +4.66   PIC S9(3)V9(2).   D6502100
00565          10  FILLER              VALUE  +4.53   PIC S9(3)V9(2).   D6502100
00566          10  FILLER              VALUE  +4.38   PIC S9(3)V9(2).   D6502100
00567          10  FILLER              VALUE  +4.22   PIC S9(3)V9(2).   D6502100
00568          10  FILLER              VALUE  +4.06   PIC S9(3)V9(2).   D6502100
00569          10  FILLER              VALUE  +3.89   PIC S9(3)V9(2).   D6502100
00570          10  FILLER              VALUE  +3.72   PIC S9(3)V9(2).   D6502100
00571          10  FILLER              VALUE  +3.55   PIC S9(3)V9(2).   D6502100
00572          10  FILLER              VALUE  +3.38   PIC S9(3)V9(2).   D6502100
00573          10  FILLER              VALUE  +3.21   PIC S9(3)V9(2).   D6502100
00574                                                                   D6502100
00575          10  FILLER              VALUE  +3.03   PIC S9(3)V9(2).   D6502100
00576          10  FILLER              VALUE  +2.83   PIC S9(3)V9(2).   D6502100
00577          10  FILLER              VALUE  +2.62   PIC S9(3)V9(2).   D6502100
00578          10  FILLER              VALUE  +2.38   PIC S9(3)V9(2).   D6502100
00579          10  FILLER              VALUE  +2.11   PIC S9(3)V9(2).   D6502100
00580          10  FILLER              VALUE  +1.82   PIC S9(3)V9(2).   D6502100
00581          10  FILLER              VALUE  +1.51   PIC S9(3)V9(2).   D6502100
00582          10  FILLER              VALUE  +1.18   PIC S9(3)V9(2).   D6502100
00583          10  FILLER              VALUE  +0.84   PIC S9(3)V9(2).   D6502100
00584          10  FILLER              VALUE  +0.50   PIC S9(3)V9(2).   D6502100
00585                                                                   D6502100
00586  01  7-YEAR-ANNUITY-FACTORS REDEFINES 7-YEAR-ANNUITY-TABLE.       D6502100
00587      05  7-YEAR-ANNUITY-FACTORS-BY-SEX                            D6502100
00588              OCCURS 2 TIMES.                                      D6502100
00589          10  7-YEAR-ANNUITY-ENTRIES                               D6502100
00590                  OCCURS 100 TIMES.                                D6502100
00591              15  7-YEAR-ANNUITY-FACTOR          PIC S9(3)V9(2)    D6502100
00592                                                           COMP-3. D6502100
00593 /                                                                 D6502100
00594 ******************************************************************D6502100
00595 *                                                                *D6502100
00596 *    V A R I A B L E   D A T A   A R E A S                       *D6502100
00597 *                                                                *D6502100
00598 ******************************************************************D6502100
00599                                                                   D6502100
00600 ******************************************************************D6502100
00601 *    WORKING STORAGE RECORD IMAGES                               *D6502100
00602 ******************************************************************D6502100
00603                                                                   D6502100
00604 ******************************************************************D6502100
00605 *    PARAMETER AREAS FOR CALLED PROGRAMS                         *D6502100
00606 ******************************************************************D6502100
00607                                                                   D6502100
00608  01  DATE-CALC-AREA.                                              D6502100
00609      05  OPTION-CODE                  PIC X.                      D6502100
00610          88  JUL-TO-GREG                      VALUE '1'.          D6502100
00611          88  GREG-TO-JUL                      VALUE '2'.          D6502100
00612      05  DATE-AREA-1.                                             D6502100
00613          10  GREG-DATE-1.                                         D6502100
00614              15  GREG-MONTH-1         PIC 99.                     D6502100
00615              15  FILLER               PIC X.                      D6502100
00616              15  GREG-DAY-1           PIC 99.                     D6502100
00617              15  FILLER               PIC X.                      D6502100
00618              15  GREG-YEAR-1          PIC 9(4).                   D6502100
00619      05  DATE-AREA-2.                                             D6502100
00620          10  JUL-DATE-2.                                          D6502100
00621              15  JUL-YEAR-2           PIC 9(3).                   D6502100
00622              15  JUL-DAY-2            PIC 9(3).                   D6502100
00623          10  FILLER                   PIC X(4).                   D6502100
00624                                                                   D6502100
00625  01  PARAMETERS-FOR-R2200000.                                     D6502100
00626      05  R2200000                               PIC X(08)         D6502100
00627                                  VALUE 'R2200000'.                D6502100
AL8775*    05  RESULT-AREA-COMM                                  COMP-3.D6502100
AL8775*        10  LX                                 PIC S9(11).       D6502100
AL8775*        10  SMALL-DX                           PIC S9(11).       D6502100
AL8775*        10  THOUSAND-QX                        PIC S9(9)V9(2).   D6502100
AL8775*        10  R22-DX                             PIC S9(10)V9(1).  D6502100
AL8775*        10  R22-NX                             PIC S9(12)V9(1).  D6502100
AL8775*        10  CX                                 PIC S9(10)V9(1).  D6502100
AL8775*        10  R22-MX                             PIC S9(10)V9(1).  D6502100
AL8775     05  RESULT-AREA-COMM.
AL8775         10  LX                        COMP-3   PIC S9(11).
AL8775         10  SMALL-DX                  COMP-3   PIC S9(11).
AL8775         10  THOUSAND-QX               COMP-3   PIC S9(9)V9(2).
AL8775         10  R22-DX                    COMP-3   PIC S9(10)V9(1).
AL8775         10  R22-NX                    COMP-3   PIC S9(12)V9(1).
AL8775         10  CX                        COMP-3   PIC S9(10)V9(1).
AL8775         10  R22-MX                    COMP-3   PIC S9(10)V9(1).
AL8775         10  FILLER                             PIC X(91).
00636      05  RESULT-AREA-PREM.                                        D6502100
00637          10  MALE-PREMIUM                       PIC S9(5)V9(2)    D6502100
00638                                                           COMP-3. D6502100
00639          10  FILLER                             PIC X(14).        D6502100
00640          10  FEMALE-PREMIUM                     PIC S9(5)V9(2)    D6502100
00641                                                           COMP-3. D6502100
00642          10  FILLER                             PIC X(14).        D6502100
00643          10  WPD-PREMIUM                        PIC S9(3)V9(2)    D6502100
00644                                                           COMP-3. D6502100
00645      05  R22-CV                        COMP-3   PIC S9(7)V99.     D6502100
00646      05  R22-NSP                       COMP-3   PIC S9(5)V9(6).   D6502100
00647      05  JOBMARK                                PIC S9(4) COMP    D6502100
00648                                                           SYNC.   D6502100
00649      05  JOB02                                  PIC S9(4) COMP    D6502100
00650                                  VALUE +02                SYNC.   D6502100
00651      05  JOB06                                  PIC S9(4) COMP    D6502100
00652                                  VALUE +06                SYNC.   D6502100
00653      05  JOB17                                  PIC S9(4) COMP    D6502100
00654                                  VALUE +17                SYNC.   D6502100
00655      05  R22-POLICY-NUMBER                      PIC X(10)         D6502100
00656                                  VALUE '1613000000'.              D6502100
00657      05  PLANCODE-JOB13.                                          D6502100
00658          10  TABLECODE                          PIC X(04).        D6502100
00659          10  SELECT-PERIOD                      PIC S9(4) COMP    D6502100
00660                                                           SYNC.   D6502100
00661      05  PLANCODE-JOB6.                                           D6502100
00662          10  PLANCODE-CLASS                     PIC X(01).        D6502100
00663          10  PLANCODE-SERIES                    PIC X(05).        D6502100
00664      05  R22-AGE                                PIC S9(3) COMP-3. D6502100
00665      05  R22-DURATION                           PIC S9(3) COMP-3. D6502100
00666      05  R22-RESIDUAL-VALUE      VALUE SPACES   PIC X(23).        D6502100
00667      05  R22-STATUS-CODE                        PIC S9(4) COMP    D6502100
00668                                                           SYNC.   D6502100
00669      05  R22-NUMBER-OF-UNITS                    PIC S9(5)V9(4)    D6502100
00670                                                           COMP-3. D6502100
00671      05  R22-AGE-TABLE.                                           D6502100
00672          10  R22-AGE-PARM OCCURS 10 TIMES COMP-3 PIC S9(3).       D6502100
00673      05  R22-STATUS-CODE-TABLE.                                   D6502100
00674          10  R22-STATUS-CODE-PARM OCCURS 10 TIMES COMP PIC S9(4). D6502100
00675      05  R22-SPECIAL-TABLE.                                       D6502100
00676          10  R22-SPECIAL-TABLE-PARM OCCURS 10 TIMES PIC XX.       D6502100
00677      05  R22-CASH-VAL-T-1 VALUE +0       COMP-3 PIC S9(9).        D6502100
00678      05  R22-CASH-VAL-T   VALUE +0       COMP-3 PIC S9(9).        D6502100
00679      05  R22-PU-T         VALUE +0       COMP-3 PIC S9(9).        D6502100
00680      05  R22-JOINT.                                               D6502100
00681          10 R22-JNT1  VALUE +0           COMP-3 PIC S9(3).        D6502100
00682          10 R22-JNT2  VALUE +0           COMP-3 PIC S9(3).        D6502100
00683      05  R22-ISSUEDATE.                                           D6502100
00684          10 FILLER   VALUE +0            COMP-3 PIC S9(3).        D6502100
00685          10 FILLER   VALUE +0            COMP-3 PIC S9(3).        D6502100
00686      05  R22-SEX.                                                 D6502100
00687          10  R22-SEX-PARM OCCURS 10 TIMES        PIC X.           D6502100
00688      05  R22-FLAT-EXTRA-CODE.                                     D6502100
00689          10  R22-FLAT-EXTRA-PARM OCCURS 10 TIMES.                 D6502100
00690              15  R22-PERM-FE              COMP-3 PIC S9(3)V99.    D6502100
00691              15  R22-TEMP-FE              COMP-3 PIC S9(3)V99.    D6502100
00692              15  R22-TEMP-DUR             COMP-3 PIC S9(3).       D6502100
00693  01  FLAT-EXTRA-CODE-ZERO.                                        D6502100
00694      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00695      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00696      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00697      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00698      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00699      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00700      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00701      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00702      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00703      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00704      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00705      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00706      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00707      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00708      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00709      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00710      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00711      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00712      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00713      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00714      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00715      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00716      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00717      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00718      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00719      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00720      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00721      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00722      05  FILLER                VALUE +0   COMP-3 PIC S9(5).       D6502100
00723      05  FILLER                VALUE +0   COMP-3 PIC S9(3).       D6502100
00724 /                                                                 D6502100
00725 ******************************************************************D6502100
00726 *    COMMUTATION-TABLES                                          *D6502100
00727 ******************************************************************D6502100
00728                                                                   D6502100
00729  01  80-CSO-MALE-K-5.                                             D6502100
00730      05  80CSOMK5                                         COMP-3  D6502100
00731              OCCURS 101 TIMES                                     D6502100
00732              INDEXED BY 80CSOMK5-NDX.                             D6502100
00733          10  M-N                                PIC S9(12)V9(1).  D6502100
00734          10  M-D                                PIC S9(10)V9(1).  D6502100
00735                                                                   D6502100
00736  01  80-CSO-FEMALE-K-5.                                           D6502100
00737      05  80CSOFK5                                         COMP-3  D6502100
00738              OCCURS 101 TIMES                                     D6502100
00739              INDEXED BY 80CSOFK5-NDX.                             D6502100
00740          10  F-N                                PIC S9(12)V9(1).  D6502100
00741          10  F-D                                PIC S9(10)V9(1).  D6502100
00742 /                                                                 D6502100
00743 ******************************************************************D6502100
00744 *    SWITCHES AND FLAGS                                          *D6502100
00745 ******************************************************************D6502100
00746                                                                   D6502100
00747  01  FLAGS.                                                       D6502100
00748      05  PLUS-ADI-WPD-FLAG                      PIC X(01).        D6502100
00749          88  PLUS-ADI-WPD      VALUE 'Y'.                         D6502100
00750                                                                   D6502100
00751 ******************************************************************D6502100
00752 *    COUNTERS AND ACCUMULATORS                                   *D6502100
00753 ******************************************************************D6502100
00754                                                                   D6502100
00755  01  7-PAY-PREMIUM-PARTIALS                               COMP-3. D6502100
00756      05  A-BASE                                 PIC S9(9)V9(4).   D6502100
00757      05  B-CBR                                  PIC S9(9)V9(4).   D6502100
00758      05  C-GIO                                  PIC S9(9)V9(4).   D6502100
00759      05  D-DEB                                  PIC S9(9)V9(4).   D6502100
00760      05  E-ACCEL                                PIC S9(9)V9(4).   D6502100
00761      05  F-ACCEL-WPD                            PIC S9(9)V9(4).   D6502100
00762      05  G-PLUS-ADI                             PIC S9(9)V9(4).   D6502100
00763      05  H-LVL-TRM                              PIC S9(9)V9(4).   D6502100
00764      05  1035-CV-FACTOR                         PIC S9(9)V9(4).   D6502100
00765                                                                   D6502100
00766  01  7-PAY-PREMIUM-PARTIALS-LST-SRV                       COMP-3. D6502100
00767      05  ALS-BASE                               PIC S9(9)V9(2).   D6502100
00768      05  B-WPD                                  PIC S9(9)V9(4).   D6502100
00769      05  BLS-WPD                                PIC S9(9)V9(2).   D6502100
00770      05  B-WPD-2ND                              PIC S9(9)V9(4).   D6502100
00771      05  CLS-TERM                               PIC S9(9)V9(2).   D6502100
00772      05  DLS-TERM-WPD                           PIC S9(9)V9(2).   D6502100
00773      05  D-TERM-WPD-2ND                         PIC S9(9)V9(4).   D6502100
00774      05  ELS-ACCEL                              PIC S9(9)V9(2).   D6502100
00775      05  FLS-ACCEL-WPD                          PIC S9(9)V9(2).   D6502100
00776      05  F-ACCEL-WPD-2ND                        PIC S9(9)V9(4).   D6502100
00777                                                                   D6502100
00778  01  7-PAY-PREMIUM-PARTIALS-LEGACY                        COMP-3. D6502100
00779      05  ALG-BASE                               PIC S9(9)V9(2).   D6502100
00780      05  BLG-CBR                                PIC S9(9)V9(2).   D6502100
00781      05  CLG-GIO                                PIC S9(9)V9(2).   D6502100
00782      05  D-ACCEL                                PIC S9(9)V9(4).   D6502100
00783      05  DLG-ACCEL                              PIC S9(9)V9(2).   D6502100
00784      05  ELG-ACCEL-WPD                          PIC S9(9)V9(2).   D6502100
00785      05  FLG-TERM                               PIC S9(9)V9(2).   D6502100
00786      05  GLG-TERM-WPD                           PIC S9(9)V9(2).   D6502100
00787                                                                   D6502100
00788      05  ALG-BASE-W                             PIC S9(9)V9(8).   D6502100
00789      05  BLG-CBR-W                              PIC S9(9)V9(8).   D6502100
00790      05  CLG-GIO-W                              PIC S9(9)V9(8).   D6502100
00791      05  DLG-ACCEL-W                            PIC S9(9)V9(8).   D6502100
00792      05  ELG-ACCEL-WPD-W                        PIC S9(9)V9(8).   D6502100
00793      05  FLG-TERM-W                             PIC S9(9)V9(8).   D6502100
00794      05  GLG-TERM-WPD-W                         PIC S9(9)V9(8).   D6502100
00795                                                                   D6502100
00796  01  SUBSCRIPTS                                         COMP SYNC.D6502100
00797      05  X                                      PIC S9(3).        D6502100
00798      05  X2                                     PIC S9(3).        D6502100
00799      05  X7                                     PIC S9(3).        D6502100
00800      05  XT                                     PIC S9(3).        D6502100
00801      05  XT7                                    PIC S9(3).        D6502100
00802      05  XPD                                    PIC S9(3).        D6502100
00803      05  XCPD                                   PIC S9(3).        D6502100
00804      05  XT-LITTLE-TM1                          PIC S9(3).        D6502100
00805      05  Y                                      PIC S9(3).        D6502100
00806      05  S                                      PIC S9(3).        D6502100
00807      05  YT                                     PIC S9(3).        D6502100
00808      05  C                                      PIC S9(3).        D6502100
00809      05  PD                                     PIC S9(3).        D6502100
00810      05  WPD-SUB                                PIC S9(3).        D6502100
00811      05  CBR-SUB                                PIC S9(3).        D6502100
00812      05  GIO-SUB                                PIC S9(3).        D6502100
00813      05  DEB-SUB                                PIC S9(3).        D6502100
00814      05  ACCEL-SUB                              PIC S9(3).        D6502100
00815      05  ACCEL1-SUB                             PIC S9(3).        D6502100
00816      05  PLUS-ADI-SUB                           PIC S9(3).        D6502100
00817      05  LVL-TRM-SUB                            PIC S9(3).        D6502100
00818      05  TERM-SUB                               PIC S9(3).        D6502100
00819      05  SEX-SUB                                PIC S9(3).        D6502100
00820      05  COV-SUB                                PIC S9(3).        D6502100
00821      05  PU-SUB                                 PIC S9(3).        D6502100
00822      05  HIGH-LOW-SUB                           PIC S9(3).        D6502100
00823      05  I                                      PIC S9(3).        D6502100
00824                                                                   D6502100
00825  01  MISCELLANEOUS-ACCUMULATORS                           COMP-3. D6502100
00826      05  PLUS-ADI-SUMMATION                     PIC S9(13)V9(4).  D6502100
00827      05  HIGH-CASH-VALUE                        PIC S9(7)V9(2).   D6502100
00828      05  LOW-CASH-VALUE                         PIC S9(7)V9(2).   D6502100
00829      05  ADJUSTED-CASH-VALUE                    PIC S9(7)V9(2).   D6502100
00830      05  PARTIAL-CASH-VALUE                     PIC S9(7)V9(2).   D6502100
00831      05  DAYS-SINCE-ANN                         PIC S9(3).        D6502100
00832      05  PARTIAL-YEAR                           PIC S9(1)V9(3).   D6502100
00833      05  NEWMINFACE                             PIC S9(9)V9(4).   D6502100
00834      05  BASEFACE                               PIC S9(9)V9(4).   D6502100
00835      05  TERM-PREMIUM                           PIC S9(13)V9(4).  D6502100
00836      05  C-PREM-WORK                            PIC S9(14)V9(3).  D6502100
00837      05  B-PREM-WORK                            PIC S9(14)V9(3).  D6502100
00838      05  B-PREM-WORK-2ND                        PIC S9(14)V9(3).  D6502100
00839      05  D-PREM-WORK                            PIC S9(14)V9(3).  D6502100
00840      05  D-PREM-WORK-2ND                        PIC S9(14)V9(3).  D6502100
00841      05  F-PREM-WORK                            PIC S9(14)V9(3).  D6502100
00842      05  F-PREM-WORK-2ND                        PIC S9(14)V9(3).  D6502100
00843      05  F-INIT-WORK                            PIC S9(14)V9(4).  D6502100
00844      05  F-ULT-WORK                             PIC S9(14)V9(4).  D6502100
00845      05  HOLD-MALE                              PIC S9(5)V9(2).   D6502100
00846                                                                   D6502100
00847  01  MISCELLANEOUS-COUNTERS.                                      D6502100
00848      05  LITTLE-T                               PIC S9(3) COMP-3. D6502100
00849      05  SUMMATION-UPPER-LIMIT                  PIC S9(3) COMP-3. D6502100
00850                                                                   D6502100
00851 ******************************************************************D6502100
00852 *    MISCELLANEOUS WORK AREAS                                    *D6502100
00853 ******************************************************************D6502100
00854                                                                   D6502100
00855  01  DATE-CONVERSION-AREA.                                        D6502100
00856      05  FORMAT-JULIAN-10.                                        D6502100
00857          10  FORMAT-JULIAN.                                       D6502100
00858              15  FORMAT-JULIAN-YYY              PIC 9(03).        D6502100
00859              15  FORMAT-JUIAN-DDD               PIC 9(03).        D6502100
00860          10  FILLER                             PIC X(04).        D6502100
00861      05  FORMAT-GREG.                                             D6502100
00862          10  FORMAT-GREG-MM                     PIC 9(02).        D6502100
00863          10  FILLER                             PIC X(01).        D6502100
00864          10  FORMAT-GREG-DD                     PIC 9(02).        D6502100
00865          10  FILLER                             PIC X(01).        D6502100
00866          10  FORMAT-GREG-YYYY                   PIC 9(04).        D6502100
00867      05  YYYYMMDD.                                                D6502100
00868          10  YYYYMMDD-YEAR                      PIC  9(4).        D6502100
00869          10  YYYYMMDD-MONTH                     PIC  9(2).        D6502100
00870          10  YYYYMMDD-DAY                       PIC  9(2).        D6502100
00871      05  YYYMMDD.                                                 D6502100
00872          10  YYYMMDD-YEAR                       PIC  9(3).        D6502100
00873          10  YYYMMDD-MONTH                      PIC  9(2).        D6502100
00874          10  YYYMMDD-DAY                        PIC  9(2).        D6502100
00875      05  YYYDDD.                                                  D6502100
00876          10  YYYDDD-YEAR                        PIC S9(3) COMP-3. D6502100
00877          10  YYYDDD-DAY                         PIC S9(3) COMP-3. D6502100
00878                                                                   D6502100
00879  01  SAVED-DATE-AREAS.                                            D6502100
00880      05  7-PAY-START-DATE-YYYDDD.                                 D6502100
00881          10  7-PAY-START-DATE-YYYDDD-YEAR       PIC S9(3) COMP-3. D6502100
00882          10  7-PAY-START-DATE-YYYDDD-DAY        PIC S9(3) COMP-3. D6502100
00883                                                                   D6502100
00884  01  SAVED-COMMUTATION-VALUES                             COMP-3. D6502100
00885      05  DXT                                    PIC S9(10)V9(1).  D6502100
00886      05  N                                      PIC S9(12)V9(1).  D6502100
00887      05  NX2                                    PIC S9(12)V9(1).  D6502100
00888      05  NXT                                    PIC S9(12)V9(1).  D6502100
00889      05  NXT7                                   PIC S9(12)V9(1).  D6502100
00890      05  NXT15                                  PIC S9(12)V9(1).  D6502100
00891      05  NXCPD                                  PIC S9(12)V9(1).  D6502100
00892      05  NTWPD                                  PIC S9(12)V9(1).  D6502100
00893      05  NT523WPD                               PIC S9(12)V9(1).  D6502100
00894      05  N43                                    PIC S9(12)V9(1).  D6502100
00895      05  N65                                    PIC S9(12)V9(1).  D6502100
00896      05  NP                                     PIC S9(12)V9(1).  D6502100
00897      05  NY65                                   PIC S9(12)V9(1).  D6502100
00898      05  N5LO                                   PIC S9(12)V9(1).  D6502100
00899      05  N5HI                                   PIC S9(12)V9(1).  D6502100
00900      05  NXT20                                  PIC S9(12)V9(1).  D6502100
00901      05  NXTPD                                  PIC S9(12)V9(1).  D6502100
00902      05  NXT5                                   PIC S9(12)V9(1).  D6502100
00903      05  7PAYUNIT-XT                            PIC S9(3)V9(2).   D6502100
00904      05  7YRANNUITY-XT                          PIC S9(1)V9(2).   D6502100
00905      05  7PAYUNIT-XT-W                          PIC S9(3)V9(10).  D6502100
00906      05  7YRANNUITY-XT-W                        PIC S9(1)V9(10).  D6502100
00907                                                                   D6502100
00908  01  PREMIUMS                                             COMP-3. D6502100
00909      05  WPD-BASE-PREMIUM                       PIC S9(3)V9(5).   D6502100
00910      05  WPD-CBR-PREMIUM                        PIC S9(3)V9(5).   D6502100
00911      05  PLUS-ADI-PREMIUM                       PIC S9(3)V9(5).   D6502100
00912      05  PLUS-ADI-WPD-PREMIUM                   PIC S9(3)V9(5).   D6502100
00913      05  LVL-TRM-PREMIUM                        PIC S9(5)V9(5).   D6502100
00914      05  WPD-LVL-TRM-PREMIUM                    PIC S9(3)V9(5).   D6502100
00915                                                                   D6502100
00916  01  COMMON-VALUES.                                               D6502100
00917      05  INSURED-AGE                            PIC S9(3) COMP-3. D6502100
00918      05  INSURED-ATTAINED-AGE                   PIC S9(3) COMP-3. D6502100
00919      05  75-ADI-ATTAINED-AGE                    PIC S9(3) COMP-3. D6502100
00920      05  DURATION                               PIC S9(3) COMP-3. D6502100
00921      05  T                                      PIC S9(4) COMP    D6502100
00922                                                           SYNC.   D6502100
00923      05  PP-PERIOD                              PIC S9(3) COMP-3. D6502100
00924      05  PP-PERIOD-REDEF REDEFINES PP-PERIOD.                     D6502100
00925          10  PP-FIRST-BYTE                      PIC X.            D6502100
00926          10  PP-SECOND-BYTE                     PIC S9    COMP-3. D6502100
00927  01  FIELD-TEST-AREAS.                                            D6502100
00928      05  HOLD-BASE.                                               D6502100
00929          10  FIRST-BYTE-BASE                    PIC X(01).        D6502100
00930          10  PREM-PAY-PERIOD                    PIC X(01).        D6502100
00931          10  FILLER                             PIC X(01).        D6502100
00932      05  TEST-RATE-BOOK.                                          D6502100
00933          10  FIRST-BYTE-RATE-BOOK               PIC X(01).        D6502100
00934              88  NON-TOBACCO    VALUE 'N' 'P'.                    D6502100
00935          10  FILLER                             PIC X(01).        D6502100
00936      05  LEAP-YEAR-CHECK.                                         D6502100
00937          10  LEAP-YEAR-CHECK-QUOTIENT           PIC S9(3) COMP-3. D6502100
00938          10  LEAP-YEAR-CHECK-REMAINDER          PIC S9(3) COMP-3. D6502100
00939              88  LEAP-YEAR      VALUE +0.                         D6502100
00940  01  HOLD-TYPE.                                                   D6502100
00941      05  HOLD-SEX                               PIC X.            D6502100
00942      05  HOLD-AGE                               PIC 99.           D6502100
00943 /                                                                 D6502100
00944  LINKAGE SECTION.                                                 D6502100
00945                                                                   D6502100
00946 ******************************************************************D6502100
00947 *                                                                *D6502100
00948 *    I N P U T   P A R A M E T E R   A R E A S                   *D6502100
00949 *                                                                *D6502100
00950 ******************************************************************D6502100
00951                                                                   D6502100
00952  COPY Z650L7PA.                                                   D6502100
00953                                                                   D6502100
00954  01  ALIS-MASTER-RECORD.                                             CL**2
00955  COPY Z10FMASTC.                                                     CL**2
00956 /                                                                 D6502100
00957  PROCEDURE DIVISION USING 7-PAY-ACTION-INDICATOR                  D6502100
00958                           LNK-7-PAY-START-DATE                    D6502100
00959                           CALCULATION-TYPE                        D6502100
00960                           1035-MONEY                              D6502100
00961                           LNK-7-PAY-PREMIUM                       D6502100
00962                           ALIS-MASTER-RECORD.                     D6502100
00963                                                                   D6502100
00964 ******************************************************************D6502100
00965 *                                                                *D6502100
00966 *    M A I N L I N E   L O G I C                                 *D6502100
00967 *                                                                *D6502100
00968 ******************************************************************D6502100
00969                                                                   D6502100
00970  000000-MAINLINE.                                                 D6502100
00971      MOVE MCVBASE (1) TO HOLD-BASE.                               D6502100
00972      IF INITIAL-FLAG                                                 CL**3
00973          PERFORM 100000-INITIALIZATION                            D6502100
00974      ELSE                                                         D6502100
00975          IF MCVCLASS (1) = '1' AND                                D6502100
00976              (FIRST-BYTE-BASE = HEX-20 OR HEX-21)                 D6502100
00977              PERFORM 400000-CALCULATE-7-PAY-PREMIUM               D6502100
00978          ELSE                                                     D6502100
00979          IF MCVCLASS (1) = '1' AND                                D6502100
00980              (FIRST-BYTE-BASE = HEX-25)                           D6502100
00981              PERFORM 800000-CALCULATE-7-PAY-PREMIUM               D6502100
00982          ELSE                                                     D6502100
00983          IF MCVCLASS (1) = '1' AND                                D6502100
00984              (FIRST-BYTE-BASE = HEX-28 OR HEX-42)                 D6502100
00985              PERFORM A00000-CALCULATE-7-PAY-PREMIUM               D6502100
00986          ELSE                                                     D6502100
00987              PERFORM 200000-CALCULATE-7-PAY-PREMIUM.              D6502100
00988                                                                   D6502100
00989      GOBACK.                                                      D6502100
00990 /                                                                 D6502100
00991 ******************************************************************D6502100
00992 *                                                                *D6502100
00993 *    I N I T I A L I Z A T I O N                                 *D6502100
00994 *                                                                *D6502100
00995 ******************************************************************D6502100
00996                                                                   D6502100
00997  100000-INITIALIZATION.                                           D6502100
00998      IF MCVCLASS (1) = '1' AND                                    D6502100
00999          (FIRST-BYTE-BASE = HEX-20 OR HEX-21)                     D6502100
01000          NEXT SENTENCE                                            D6502100
01001      ELSE                                                         D6502100
01002          PERFORM 110000-LOAD-COMMUTATION-TABLES.                  D6502100
01003                                                                   D6502100
01004 ******************************************************************D6502100
01005 * LOAD THE COMMUTATION TABLES FROM VALUES PROVIDED BY R2200000   *D6502100
01006 *    WITH THE VALUES TO BE USED BY THIS PROGRAM.  R2200000 IS    *D6502100
01007 *    CALLED ONCE FOR EACH VALUE.                                 *D6502100
01008 ******************************************************************D6502100
01009  110000-LOAD-COMMUTATION-TABLES.                                  D6502100
01010       MOVE +0 TO SELECT-PERIOD                                    D6502100
01011                  R22-DURATION                                     D6502100
AL8775                 R22-AGE                                          D6502100
01012                  LX                                               D6502100
01013                  SMALL-DX                                         D6502100
01014                  THOUSAND-QX                                      D6502100
01015                  CX                                               D6502100
01016                  R22-DX                                           D6502100
01017                  R22-NX                                           D6502100
01018                  R22-MX.                                          D6502100
01019       MOVE +13 TO JOBMARK.                                        D6502100
01020       MOVE 'C10C' TO TABLECODE.                                   D6502100
01021       SET 80CSOMK5-NDX TO +1.                                     D6502100
01022       PERFORM 111000-LOAD-80CSOMK5                                D6502100
AL8775*         VARYING R22-AGE FROM 0 BY 1                             D6502100
AL8775          VARYING R22-DURATION FROM 0 BY 1                        D6502100
AL8775*         UNTIL R22-AGE > 100.                                    D6502100
AL8775          UNTIL R22-DURATION > 100.                               D6502100
01025       MOVE 'C30C' TO TABLECODE.                                   D6502100
01026       SET 80CSOFK5-NDX TO +1.                                     D6502100
01027       PERFORM 112000-LOAD-80CSOFK5                                D6502100
AL8775*         VARYING R22-AGE FROM 0 BY 1                             D6502100
AL8775          VARYING R22-DURATION FROM 0 BY 1                        D6502100
AL8775*         UNTIL R22-AGE > 100.                                    D6502100
AL8775          UNTIL R22-DURATION > 100.                               D6502100
01030                                                                   D6502100
01031  111000-LOAD-80CSOMK5.                                            D6502100
01032       PERFORM 116000-CALL-R2200000.                               D6502100
01033       MOVE R22-NX TO M-N(80CSOMK5-NDX).                           D6502100
01034       MOVE R22-DX TO M-D(80CSOMK5-NDX).                           D6502100
01035       SET 80CSOMK5-NDX UP BY +1.                                  D6502100
01036                                                                   D6502100
01037  112000-LOAD-80CSOFK5.                                            D6502100
01038       PERFORM 116000-CALL-R2200000.                               D6502100
01039       MOVE R22-NX TO F-N(80CSOFK5-NDX).                           D6502100
01040       MOVE R22-DX TO F-D(80CSOFK5-NDX).                           D6502100
01041       SET 80CSOFK5-NDX UP BY +1.                                  D6502100
01042                                                                   D6502100
01043 ******************************************************************D6502100
01044 * THE PROGRAM OSCALLOS IS CALLED DYNAMICALLY TO CALL R2200000.   *D6502100
01045 *     R2200000 AND ITS CALLED PROGRAMS ARE NOT INCLUDED IN THE   *D6502100
01046 *     SAME LOAD MODULE AS THIS PROGRAM BUT MUST BE AVAILABLE     *D6502100
01047 *     THROUGH A CONCATENATED LIBRARY IN A STEPLIB OR JOBLIB.     *D6502100
01048 ******************************************************************D6502100
01049  116000-CALL-R2200000.                                            D6502100
01050                                                                   D6502100
01051       CALL 'OSCALLOS' USING R2200000                              D6502100
01052                             RESULT-AREA-COMM                      D6502100
01053                             JOBMARK                               D6502100
01054                             R22-POLICY-NUMBER                     D6502100
01055                             PLANCODE-JOB13                        D6502100
01056                             R22-AGE                               D6502100
01057                             R22-DURATION.                         D6502100
01058 /                                                                 D6502100
01059 ******************************************************************D6502100
01060 *                                                                *D6502100
01061 *    I N T E R N A L   S U B R O U T I N E S                     *D6502100
01062 *                                                                *D6502100
01063 ******************************************************************D6502100
01064                                                                   D6502100
01065 ******************************************************************D6502100
01066 * THE MAIN PROCESSING PARAGRAPH FOR CALCULATING A 7-PAY PREMIUM. *D6502100
01067 *    IT INVOKES SELECTION OF THE APPROPRIATE COMMUTATION         *D6502100
01068 *    TABLES; CALCULATION OF AGE AND DURATIONAL FACTORS;          *D6502100
01069 *    RETREIVAL OF COMMUTATION VALUES; CALCULATION OF EACH        *D6502100
01070 *    PARTIAL VALUE IN THE TOTAL PREMIUM; AND COMPUTATION OF THE  *D6502100
01071 *    FINAL 7-PAY PREMIUM.                                        *D6502100
01072 ******************************************************************D6502100
01073  200000-CALCULATE-7-PAY-PREMIUM.                                  D6502100
01074      MOVE '1613000000' TO R22-POLICY-NUMBER.                      D6502100
01075      PERFORM 220000-INSURED-AGES.                                 D6502100
01076      PERFORM 230000-GET-COMMUTATION-VALUES.                       D6502100
01077      MOVE +0 TO B-CBR                                             D6502100
01078                 C-GIO                                             D6502100
01079                 D-DEB                                             D6502100
01080                 E-ACCEL                                           D6502100
01081                 F-ACCEL-WPD                                       D6502100
01082                 G-PLUS-ADI                                        D6502100
01083                 H-LVL-TRM.                                        D6502100
01084      PERFORM 310000-A-BASE.                                       D6502100
01085      IF XT NOT > 65                                               D6502100
01086          PERFORM 320000-B-CBR.                                    D6502100
01087      IF XT NOT > 43                                               D6502100
01088          PERFORM 330000-C-GIO.                                    D6502100
01089      IF T < 2                                                     D6502100
01090          PERFORM 340000-D-DEB.                                    D6502100
01091      PERFORM 350000-E-ACCEL.                                      D6502100
01092      IF XT NOT > 65                                               D6502100
01093          PERFORM 360000-F-ACCEL-WPD.                              D6502100
01094      PERFORM 370000-G-PLUS-ADI.                                   D6502100
01095      PERFORM 380000-H-LVL-TRM.                                    D6502100
01096      PERFORM 240000-GET-1035-OR-CV-FACTOR.                        D6502100
01097      PERFORM 250000-TOTAL-PARTS.                                  D6502100
01098                                                                   D6502100
01099 /                                                                 D6502100
01100 ******************************************************************D6502100
01101 * CALCULATE THE INSURED AGE AND DURATION.                        *D6502100
01102 ******************************************************************D6502100
01103  220000-INSURED-AGES.                                             D6502100
01104      MOVE LNK-7-PAY-START-DATE TO YYYYMMDD.                       D6502100
01105      PERFORM 600000-CONV-YYYYMMDD-YYYDDD.                         D6502100
01106      MOVE YYYDDD TO 7-PAY-START-DATE-YYYDDD.                      D6502100
01107      COMPUTE X = MCVAISSUE-AGE(1).                                D6502100
01108      COMPUTE X7 = X + 7.                                          D6502100
01109      COMPUTE X2 = X + 2.                                          D6502100
01110      COMPUTE INSURED-AGE = X.                                     D6502100
01111                                                                   D6502100
01112      IF MATERIAL-CHANGE                                           D6502100
01113          COMPUTE DURATION = 7-PAY-START-DATE-YYYDDD-YEAR -        D6502100
01114                             MCVISSUE-YEAR (1)                     D6502100
01115          IF 7-PAY-START-DATE-YYYDDD-DAY < MCVISSUE-DAY (1)        D6502100
01116          COMPUTE DURATION = DURATION - 1.                         D6502100
01117      IF MATERIAL-CHANGE                                           D6502100
01118          MOVE DURATION TO T                                       D6502100
01119          COMPUTE INSURED-ATTAINED-AGE = INSURED-AGE + T           D6502100
01120          COMPUTE XT = INSURED-ATTAINED-AGE                        D6502100
01121          COMPUTE XT7 = XT + 7                                     D6502100
01122      ELSE                                                         D6502100
01123          MOVE +0 TO DURATION                                      D6502100
01124                     T                                             D6502100
01125          COMPUTE INSURED-ATTAINED-AGE = INSURED-AGE               D6502100
01126          COMPUTE XT = X                                           D6502100
01127          COMPUTE XT7 = X7.                                        D6502100
01128                                                                   D6502100
01129 ******************************************************************D6502100
01130 * THIS PARAGRAPH SELECTS THE APPROPRIATE COMMUTATION FUNCTIONS   *D6502100
01131 *    TO BE USED BASED ON AGE AND SEX.  ALSO THE 7-PAY PREMIUM    *D6502100
01132 *    USED IN SOME CALCULATIONS AND A SEVEN YEAR ANNUITY FACTOR   *D6502100
01133 *    ARE SELECTED BASED ON AGE AND SEX.                          *D6502100
01134 ******************************************************************D6502100
01135  230000-GET-COMMUTATION-VALUES.                                   D6502100
01136      COMPUTE XT  = XT + 1.                                        D6502100
01137      COMPUTE XT7 = XT7 + 1.                                       D6502100
01138      COMPUTE X2  = X2 + 1.                                        D6502100
01139      IF MCVMALE(1)                                                D6502100
01140          MOVE 1 TO SEX-SUB                                        D6502100
01141          COMPUTE NXT  = M-N(XT)                                   D6502100
01142          COMPUTE NXT7 = M-N(XT7)                                  D6502100
01143          COMPUTE NX2  = M-N(X2)                                   D6502100
01144          COMPUTE N43  = M-N(44)                                   D6502100
01145          COMPUTE N65  = M-N(66)                                   D6502100
01146      ELSE                                                         D6502100
01147          MOVE 2 TO SEX-SUB                                        D6502100
01148          COMPUTE NXT  = F-N(XT)                                   D6502100
01149          COMPUTE NXT7 = F-N(XT7)                                  D6502100
01150          COMPUTE NX2  = F-N(X2)                                   D6502100
01151          COMPUTE N43  = F-N(44)                                   D6502100
01152          COMPUTE N65  = F-N(66).                                  D6502100
01153      COMPUTE 7PAYUNIT-XT = 7-PAY-PREMIUM(SEX-SUB, XT).            D6502100
01154      COMPUTE 7YRANNUITY-XT = 7-YEAR-ANNUITY-FACTOR(SEX-SUB, XT).  D6502100
01155      COMPUTE XT  = XT - 1.                                        D6502100
01156      COMPUTE XT7 = XT7 - 1.                                       D6502100
01157      COMPUTE X2  = X2 - 1.                                        D6502100
01158                                                                   D6502100
01159 ******************************************************************D6502100
01160 * DETERMINE THE ADJUSTMENT FACTOR TO BE USED IN THE CALCULATION  *D6502100
01161 *    BASED ON 1035 MONEY OR CASH VALUE, DEPENDING ON WHETHER     *D6502100
01162 *    THE CALCULATIONS ARE DONE AT ISSUE OR AS PART OF A MATERIAL *D6502100
01163 *    CHANGE.                                                     *D6502100
01164 ******************************************************************D6502100
01165  240000-GET-1035-OR-CV-FACTOR.                                    D6502100
01166                                                                   D6502100
01167      IF ISSUE                                                     D6502100
01168          COMPUTE 1035-CV-FACTOR = 1035-MONEY /                    D6502100
01169                                   7YRANNUITY-XT                   D6502100
01170      ELSE                                                         D6502100
01171          PERFORM 241000-GET-CV                                    D6502100
01172          COMPUTE 1035-CV-FACTOR = ADJUSTED-CASH-VALUE /           D6502100
01173                                   7YRANNUITY-XT.                  D6502100
01174                                                                   D6502100
01175 ******************************************************************D6502100
01176 * DETERMINE THE CASH VALUE AS OF THE 7-PAY START DATE.  ONLY     *D6502100
01177 *    THE CASH VALUE FIELDS IN THE RECORD ARE USED, SO A          *D6502100
01178 *    7-PAY START DATE MORE THAN 3 YEARS BEFORE OR AFTER THE LAST *D6502100
01179 *    ANNIVERSARY WILL RESULT IN AN ABEND.  BOTH COVERAGE         *D6502100
01180 *    TRAILERS AND PAID UP ADDITION TRAILERS ARE CHECKED FOR      *D6502100
01181 *    CASH VALUE.                                                 *D6502100
01182 ******************************************************************D6502100
01183  241000-GET-CV.                                                   D6502100
01184      COMPUTE DAYS-SINCE-ANN = 7-PAY-START-DATE-YYYDDD-DAY -       D6502100
01185                               MCVISSUE-DAY(1).                    D6502100
01186      IF DAYS-SINCE-ANN < 0                                        D6502100
01187          COMPUTE DAYS-SINCE-ANN = DAYS-SINCE-ANN + 365.           D6502100
01188      COMPUTE PARTIAL-YEAR = DAYS-SINCE-ANN / 365.                 D6502100
01189      MOVE 0 TO ADJUSTED-CASH-VALUE.                               D6502100
01190      MOVE 0 TO COV-SUB.                                           D6502100
01191      PERFORM 241100-CHECK-COV                                     D6502100
01192          VARYING COV-SUB                                          D6502100
01193          FROM 1 BY 1                                              D6502100
01194          UNTIL COV-SUB > 5.                                       D6502100
01195      MOVE 0 TO PU-SUB.                                            D6502100
01196      PERFORM 241200-CHECK-PU-ADDITIONS                            D6502100
01197          VARYING PU-SUB                                           D6502100
01198          FROM 1 BY 1                                              D6502100
01199          UNTIL PU-SUB > 2.                                        D6502100
01200                                                                   D6502100
01201  241100-CHECK-COV.                                                D6502100
01202      MOVE 0 TO HIGH-CASH-VALUE                                    D6502100
01203                LOW-CASH-VALUE.                                    D6502100
01204      IF MCVVALUES-RATE-FILE(COV-SUB)                              D6502100
01205          COMPUTE HIGH-LOW-SUB = DURATION -                        D6502100
01206                                 MCVCVLOW-DURATION(COV-SUB) + 1    D6502100
01207 ******** IF MCVCVLOW-DURATION(COV-SUB) NOT = 0                    D6502100
01208 ********     COMPUTE HIGH-LOW-SUB = HIGH-LOW-SUB + 1.             D6502100
01209      IF MCVVALUES-RATE-FILE(COV-SUB)                              D6502100
01210          IF (HIGH-LOW-SUB < 1) OR (HIGH-LOW-SUB > 4)              D6502100
01211              PERFORM 241300-R2200000-SETUP                        D6502100
01212              MOVE DURATION TO R22-DURATION                        D6502100
01213              PERFORM 241400-CALL-CV                               D6502100
01214              COMPUTE LOW-CASH-VALUE =                             D6502100
01215                  (R22-CV * MCVNUMBER-OF-UNITS (COV-SUB))          D6502100
01216          ELSE                                                     D6502100
01217              COMPUTE LOW-CASH-VALUE =                             D6502100
01218                         (MCVCASH-VALUES(COV-SUB, HIGH-LOW-SUB) *  D6502100
01219                          MCVNUMBER-OF-UNITS(COV-SUB)).            D6502100
01220      IF MCVVALUES-RATE-FILE(COV-SUB)                              D6502100
01221          COMPUTE HIGH-LOW-SUB = HIGH-LOW-SUB + 1                  D6502100
01222          IF MCVVALUES-RATE-FILE(COV-SUB)                          D6502100
01223              IF (HIGH-LOW-SUB < 1) OR (HIGH-LOW-SUB > 4)          D6502100
01224                  PERFORM 241300-R2200000-SETUP                    D6502100
01225                  COMPUTE R22-DURATION = DURATION + 1              D6502100
01226                  PERFORM 241400-CALL-CV                           D6502100
01227                  COMPUTE HIGH-CASH-VALUE =                        D6502100
01228                      (R22-CV * MCVNUMBER-OF-UNITS (COV-SUB))      D6502100
01229              ELSE                                                 D6502100
01230                  COMPUTE HIGH-CASH-VALUE =                        D6502100
01231                         (MCVCASH-VALUES(COV-SUB, HIGH-LOW-SUB) *  D6502100
01232                          MCVNUMBER-OF-UNITS(COV-SUB)).            D6502100
01233      IF MCVVALUES-RATE-FILE(COV-SUB)                              D6502100
01234          COMPUTE PARTIAL-CASH-VALUE = LOW-CASH-VALUE +            D6502100
01235                                       ((HIGH-CASH-VALUE -         D6502100
01236                                         LOW-CASH-VALUE) *         D6502100
01237                                         PARTIAL-YEAR)             D6502100
01238          IF PARTIAL-CASH-VALUE > 0                                D6502100
01239              COMPUTE ADJUSTED-CASH-VALUE = ADJUSTED-CASH-VALUE +  D6502100
01240                                            PARTIAL-CASH-VALUE.    D6502100
01241                                                                   D6502100
01242  241200-CHECK-PU-ADDITIONS.                                       D6502100
01243      MOVE 0 TO HIGH-CASH-VALUE                                    D6502100
01244                LOW-CASH-VALUE.                                    D6502100
01245      MOVE 1 TO COV-SUB.                                           D6502100
01246      IF MPUNSP-CALCULATED(PU-SUB) AND                             D6502100
01247         MPUACTIVE(PU-SUB)                                         D6502100
01248          COMPUTE HIGH-LOW-SUB = DURATION -                        D6502100
01249                                 MPULOW-DURATION(PU-SUB) + 1       D6502100
01250 *******  IF MPULOW-DURATION(PU-SUB) NOT = 0                       D6502100
01251 *******      COMPUTE HIGH-LOW-SUB = HIGH-LOW-SUB + 1.             D6502100
01252      IF MPUNSP-CALCULATED(PU-SUB) AND                             D6502100
01253         MPUACTIVE(PU-SUB)                                         D6502100
01254          IF (HIGH-LOW-SUB < 1) OR (HIGH-LOW-SUB > 4)              D6502100
01255              PERFORM 241300-R2200000-SETUP                        D6502100
01256              MOVE DURATION TO R22-DURATION                        D6502100
01257              PERFORM 241500-CALL-NSP                              D6502100
01258          COMPUTE LOW-CASH-VALUE =                                 D6502100
01259               R22-NSP * (MPUADDITIONS-TOTAL(PU-SUB) / 1000)       D6502100
01260          ELSE                                                     D6502100
01261          COMPUTE LOW-CASH-VALUE =                                 D6502100
01262                         (MPUNSP(PU-SUB, HIGH-LOW-SUB) *           D6502100
01263                          (MPUADDITIONS-TOTAL(PU-SUB) / 1000)).    D6502100
01264      IF MPUNSP-CALCULATED(PU-SUB) AND                             D6502100
01265         MPUACTIVE(PU-SUB)                                         D6502100
01266          COMPUTE HIGH-LOW-SUB = HIGH-LOW-SUB + 1                  D6502100
01267          IF (HIGH-LOW-SUB < 1) OR (HIGH-LOW-SUB > 4)              D6502100
01268              PERFORM 241300-R2200000-SETUP                        D6502100
01269              COMPUTE R22-DURATION =R22-DURATION + 1               D6502100
01270              PERFORM 241500-CALL-NSP                              D6502100
01271              COMPUTE HIGH-CASH-VALUE =                            D6502100
01272                R22-NSP * (MPUADDITIONS-TOTAL(PU-SUB) / 1000)      D6502100
01273          ELSE                                                     D6502100
01274          COMPUTE HIGH-CASH-VALUE =                                D6502100
01275                         (MPUNSP(PU-SUB, HIGH-LOW-SUB) *           D6502100
01276                          (MPUADDITIONS-TOTAL(PU-SUB) / 1000)).    D6502100
01277      IF MPUNSP-CALCULATED(PU-SUB) AND                             D6502100
01278         MPUACTIVE(PU-SUB)                                         D6502100
01279          COMPUTE PARTIAL-CASH-VALUE = LOW-CASH-VALUE +            D6502100
01280                                       ((HIGH-CASH-VALUE -         D6502100
01281                                         LOW-CASH-VALUE) *         D6502100
01282                                         PARTIAL-YEAR)             D6502100
01283          IF PARTIAL-CASH-VALUE > 0                                D6502100
01284              COMPUTE ADJUSTED-CASH-VALUE = ADJUSTED-CASH-VALUE +  D6502100
01285                                            PARTIAL-CASH-VALUE.    D6502100
01286                                                                   D6502100
01287  241300-R2200000-SETUP.                                           D6502100
01288      MOVE MRCPOLICY-NUMBER TO R22-POLICY-NUMBER.                  D6502100
01289      MOVE +0 TO R22-NUMBER-OF-UNITS.                              D6502100
01290      MOVE MCVCLASS (COV-SUB) TO PLANCODE-CLASS.                   D6502100
01291      MOVE MCVSERIES (COV-SUB) TO PLANCODE-SERIES.                 D6502100
01292      IF (MRCPOLICY-NUMBER NOT < '1617000000') AND                 D6502100
01293         ((MCVCLASS (1) = '1') AND                                 D6502100
01294             (FIRST-BYTE-BASE = HEX-20 OR HEX-21))                 D6502100
01295              NEXT SENTENCE                                        D6502100
01296      ELSE                                                         D6502100
01297              MOVE -1 TO R22-AGE-PARM (1)                          D6502100
01298              MOVE MCVAISSUE-AGE (1) TO R22-AGE-PARM (2)           D6502100
01299              MOVE +0 TO R22-STATUS-CODE-PARM (2)                  D6502100
01300              MOVE '01' TO R22-SPECIAL-TABLE-PARM (1)              D6502100
01301              PERFORM 241600-SETUP-TABLE                           D6502100
01302              MOVE '1' TO R22-SEX-PARM (1)                         D6502100
01303              MOVE MCVSEX (COV-SUB) TO R22-SEX-PARM (2)            D6502100
01304              MOVE -1 TO R22-STATUS-CODE-PARM (1)                  D6502100
01305              IF MCVRATE-BOOK (COV-SUB) = 'PR' OR 'P1' OR 'P2'     D6502100
01306                       OR 'P3' OR 'P4' OR 'P5' OR 'P6' OR 'P7'     D6502100
01307                       OR 'NT' OR 'N1' OR 'N2' OR 'N3' OR 'N4'     D6502100
01308                       OR 'N5' OR 'N6' OR 'N7' OR 'N8' OR 'NP'     D6502100
01309                  MOVE +64 TO R22-STATUS-CODE-PARM (2)             D6502100
01310              ELSE                                                 D6502100
01311                  MOVE +0 TO R22-STATUS-CODE-PARM (2).             D6502100
01312  241400-CALL-CV.                                                  D6502100
01313       CALL 'OSCALLOS' USING R2200000                              D6502100
01314                             R22-CV                                D6502100
01315                             JOB02                                 D6502100
01316                             R22-POLICY-NUMBER                     D6502100
01317                             PLANCODE-JOB6                         D6502100
01318                             R22-AGE-TABLE                         D6502100
01319                             R22-DURATION                          D6502100
01320                             R22-RESIDUAL-VALUE                    D6502100
01321                             R22-STATUS-CODE-TABLE                 D6502100
01322                             R22-NUMBER-OF-UNITS                   D6502100
01323                             R22-SPECIAL-TABLE                     D6502100
01324                             R22-CASH-VAL-T-1                      D6502100
01325                             R22-CASH-VAL-T                        D6502100
01326                             R22-PU-T                              D6502100
01327                             R22-JOINT                             D6502100
01328                             R22-ISSUEDATE                         D6502100
01329                             R22-SEX                               D6502100
01330                             R22-FLAT-EXTRA-CODE.                  D6502100
01331  241500-CALL-NSP.                                                 D6502100
01332       CALL 'OSCALLOS' USING R2200000                              D6502100
01333                             R22-NSP                               D6502100
01334                             JOB17                                 D6502100
01335                             R22-POLICY-NUMBER                     D6502100
01336                             PLANCODE-JOB6                         D6502100
01337                             R22-AGE-TABLE                         D6502100
01338                             R22-DURATION                          D6502100
01339                             R22-RESIDUAL-VALUE                    D6502100
01340                             R22-STATUS-CODE-TABLE                 D6502100
01341                             R22-NUMBER-OF-UNITS                   D6502100
01342                             R22-SPECIAL-TABLE                     D6502100
01343                             R22-CASH-VAL-T-1                      D6502100
01344                             R22-CASH-VAL-T                        D6502100
01345                             R22-PU-T                              D6502100
01346                             R22-JOINT                             D6502100
01347                             R22-ISSUEDATE                         D6502100
01348                             R22-SEX                               D6502100
01349                             R22-FLAT-EXTRA-CODE.                  D6502100
01350  241600-SETUP-TABLE.                                              D6502100
01351      PERFORM 799999-DUMMY VARYING I FROM 1 BY 1                   D6502100
01352         UNTIL I > 7 OR MELTRIDENT (I) = '  ' OR                   D6502100
01353         ((MELTABLE (I) NOT = '  ') AND MELPHASE (I) =             D6502100
01354         MCVPHASE (COV-SUB)).                                      D6502100
01355      IF  I > 7                                                    D6502100
01356          MOVE SPACES TO R22-SPECIAL-TABLE-PARM (2)                D6502100
01357      ELSE                                                         D6502100
01358          MOVE MELTABLE (I) TO R22-SPECIAL-TABLE-PARM (2).         D6502100
01359  250000-TOTAL-PARTS.                                              D6502100
01360      COMPUTE LNK-7-PAY-PREMIUM ROUNDED = A-BASE +                 D6502100
01361                                          B-CBR +                  D6502100
01362                                          C-GIO +                  D6502100
01363                                          D-DEB +                  D6502100
01364                                          E-ACCEL +                D6502100
01365                                          F-ACCEL-WPD +            D6502100
01366                                          G-PLUS-ADI +             D6502100
01367                                          H-LVL-TRM -              D6502100
01368                                          1035-CV-FACTOR.          D6502100
01369 /                                                                 D6502100
01370 ******************************************************************D6502100
01371 * COMPUTE THE BASE COVERAGE (ADVANTAGE) PORTION OF THE 7-PAY     *D6502100
01372 *    PREMIUM INCLUDING WPD ON THE BASE COVERAGE.                 *D6502100
01373 ******************************************************************D6502100
01374  310000-A-BASE.                                                   D6502100
01375      MOVE 0 TO WPD-SUB.                                           D6502100
01376      PERFORM 799999-DUMMY                                         D6502100
01377          VARYING WPD-SUB                                          D6502100
01378          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10)  OR                                   Q17189
01379**Q17189  UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND             D6502100
01379                ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND               Q17189
01380                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
01381**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
01381                 MSBACTIVE(WPD-SUB)).                                Q17189
01382**Q17189        (WPD-SUB > 10).                                    D6502100
01383      IF WPD-SUB NOT > 10                                          D6502100
01384           COMPUTE WPD-BASE-PREMIUM = (MSBANN-PREM-UNIT(WPD-SUB) * D6502100
01385                                      1000) /                      D6502100
01386                                      MCVVALUE-PER-UNIT(1)         D6502100
01387      ELSE                                                         D6502100
01388          MOVE +0 TO WPD-BASE-PREMIUM.                             D6502100
01389      COMPUTE BASEFACE = ((MCVNUMBER-OF-UNITS(1) *                 D6502100
01390                          MCVVALUE-PER-UNIT(1)) / 1000).           D6502100
01391      MOVE BASEFACE TO NEWMINFACE.                                 D6502100
01392      MOVE 0 TO PU-SUB.                                            D6502100
01393      IF MATERIAL-CHANGE                                           D6502100
01394          PERFORM 311000-PU-ADDITIONS                              D6502100
01395              VARYING PU-SUB                                       D6502100
01396              FROM 1 BY 1                                          D6502100
01397              UNTIL PU-SUB > 2.                                    D6502100
01398      COMPUTE A-BASE = (NEWMINFACE *                               D6502100
01399                        7PAYUNIT-XT) +                             D6502100
01400                       (BASEFACE *                                 D6502100
01401                       ((WPD-BASE-PREMIUM * (NXT - N65)) /         D6502100
01402                        (NXT - NXT7))).                            D6502100
01403                                                                   D6502100
01404  311000-PU-ADDITIONS.                                             D6502100
01405      IF MPUACTIVE(PU-SUB) AND                                     D6502100
01406         (MPUFUNCTIONS(PU-SUB) NOT = '8') AND                      D6502100
01407         (MPUFUNCTIONS(PU-SUB) NOT = '9')                          D6502100
01408          COMPUTE NEWMINFACE = NEWMINFACE +                        D6502100
01409                               (MPUADDITIONS-TOTAL(PU-SUB) / 1000).D6502100
01410                                                                   D6502100
01411 ******************************************************************D6502100
01412 * COMPUTE THE CBR PORTION OF THE 7-PAY PREMIUM INCLUDING WPD.    *D6502100
01413 ******************************************************************D6502100
01414  320000-B-CBR.                                                    D6502100
01415      MOVE 0 TO CBR-SUB.                                           D6502100
01416      PERFORM 799999-DUMMY                                         D6502100
01417          VARYING CBR-SUB                                          D6502100
01418          FROM 1 BY 1                                              D6502100
               UNTIL (CBR-SUB > 5) OR                                     Q17189
01419**Q17189  UNTIL (MCVCLFAMILY-PLAN(CBR-SUB)  AND                    D6502100
01419                (MCVCLFAMILY-PLAN(CBR-SUB)  AND                      Q17189
01420**Q17189        (MCVMATEX-USE(CBR-SUB) = '0')) OR                  D6502100
01420                (MCVMATEX-USE(CBR-SUB) = '0')) .                     Q17189
01421**Q17189        (CBR-SUB > 5).                                     D6502100
01422      IF CBR-SUB NOT > 5                                           D6502100
01423          MOVE 0 TO WPD-SUB                                        D6502100
01424          PERFORM 799999-DUMMY                                     D6502100
01425              VARYING WPD-SUB                                      D6502100
01426              FROM 1 BY 1                                          D6502100
                  UNTIL (WPD-SUB > 10) OR                                 Q17189
01427**Q17189     UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(CBR-SUB)) AND    D6502100
01427                    ((MSBPHASE(WPD-SUB) = MCVPHASE(CBR-SUB)) AND     Q17189
01428                     MSBPREM-WAIVER(WPD-SUB) AND                   D6502100
01429**Q17189             MSBACTIVE(WPD-SUB)) OR                        D6502100
01429                     MSBACTIVE(WPD-SUB)).                            Q17189
01430**Q17189            (WPD-SUB > 10).                                D6502100
01431      IF CBR-SUB NOT > 5                                           D6502100
01432          IF WPD-SUB NOT > 10                                      D6502100
01433            COMPUTE WPD-CBR-PREMIUM = MSBANN-PREM-UNIT(WPD-SUB)    D6502100
01434          ELSE                                                     D6502100
01435              MOVE +0 TO WPD-CBR-PREMIUM.                          D6502100
01436      IF CBR-SUB NOT > 5                                           D6502100
01437          COMPUTE B-CBR = MCVNUMBER-OF-UNITS(CBR-SUB) *            D6502100
01438                          (MCVANN-PREM-PER-UNIT(CBR-SUB) +         D6502100
01439                            WPD-CBR-PREMIUM) *                     D6502100
01440                           ((NXT - N65) /                          D6502100
01441                           (NXT - NXT7)).                          D6502100
01442                                                                   D6502100
01443 ******************************************************************D6502100
01444 * COMPUTE THE GIO PORTION OF THE 7-PAY PREMIUM.                  *D6502100
01445 ******************************************************************D6502100
01446  330000-C-GIO.                                                    D6502100
01447      MOVE 0 TO GIO-SUB.                                           D6502100
01448      PERFORM 799999-DUMMY                                         D6502100
01449          VARYING GIO-SUB                                          D6502100
01450          FROM 1 BY 1                                              D6502100
               UNTIL (GIO-SUB > 10)  OR                                   Q17189
01451**Q17189  UNTIL ((MSBPHASE-TYPE(GIO-SUB) = '0B0') AND              D6502100
01451                ((MSBPHASE-TYPE(GIO-SUB) = '0B0') AND                Q17189
01452**Q17189         MSBACTIVE(GIO-SUB)) OR                            D6502100
01452                 MSBACTIVE(GIO-SUB)).                                Q17189
01453**Q17189        (GIO-SUB > 10).                                    D6502100
           IF GIO-SUB NOT > 10                                          D6502100
01455              COMPUTE C-GIO = ((MSBNUMBER-UNITS(GIO-SUB) *         D6502100
01456                              MCVVALUE-PER-UNIT(1)) /              D6502100
01457                              1000) *                              D6502100
01458                              ((MSBANN-PREM-UNIT(GIO-SUB) *        D6502100
01459                               1000) /                             D6502100
01460                               MCVVALUE-PER-UNIT(1)) *             D6502100
01461                              ((NXT - N43) /                       D6502100
01462                               (NXT - NXT7)).                      D6502100
01463                                                                   D6502100
01464 ******************************************************************D6502100
01465 * COMPUTE THE DEB PORTION OF THE 7-PAY PREMIUM.                  *D6502100
01466 ******************************************************************D6502100
01467  340000-D-DEB.                                                    D6502100
01468      MOVE 0 TO DEB-SUB.                                           D6502100
01469      PERFORM 799999-DUMMY                                         D6502100
01470          VARYING DEB-SUB                                          D6502100
01471          FROM 1 BY 1                                              D6502100
               UNTIL (DEB-SUB > 5) OR                                     Q17189
01472**Q17189  UNTIL (MCVCLOTHER-TERM(DEB-SUB)  AND                     D6502100
01472                (MCVCLOTHER-TERM(DEB-SUB)  AND                       Q17189
01473**Q17189        (MCVMATEX-USE(DEB-SUB) = '0')) OR                  D6502100
01473                (MCVMATEX-USE(DEB-SUB) = '0')) .                     Q17189
01474**Q17189        (DEB-SUB > 5).                                     D6502100
01475      IF DEB-SUB NOT > 5                                           D6502100
01476              COMPUTE D-DEB = ((MCVNUMBER-OF-UNITS(DEB-SUB) *      D6502100
01477                              MCVVALUE-PER-UNIT(1)) /              D6502100
01478                              1000) *                              D6502100
01479                              ((MCVANN-PREM-PER-UNIT(DEB-SUB) *    D6502100
01480                               1000) /                             D6502100
01481                               MCVVALUE-PER-UNIT(1)) *             D6502100
01482                              ((NXT - NX2) /                       D6502100
01483                               (NXT - NXT7)).                      D6502100
01484                                                                   D6502100
01485 ******************************************************************D6502100
01486 * COMPUTE THE ACCELERATOR AND ACCELERATOR ONE PORTION OF THE     *D6502100
01487 *    7-PAY PREMIUM.  THIS DOES NOT INCLUDE WPD.                  *D6502100
01488 ******************************************************************D6502100
01489  350000-E-ACCEL.                                                  D6502100
01490      MOVE 0 TO ACCEL-SUB.                                         D6502100
01491      PERFORM 799999-DUMMY                                         D6502100
01492          VARYING ACCEL-SUB                                        D6502100
01493          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL-SUB > 5) OR                                   Q17189
01494**Q17189  UNTIL (MCVCLLIFE(ACCEL-SUB) AND                          D6502100
01494                (MCVCLLIFE(ACCEL-SUB) AND                            Q17189
01495                (MCVBASE(ACCEL-SUB) = HEX-160000) AND              D6502100
01496**Q17189        (MCVMATEX-USE(ACCEL-SUB) = '0')) OR                D6502100
01496                (MCVMATEX-USE(ACCEL-SUB) = '0')).                    Q17189
01497**Q17189        (ACCEL-SUB > 5).                                   D6502100
01498      IF ACCEL-SUB NOT > 5                                         D6502100
01499          COMPUTE E-ACCEL = (MCVNUMBER-OF-UNITS(ACCEL-SUB) *       D6502100
01500                            MCVVALUE-PER-UNIT(ACCEL-SUB)) / 1000.  D6502100
01501      MOVE 0 TO ACCEL1-SUB.                                        D6502100
01502      PERFORM 799999-DUMMY                                         D6502100
01503          VARYING ACCEL1-SUB                                       D6502100
01504          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL1-SUB > 2) OR                                  Q17189
01505**Q17189  UNTIL (((MPUFUNCTIONS(ACCEL1-SUB) = '8') OR              D6502100
01505                (((MPUFUNCTIONS(ACCEL1-SUB) = '8') OR                Q17189
01506                 (MPUFUNCTIONS(ACCEL1-SUB) = '9')) AND             D6502100
01507**Q17189         MPUACTIVE(ACCEL1-SUB)) OR                         D6502100
01507                 MPUACTIVE(ACCEL1-SUB)) .                            Q17189
01508**Q17189        (ACCEL1-SUB > 2).                                  D6502100
01509      IF ACCEL1-SUB NOT > 2                                        D6502100
01510          COMPUTE E-ACCEL = E-ACCEL +                              D6502100
01511                            (MPUADDITIONS-TOTAL(ACCEL1-SUB) /      D6502100
01512                             1000).                                D6502100
01513      COMPUTE E-ACCEL = E-ACCEL *                                  D6502100
01514                        7PAYUNIT-XT.                               D6502100
01515                                                                   D6502100
01516 ******************************************************************D6502100
01517 * COMPUTE THE WPD ON ACCELERATOR ONE PORTION OF THE 7-PAY        *D6502100
01518 *    PREMIUM.                                                    *D6502100
01519 ******************************************************************D6502100
01520  360000-F-ACCEL-WPD.                                              D6502100
01521      MOVE 0 TO ACCEL-SUB.                                         D6502100
01522      PERFORM 799999-DUMMY                                         D6502100
01523          VARYING ACCEL-SUB                                        D6502100
01524          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL-SUB > 5) OR                                   Q17189
01525**Q17189  UNTIL (MCVCLLIFE(ACCEL-SUB) AND                          D6502100
01525                (MCVCLLIFE(ACCEL-SUB) AND                            Q17189
01526                (MCVBASE(ACCEL-SUB) = HEX-160000) AND              D6502100
01527**Q17189        (MCVMATEX-USE(ACCEL-SUB) = '0')) OR                D6502100
01527                (MCVMATEX-USE(ACCEL-SUB) = '0')) .                   Q17189
01528**Q17189        (ACCEL-SUB > 5).                                   D6502100
01529      IF ACCEL-SUB NOT > 5                                         D6502100
01530          MOVE 0 TO WPD-SUB                                        D6502100
01531          PERFORM 799999-DUMMY                                     D6502100
01532              VARYING WPD-SUB                                      D6502100
01533              FROM 1 BY 1                                          D6502100
                   UNTIL (WPD-SUB > 10) OR                                Q17189
01534**Q17189      UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND D6502100
01534                    ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND   Q17189
01535                     MSBPREM-WAIVER(WPD-SUB) AND                   D6502100
01536**Q17189             MSBACTIVE(WPD-SUB)) OR                        D6502100
01536                     MSBACTIVE(WPD-SUB)) .                           Q17189
01537**Q17189            (WPD-SUB > 10).                                D6502100
01538      IF (ACCEL-SUB NOT > 5) AND                                   D6502100
01539         (WPD-SUB NOT > 10)                                        D6502100
01540          COMPUTE F-ACCEL-WPD = ((MCVANN-PREM-PER-UNIT(ACCEL-SUB) *D6502100
01541                                  MCVNUMBER-OF-UNITS(ACCEL-SUB)) / D6502100
01542                                  100) *                           D6502100
01543                                MSBANN-PREM-UNIT(WPD-SUB) *        D6502100
01544                               ((NXT - N65) /                      D6502100
01545                               (NXT - NXT7)).                      D6502100
01546                                                                   D6502100
01547 ******************************************************************D6502100
01548 * COMPUTE THE PLUS OR ADI PORTION OF THE 7-PAY PREMIUM INCLUDING *D6502100
01549 *    WPD.  ALL ADI ARE ASSUMED TO BE FAMILY MEMBERS.             *D6502100
01550 ******************************************************************D6502100
01551  370000-G-PLUS-ADI.                                               D6502100
01552      MOVE 0 TO PLUS-ADI-SUB.                                      D6502100
01553      PERFORM 371000-CHECK-PLUS-ADI                                D6502100
01554          VARYING PLUS-ADI-SUB                                     D6502100
01555          FROM 1 BY 1                                              D6502100
01556          UNTIL PLUS-ADI-SUB > 5.                                  D6502100
01557                                                                   D6502100
01558  371000-CHECK-PLUS-ADI.                                           D6502100
01559      IF MCVCLRENEW-TERM(PLUS-ADI-SUB) AND                         D6502100
01560         (MCVMATEX-USE(PLUS-ADI-SUB) = '0')                        D6502100
01561          MOVE +0 TO PLUS-ADI-SUMMATION                            D6502100
01562          MOVE SPACES TO PLUS-ADI-WPD-FLAG                         D6502100
01563          PERFORM 372000-PROCESS-PLUS-ADI.                         D6502100
01564                                                                   D6502100
01565  372000-PROCESS-PLUS-ADI.                                         D6502100
01566      MOVE 0 TO WPD-SUB.                                           D6502100
01567      PERFORM 799999-DUMMY                                         D6502100
01568          VARYING WPD-SUB                                          D6502100
01569          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10) OR                                    Q17189
01570**Q17189  UNTIL (MSBPHASE(WPD-SUB) = MCVPHASE(PLUS-ADI-SUB) AND    D6502100
01570                (MSBPHASE(WPD-SUB) = MCVPHASE(PLUS-ADI-SUB) AND      Q17189
01571                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
01572**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
01572                 MSBACTIVE(WPD-SUB)) .                               Q17189
01573**Q17189        (WPD-SUB > 10).                                    D6502100
01574      IF WPD-SUB NOT > 10                                          D6502100
01575          MOVE 'Y' TO PLUS-ADI-WPD-FLAG                            D6502100
01576      ELSE                                                         D6502100
01577          MOVE 0 TO PLUS-ADI-WPD-PREMIUM.                          D6502100
01578      MOVE MCVBASE(PLUS-ADI-SUB) TO HOLD-BASE.                     D6502100
01579      COMPUTE C = MCVISSUE-YEAR (PLUS-ADI-SUB) -                   D6502100
01580                         MCVISSUE-YEAR (1).                        D6502100
01581      IF MCVISSUE-DAY (PLUS-ADI-SUB) < MCVISSUE-DAY (1)            D6502100
01582          COMPUTE C = C - 1.                                       D6502100
01583      IF FIRST-BYTE-BASE = HEX-33                                  D6502100
01584          COMPUTE SUMMATION-UPPER-LIMIT = 75 - XT                  D6502100
01585      ELSE                                                         D6502100
01586          COMPUTE 75-ADI-ATTAINED-AGE = 75 - T + C -               D6502100
01587                                        MCVAISSUE-AGE(PLUS-ADI-SUB)D6502100
01588          COMPUTE SUMMATION-UPPER-LIMIT = 100 - XT                 D6502100
01589          IF SUMMATION-UPPER-LIMIT > 75-ADI-ATTAINED-AGE           D6502100
01590              COMPUTE SUMMATION-UPPER-LIMIT = 75-ADI-ATTAINED-AGE. D6502100
01591      MOVE MCVRATE-BOOK(PLUS-ADI-SUB) TO TEST-RATE-BOOK.           D6502100
01592      IF NON-TOBACCO                                               D6502100
01593          MOVE +64 TO R22-STATUS-CODE                              D6502100
01594      ELSE                                                         D6502100
01595          MOVE +0 TO R22-STATUS-CODE.                              D6502100
01596      MOVE 1 TO LITTLE-T.                                          D6502100
01597      PERFORM 373000-PLUS-ADI-SUMMATION                            D6502100
01598          UNTIL LITTLE-T > SUMMATION-UPPER-LIMIT.                  D6502100
01599      COMPUTE G-PLUS-ADI = G-PLUS-ADI +                            D6502100
01600                           (PLUS-ADI-SUMMATION /                   D6502100
01601                           (NXT - NXT7)).                          D6502100
01602                                                                   D6502100
01603  373000-PLUS-ADI-SUMMATION.                                       D6502100
01604      COMPUTE XT-LITTLE-TM1 = XT + LITTLE-T.                       D6502100
01605      PERFORM 373100-GET-PLUS-ADI-PREM.                            D6502100
01606      IF MCVMALE(1)                                                D6502100
01607          COMPUTE PLUS-ADI-SUMMATION = PLUS-ADI-SUMMATION +        D6502100
01608                              (((MCVNUMBER-OF-UNITS(PLUS-ADI-SUB) *D6502100
01609                               MCVVALUE-PER-UNIT(PLUS-ADI-SUB)) /  D6502100
01610                               1000) *                             D6502100
01611                              (PLUS-ADI-PREMIUM +                  D6502100
01612                               PLUS-ADI-WPD-PREMIUM) *             D6502100
01613                              M-D(XT-LITTLE-TM1))                  D6502100
01614      ELSE                                                         D6502100
01615          COMPUTE PLUS-ADI-SUMMATION = PLUS-ADI-SUMMATION +        D6502100
01616                              (((MCVNUMBER-OF-UNITS(PLUS-ADI-SUB) *D6502100
01617                               MCVVALUE-PER-UNIT(PLUS-ADI-SUB)) /  D6502100
01618                               1000) *                             D6502100
01619                              (PLUS-ADI-PREMIUM +                  D6502100
01620                               PLUS-ADI-WPD-PREMIUM) *             D6502100
01621                              F-D(XT-LITTLE-TM1)).                 D6502100
01622      COMPUTE LITTLE-T = LITTLE-T + 1.                             D6502100
01623                                                                   D6502100
01624  373100-GET-PLUS-ADI-PREM.                                        D6502100
01625      MOVE +6 TO JOBMARK.                                          D6502100
01626      MOVE MRCPOLICY-NUMBER TO R22-POLICY-NUMBER.                  D6502100
01627      MOVE MCVCLASS(PLUS-ADI-SUB) TO PLANCODE-CLASS.               D6502100
01628      MOVE MCVSERIES(PLUS-ADI-SUB) TO PLANCODE-SERIES.             D6502100
01629      MOVE MCVAISSUE-AGE(PLUS-ADI-SUB) TO R22-AGE.                 D6502100
01630      MOVE MCVNUMBER-OF-UNITS(PLUS-ADI-SUB) TO R22-NUMBER-OF-UNITS.D6502100
01631      COMPUTE R22-DURATION = T + LITTLE-T - 1 - C.                 D6502100
01632      PERFORM 373120-CALL-R2200000.                                D6502100
01633      IF MCVMALE(PLUS-ADI-SUB)                                     D6502100
01634          MOVE MALE-PREMIUM TO PLUS-ADI-PREMIUM                    D6502100
01635      ELSE                                                         D6502100
01636          MOVE FEMALE-PREMIUM TO PLUS-ADI-PREMIUM.                 D6502100
01637      IF PLUS-ADI-WPD                                              D6502100
01638          IF MCVBASE(PLUS-ADI-SUB) = HEX-33                        D6502100
01639              IF WPD-PREMIUM NOT NUMERIC                           D6502100
01640                  MOVE 0 TO PLUS-ADI-WPD-PREMIUM                   D6502100
01641              ELSE                                                 D6502100
01642                  MOVE WPD-PREMIUM TO PLUS-ADI-WPD-PREMIUM         D6502100
01643          ELSE                                                     D6502100
01644              MOVE MCVAISSUE-AGE(1) TO R22-AGE                     D6502100
01645              PERFORM 373120-CALL-R2200000                         D6502100
01646              IF WPD-PREMIUM NOT NUMERIC                           D6502100
01647                  MOVE 0 TO PLUS-ADI-WPD-PREMIUM                   D6502100
01648              ELSE                                                 D6502100
01649                  MOVE WPD-PREMIUM TO PLUS-ADI-WPD-PREMIUM.        D6502100
01650                                                                   D6502100
01651 ******************************************************************D6502100
01652 * CALL R220000 TO OBTAIN THE PREMIUMS FOR EACH DURATION USED     *D6502100
01653 *    IN THE SUMMATION FOR THE PLUS/ADI PORTION OF THE 7-PAY      *D6502100
01654 *    PREMIUM.                                                    *D6502100
01655 ******************************************************************D6502100
01656  373120-CALL-R2200000.                                            D6502100
01657                                                                   D6502100
01658      CALL 'OSCALLOS' USING R2200000                               D6502100
01659                            RESULT-AREA-PREM                       D6502100
01660                            JOBMARK                                D6502100
01661                            R22-POLICY-NUMBER                      D6502100
01662                            PLANCODE-JOB6                          D6502100
01663                            R22-AGE                                D6502100
01664                            R22-DURATION                           D6502100
01665                            R22-RESIDUAL-VALUE                     D6502100
01666                            R22-STATUS-CODE                        D6502100
01667                            R22-NUMBER-OF-UNITS.                   D6502100
01668                                                                   D6502100
01669 ******************************************************************D6502100
01670 *  COMPUTE THE LEVEL TERM RIDER PORTION FO THE 7-PAY PREMIUM     *D6502100
01671 *  INCLUDING WPD.   ALL LEVEL TERM RIDERS ARE ASSUMED TO BE      *D6502100
01672 *  FAMILY MEMBERS.                                               *D6502100
01673 ******************************************************************D6502100
01674  380000-H-LVL-TRM.                                                D6502100
01675      MOVE 0 TO LVL-TRM-SUB.                                       D6502100
01676      PERFORM 381000-CHECK-LVL-TRM                                 D6502100
01677        VARYING LVL-TRM-SUB                                        D6502100
01678         FROM +1 BY +1                                             D6502100
01679          UNTIL LVL-TRM-SUB > +5.                                  D6502100
01680                                                                   D6502100
01681  381000-CHECK-LVL-TRM.                                            D6502100
01682      IF MCVCLLEVEL-TERM (LVL-TRM-SUB) AND                         D6502100
01683         MCVMATEX-USE (LVL-TRM-SUB) = '0'                          D6502100
01684        PERFORM 382000-PROCESS-LVL-TRM                             D6502100
01685        COMPUTE H-LVL-TRM = H-LVL-TRM + LVL-TRM-PREMIUM.           D6502100
01686                                                                   D6502100
01687  382000-PROCESS-LVL-TRM.                                          D6502100
01688      PERFORM 382100-GET-LVL-TRM-COMM-FACTOR.                      D6502100
01689      MOVE 0 TO LVL-TRM-PREMIUM                                    D6502100
01690                WPD-LVL-TRM-PREMIUM                                D6502100
01691                WPD-SUB.                                           D6502100
01692      PERFORM 799999-DUMMY                                         D6502100
01693         VARYING WPD-SUB                                           D6502100
01694           FROM +1 BY +1                                           D6502100
                 UNTIL WPD-SUB > +10  OR                                  Q17189
01695**Q17189    UNTIL ((MSBPHASE (WPD-SUB) = MCVPHASE (LVL-TRM-SUB))   D6502100
01695                  ((MSBPHASE (WPD-SUB) = MCVPHASE (LVL-TRM-SUB))     Q17189
01696                  AND MSBPREM-WAIVER (WPD-SUB)                     D6502100
01697                  AND MSBACTIVE (WPD-SUB))                         D6502100
01698**Q17189          OR WPD-SUB > +10.                                D6502100
01699      IF WPD-SUB > +10                                             D6502100
01700         MOVE 0 TO WPD-LVL-TRM-PREMIUM                             D6502100
01701      ELSE                                                         D6502100
01702         COMPUTE WPD-LVL-TRM-PREMIUM = MSBANN-PREM-UNIT (WPD-SUB). D6502100
01703      IF XCPD < +65                                                D6502100
01704       COMPUTE LVL-TRM-PREMIUM = MCVNUMBER-OF-UNITS (LVL-TRM-SUB) *D6502100
01705                             (MCVANN-PREM-PER-UNIT (LVL-TRM-SUB) + D6502100
01706                              WPD-LVL-TRM-PREMIUM) *               D6502100
01707                              ((NXT - NXCPD) / (NXT - NXT7))       D6502100
01708      ELSE                                                         D6502100
01709       COMPUTE LVL-TRM-PREMIUM = MCVNUMBER-OF-UNITS (LVL-TRM-SUB) *D6502100
01710                             ((MCVANN-PREM-PER-UNIT (LVL-TRM-SUB) *D6502100
01711                             ((NXT - NXCPD) / (NXT - NXT7))) +     D6502100
01712                             (WPD-LVL-TRM-PREMIUM *                D6502100
01713                             ((NXT - N65) / (NXT - NXT7)))).       D6502100
01714                                                                   D6502100
01715  382100-GET-LVL-TRM-COMM-FACTOR.                                  D6502100
01716      COMPUTE PD = MCVMATURE-EXPIRE-YR (LVL-TRM-SUB) -             D6502100
01717                   MCVISSUE-YEAR (LVL-TRM-SUB).                    D6502100
01718      COMPUTE XPD = X + PD.                                        D6502100
01719      COMPUTE C = MCVISSUE-YEAR (LVL-TRM-SUB) - MCVISSUE-YEAR (1). D6502100
01720      IF MCVISSUE-DAY (LVL-TRM-SUB) < MCVISSUE-DAY (1)             D6502100
01721         COMPUTE C = C - 1.                                        D6502100
01722      COMPUTE XCPD = XPD + C.                                      D6502100
01723      COMPUTE XCPD = XCPD + 1.                                     D6502100
01724      IF MCVMALE (1)                                               D6502100
01725         COMPUTE NXCPD = M-N (XCPD)                                D6502100
01726      ELSE                                                         D6502100
01727         COMPUTE NXCPD = F-N (XCPD).                               D6502100
01728      COMPUTE XCPD = XCPD - 1.                                     D6502100
01729 ******************************************************************D6502100
01730 * THE MAIN PROCESSING PARAGRAPH FOR CALCULATING A 7-PAY PREMIUM  *D6502100
01731 *    FOR LAST SURVIVOR.                                          *D6502100
01732 *    IT INVOKES SELECTION OF THE APPROPRIATE COMMUTATION         *D6502100
01733 *    TABLES; CALCULATION OF AGE AND DURATIONAL FACTORS;          *D6502100
01734 *    RETREIVAL OF COMMUTATION VALUES; CALCULATION OF EACH        *D6502100
01735 *    PARTIAL VALUE IN THE TOTAL PREMIUM; AND COMPUTATION OF THE  *D6502100
01736 *    FINAL 7-PAY PREMIUM.                                        *D6502100
01737 ******************************************************************D6502100
01738  400000-CALCULATE-7-PAY-PREMIUM.                                  D6502100
01739      MOVE MRCPOLICY-NUMBER TO R22-POLICY-NUMBER.                  D6502100
01740      PERFORM 420000-INSURED-AGES.                                 D6502100
01741      PERFORM 430000-GET-COMMUTATION-VALUES.                       D6502100
01742      MOVE +0 TO BLS-WPD            B-WPD                          D6502100
01743                 CLS-TERM                                          D6502100
01744                 DLS-TERM-WPD                                      D6502100
01745                 ELS-ACCEL          E-ACCEL                        D6502100
01746                 FLS-ACCEL-WPD                                     D6502100
01747                 1035-CV-FACTOR.                                   D6502100
01748      PERFORM 510000-A-BASE.                                       D6502100
01749      PERFORM 520000-B-WPD.                                        D6502100
01750      PERFORM 530000-C-TERM.                                       D6502100
01751      PERFORM 540000-D-TERM-WPD.                                   D6502100
01752      PERFORM 550000-E-ACCEL.                                      D6502100
01753      PERFORM 560000-F-ACCEL-WPD.                                  D6502100
01754      PERFORM 240000-GET-1035-OR-CV-FACTOR.                        D6502100
01755      PERFORM 450000-TOTAL-PARTS.                                  D6502100
01756                                                                   D6502100
01757 ******************************************************************D6502100
01758 * CALCULATE THE INSURED AGE AND DURATION.                        *D6502100
01759 ******************************************************************D6502100
01760  420000-INSURED-AGES.                                             D6502100
01761      MOVE LNK-7-PAY-START-DATE TO YYYYMMDD.                       D6502100
01762      PERFORM 600000-CONV-YYYYMMDD-YYYDDD.                         D6502100
01763      MOVE YYYDDD TO 7-PAY-START-DATE-YYYDDD.                      D6502100
01764      COMPUTE X = MCVAISSUE-AGE(1).                                D6502100
01765      COMPUTE INSURED-AGE = X.                                     D6502100
01766      MOVE MONTYPE-CODE TO HOLD-TYPE.                              D6502100
01767      MOVE HOLD-AGE TO Y.                                          D6502100
01768      IF MATERIAL-CHANGE                                           D6502100
01769          COMPUTE DURATION = 7-PAY-START-DATE-YYYDDD-YEAR -        D6502100
01770                             MCVISSUE-YEAR (1)                     D6502100
01771          IF 7-PAY-START-DATE-YYYDDD-DAY < MCVISSUE-DAY (1)        D6502100
01772          COMPUTE DURATION = DURATION - 1.                         D6502100
01773      IF MATERIAL-CHANGE                                           D6502100
01774          MOVE DURATION TO T                                       D6502100
01775          COMPUTE INSURED-ATTAINED-AGE = INSURED-AGE + T           D6502100
01776          COMPUTE XT = INSURED-ATTAINED-AGE                        D6502100
01777          COMPUTE YT = Y + T                                       D6502100
01778      ELSE                                                         D6502100
01779          MOVE +0 TO DURATION                                      D6502100
01780                     T                                             D6502100
01781          COMPUTE INSURED-ATTAINED-AGE = INSURED-AGE               D6502100
01782          COMPUTE XT = X                                           D6502100
01783          COMPUTE YT = Y.                                          D6502100
01784                                                                   D6502100
01785 ******************************************************************D6502100
01786 * THIS PARAGRAPH SELECTS THE APPROPRIATE COMMUTATION FUNCTIONS   *D6502100
01787 *    TO BE USED BASED ON AGE AND SEX.  ALSO THE 7-PAY PREMIUM    *D6502100
01788 *    USED IN SOME CALCULATIONS AND A SEVEN YEAR ANNUITY FACTOR   *D6502100
01789 *    ARE SELECTED BASED ON AGE AND SEX.                          *D6502100
01790 ******************************************************************D6502100
01791  430000-GET-COMMUTATION-VALUES.                                   D6502100
01792      MOVE +13 TO JOBMARK.                                         D6502100
01793      MOVE +0 TO R22-NUMBER-OF-UNITS.                              D6502100
01794      IF MRCPOLICY-NUMBER > '1617999990'                           D6502100
01795          MOVE 'a21A' TO TABLECODE                                 D6502100
01796      ELSE                                                         D6502100
01797          MOVE 'a21C' TO TABLECODE.                                D6502100
01798      MOVE -2 TO R22-AGE-PARM (1).                                 D6502100
01799      MOVE MCVAISSUE-AGE (1) TO R22-AGE-PARM (2).                  D6502100
01800      MOVE HOLD-AGE TO R22-AGE-PARM (3).                           D6502100
01801      MOVE -2 TO R22-STATUS-CODE-PARM (1).                         D6502100
01802      MOVE +0 TO R22-STATUS-CODE-PARM (2)                          D6502100
01803                 R22-STATUS-CODE-PARM (3).                         D6502100
01804      IF MCVRATE-BOOK (1) = 'N1' OR 'N3'                           D6502100
01805          MOVE +64 TO R22-STATUS-CODE-PARM (2).                    D6502100
01806      IF MCVRATE-BOOK (1) = 'N2' OR 'N3'                           D6502100
01807          MOVE +64 TO R22-STATUS-CODE-PARM (3).                    D6502100
01808      MOVE '02' TO R22-SPECIAL-TABLE-PARM (1).                     D6502100
01809      MOVE FLAT-EXTRA-CODE-ZERO TO R22-FLAT-EXTRA-CODE.            D6502100
01810      PERFORM 799999-DUMMY VARYING I FROM 1 BY 1                   D6502100
01811          UNTIL I > 7 OR MELTRIDENT (I) = '  ' OR                  D6502100
01812          (MELSUB-TYPE (I) = '1' AND MELPHASE (I) = '0').          D6502100
01813      IF  I > 7                                                    D6502100
01814          MOVE SPACES TO R22-SPECIAL-TABLE-PARM (2)                D6502100
01815      ELSE                                                         D6502100
01816          MOVE MELTABLE (I) TO R22-SPECIAL-TABLE-PARM (2).         D6502100
01817      IF I NOT > 7                                                 D6502100
01818        IF  MELSUB-TYPE (I) = '1'                                  D6502100
01819          MOVE -.02 TO R22-PERM-FE (1)                             D6502100
01820          MOVE MEL-RESERVES (I, 1) TO R22-TEMP-FE (2)              D6502100
01821          MOVE MEL-RESERVES (I, 3) TO R22-PERM-FE (2)              D6502100
01822          IF R22-TEMP-FE (2) > +0                                  D6502100
01823              COMPUTE R22-TEMP-DUR (2) = MEL-RESERVES (I, 2)       D6502100
01824                  - (MCVISSUE-YEAR (1) + 1800).                    D6502100
01825      PERFORM 799999-DUMMY VARYING I FROM 1 BY 1                   D6502100
01826          UNTIL I > 7 OR MELTRIDENT (I) = '  ' OR                  D6502100
01827          (MELSUB-TYPE (I) = '2' AND MELPHASE (I) = '0').          D6502100
01828      IF  I > 7                                                    D6502100
01829          MOVE SPACES TO R22-SPECIAL-TABLE-PARM (3)                D6502100
01830      ELSE                                                         D6502100
01831          MOVE MELTABLE (I) TO R22-SPECIAL-TABLE-PARM (3).         D6502100
01832      IF I NOT > 7                                                 D6502100
01833        IF  MELSUB-TYPE (I) = '2'                                  D6502100
01834          MOVE -.02 TO R22-PERM-FE (1)                             D6502100
01835          MOVE MEL-RESERVES (I, 1) TO R22-TEMP-FE (3)              D6502100
01836          MOVE MEL-RESERVES (I, 3) TO R22-PERM-FE (3)              D6502100
01837          IF R22-TEMP-FE (3) > +0                                  D6502100
01838              COMPUTE R22-TEMP-DUR (3) = MEL-RESERVES (I, 2)       D6502100
01839                  - (MCVISSUE-YEAR (1) + 1800).                    D6502100
01840      MOVE '2' TO R22-SEX-PARM (1).                                D6502100
01841      MOVE MCVSEX (1) TO R22-SEX-PARM (2).                         D6502100
01842      MOVE HOLD-SEX TO R22-SEX-PARM (3).                           D6502100
01843      COMPUTE R22-DURATION = DURATION + 7.                         D6502100
01844      PERFORM 590000-CALL-R2200000.                                D6502100
01845      MOVE R22-NX TO NXT7.                                         D6502100
01846      MOVE DURATION TO R22-DURATION.                               D6502100
01847      PERFORM 590000-CALL-R2200000.                                D6502100
01848      MOVE R22-NX TO NXT.                                          D6502100
01849      IF MRCPOLICY-NUMBER > '1617999990'                           D6502100
01850          COMPUTE 7PAYUNIT-XT = SMALLD-450 * 1000 * R22-MX /       D6502100
01851              (DELTA-450 * (NXT - NXT7))                           D6502100
01852          MOVE 'a20A' TO TABLECODE                                 D6502100
01853          PERFORM 590000-CALL-R2200000                             D6502100
01854          COMPUTE 7YRANNUITY-XT = DELTA-450 *                      D6502100
01855              (NXT - NXT7) / (R22-DX * SMALLD-450)                 D6502100
01856      ELSE                                                         D6502100
01857          COMPUTE 7PAYUNIT-XT = SMALLD-500 * 1000 * R22-MX /       D6502100
01858              (DELTA-500 * (NXT - NXT7))                           D6502100
01859          MOVE 'a20C' TO TABLECODE                                 D6502100
01860          PERFORM 590000-CALL-R2200000                             D6502100
01861          COMPUTE 7YRANNUITY-XT = DELTA-500 *                      D6502100
01862              (NXT - NXT7) / (R22-DX * SMALLD-500).                D6502100
01863      MOVE R22-NX TO NXT.                                          D6502100
01864      MOVE R22-DX TO DXT.                                          D6502100
01865      COMPUTE R22-DURATION = DURATION + 7.                         D6502100
01866      PERFORM 590000-CALL-R2200000.                                D6502100
01867      MOVE R22-NX TO NXT7.                                         D6502100
01868      IF MCVCLASS (1) = '1' AND                                    D6502100
01869          FIRST-BYTE-BASE = HEX-21                                 D6502100
01870          COMPUTE R22-DURATION = DURATION + 15                     D6502100
01871          PERFORM 590000-CALL-R2200000                             D6502100
01872          MOVE R22-NX TO NXT15.                                    D6502100
01873      COMPUTE R22-DURATION = 65 - X.                               D6502100
01874      PERFORM 590000-CALL-R2200000.                                D6502100
01875      MOVE R22-NX TO N65.                                          D6502100
01876      COMPUTE R22-DURATION = 65 - Y.                               D6502100
01877      PERFORM 590000-CALL-R2200000.                                D6502100
01878      MOVE R22-NX TO NY65.                                         D6502100
01879                                                                   D6502100
01880                                                                   D6502100
01881  450000-TOTAL-PARTS.                                              D6502100
01882      COMPUTE LNK-7-PAY-PREMIUM ROUNDED = ALS-BASE +               D6502100
01883                                          BLS-WPD +                D6502100
01884                                          CLS-TERM +               D6502100
01885                                          DLS-TERM-WPD +           D6502100
01886                                          ELS-ACCEL +              D6502100
01887                                          FLS-ACCEL-WPD -          D6502100
01888                                          1035-CV-FACTOR.          D6502100
01889 /                                                                 D6502100
01890 ******************************************************************D6502100
01891 * COMPUTE THE BASE COVERAGE (LAST SURV) PORTION OF THE 7-PAY     *D6502100
01892 *    PREMIUM.                                                    *D6502100
01893 ******************************************************************D6502100
01894  510000-A-BASE.                                                   D6502100
01895      COMPUTE BASEFACE = ((MCVNUMBER-OF-UNITS(1) *                 D6502100
01896                          MCVVALUE-PER-UNIT(1)) / 1000).           D6502100
01897      MOVE BASEFACE TO NEWMINFACE.                                 D6502100
01898      MOVE 0 TO PU-SUB.                                            D6502100
01899      IF MATERIAL-CHANGE                                           D6502100
01900          PERFORM 311000-PU-ADDITIONS                              D6502100
01901              VARYING PU-SUB                                       D6502100
01902              FROM 1 BY 1                                          D6502100
01903              UNTIL PU-SUB > 2.                                    D6502100
01904      COMPUTE ALS-BASE ROUNDED = (NEWMINFACE *                     D6502100
01905                        7PAYUNIT-XT).                              D6502100
01906                                                                   D6502100
01907 ******************************************************************D6502100
01908 * COMPUTE THE WPD PORTION OF THE 7-PAY PREMIUM.                  *D6502100
01909 ******************************************************************D6502100
01910  520000-B-WPD.                                                    D6502100
01911      MOVE 0 TO WPD-SUB.                                           D6502100
01912      MOVE +0 TO B-PREM-WORK.                                      D6502100
01913      MOVE +0 TO B-PREM-WORK-2ND.                                  D6502100
01914      PERFORM 799999-DUMMY                                         D6502100
01915          VARYING WPD-SUB                                          D6502100
01916          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10)  OR                                   Q17189
01917**Q17189  UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND             D6502100
01917                ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND               Q17189
01918                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
01919                 MSBSUB-TYPE (WPD-SUB) = '1' AND                   D6502100
01920**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
01920                 MSBACTIVE(WPD-SUB))                                 Q17189
01921**Q17189        (WPD-SUB > 10).                                    D6502100
01922      IF WPD-SUB NOT > 10                                          D6502100
01923           PERFORM 521000-B-FIRST.                                 D6502100
01924       PERFORM 799999-DUMMY                                        D6502100
01925          VARYING WPD-SUB                                          D6502100
01926          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10)  OR                                   Q17189
01927**Q17189  UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND             D6502100
01927                ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND               Q17189
01928                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
01929                 MSBSUB-TYPE (WPD-SUB) = '2' AND                   D6502100
01930**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
01930                 MSBACTIVE(WPD-SUB)) .                               Q17189
01931**Q17189         (WPD-SUB > 10).                                   D6502100
01932      IF WPD-SUB NOT > 10                                          D6502100
01933          PERFORM 522000-B-SECOND.                                 D6502100
01934      COMPUTE BLS-WPD ROUNDED =                                    D6502100
01935          (B-PREM-WORK + B-PREM-WORK-2ND)/                         D6502100
01936          (7YRANNUITY-XT * DXT).                                   D6502100
01937  521000-B-FIRST.                                                  D6502100
01938      COMPUTE B-WPD = (MSBANN-PREM-UNIT(WPD-SUB) *                 D6502100
01939                       MSBNUMBER-UNITS (WPD-SUB)).                 D6502100
01940      IF (MCVCLASS (1) = '1' AND                                   D6502100
01941          FIRST-BYTE-BASE = HEX-21)                                D6502100
01942         IF DURATION NOT > 15                                      D6502100
01943             IF X < 50                                             D6502100
01944                 COMPUTE B-PREM-WORK ROUNDED = B-WPD *             D6502100
01945                 (NXT - NXT15 - (2 * N65))                         D6502100
01946             ELSE                                                  D6502100
01947                 COMPUTE B-PREM-WORK ROUNDED = B-WPD *             D6502100
01948                 (NXT - N65)                                       D6502100
01949         ELSE                                                      D6502100
01950             IF XT < 65                                            D6502100
01951                 COMPUTE B-PREM-WORK ROUNDED = B-WPD *             D6502100
01952                 2 * (NXT - N65)                                   D6502100
01953             ELSE                                                  D6502100
01954                 NEXT SENTENCE                                     D6502100
01955      ELSE                                                         D6502100
01956          COMPUTE B-PREM-WORK ROUNDED = B-WPD *                    D6502100
01957          (NXT - N65).                                             D6502100
01958  522000-B-SECOND.                                                 D6502100
01959      COMPUTE B-WPD-2ND = (MSBANN-PREM-UNIT(WPD-SUB) *             D6502100
01960                           MSBNUMBER-UNITS (WPD-SUB)).             D6502100
01961      IF (MCVCLASS (1) = '1' AND                                   D6502100
01962          FIRST-BYTE-BASE = HEX-21)                                D6502100
01963          IF DURATION NOT > 15                                     D6502100
01964             IF Y < 50                                             D6502100
01965                 COMPUTE B-PREM-WORK-2ND ROUNDED = B-WPD-2ND *     D6502100
01966                 (NXT - NXT15 - (2 * NY65))                        D6502100
01967             ELSE                                                  D6502100
01968                 COMPUTE B-PREM-WORK-2ND ROUNDED = B-WPD-2ND *     D6502100
01969                 (NXT - NY65)                                      D6502100
01970         ELSE                                                      D6502100
01971             IF YT < 65                                            D6502100
01972                 COMPUTE B-PREM-WORK-2ND ROUNDED = B-WPD-2ND *     D6502100
01973                 2 * (NXT - NY65)                                  D6502100
01974             ELSE                                                  D6502100
01975                 NEXT SENTENCE                                     D6502100
01976      ELSE                                                         D6502100
01977          COMPUTE B-PREM-WORK-2ND ROUNDED = B-WPD-2ND *            D6502100
01978          (NXT - NY65).                                            D6502100
01979 ******************************************************************D6502100
01980 * COMPUTE THE TERM PORTION OF THE 7-PAY PREMIUM.                 *D6502100
01981 ******************************************************************D6502100
01982  530000-C-TERM.                                                   D6502100
01983      MOVE 0 TO TERM-SUB.                                          D6502100
01984      PERFORM 531000-CHECK-PLAN                                    D6502100
01985          VARYING TERM-SUB                                         D6502100
01986          FROM 1 BY 1                                              D6502100
               UNTIL (TERM-SUB > 5) OR                                    Q17189
01987**Q17189 UNTIL (MCVCLASS (TERM-SUB) = 'C' AND                      D6502100
 1987               (MCVCLASS (TERM-SUB) = 'C' AND                        Q17189
01988**Q17189      FIRST-BYTE-BASE = HEX-45) OR                         D6502100
01988              FIRST-BYTE-BASE = HEX-45) .                            Q17189
01989**Q17189        (TERM-SUB > 5).                                    D6502100
01990      IF TERM-SUB NOT > 5                                          D6502100
01991          PERFORM 532000-CHECK-TERM.                               D6502100
01992  531000-CHECK-PLAN.                                               D6502100
01993      MOVE MCVBASE (TERM-SUB) TO HOLD-BASE.                        D6502100
01994      IF FIRST-BYTE-BASE = HEX-45                                  D6502100
01995          SUBTRACT +1 FROM TERM-SUB.                               D6502100
01996  532000-CHECK-TERM.                                               D6502100
01997      MOVE MCVCLASS (TERM-SUB) TO PLANCODE-CLASS.                  D6502100
01998      MOVE MCVSERIES (TERM-SUB) TO PLANCODE-SERIES.                D6502100
01999      MOVE MCVNUMBER-OF-UNITS (TERM-SUB) TO R22-NUMBER-OF-UNITS.   D6502100
02000      MOVE X TO S.                                                 D6502100
02001      IF Y > X                                                     D6502100
02002          MOVE Y TO S.                                             D6502100
02003      COMPUTE TERM-PREMIUM =                                       D6502100
02004          MCVANN-PREM-PER-UNIT (TERM-SUB).                         D6502100
02005      MOVE +0 TO R22-DURATION.                                     D6502100
02006      MOVE +0 TO C-PREM-WORK.                                      D6502100
02007      PERFORM 590000-CALL-R2200000.                                D6502100
02008      MOVE R22-NX TO N5LO.                                         D6502100
02009      PERFORM 533000-GET-TERM-VALUES VARYING I FROM S BY 5         D6502100
02010          UNTIL I > 75.                                            D6502100
02011      COMPUTE CLS-TERM ROUNDED = C-PREM-WORK *                     D6502100
02012         MCVNUMBER-OF-UNITS (TERM-SUB) /                           D6502100
02013         (7YRANNUITY-XT * DXT).                                    D6502100
02014  533000-GET-TERM-VALUES.                                          D6502100
02015      COMPUTE R22-DURATION = I - S.                                D6502100
02016      IF I > S                                                     D6502100
02017          PERFORM 591000-CALL-R2200000                             D6502100
02018          COMPUTE TERM-PREMIUM = MALE-PREMIUM.                     D6502100
02019      ADD +5 TO R22-DURATION.                                      D6502100
02020      PERFORM 590000-CALL-R2200000.                                D6502100
02021      MOVE R22-NX TO N5HI.                                         D6502100
02022      COMPUTE C-PREM-WORK = C-PREM-WORK +                          D6502100
02023          TERM-PREMIUM * (N5LO - N5HI).                            D6502100
02024      MOVE N5HI TO N5LO.                                           D6502100
02025 ******************************************************************D6502100
02026 * COMPUTE THE WPD TERM PORTION OF THE 7-PAY PREMIUM.             *D6502100
02027 ******************************************************************D6502100
02028  540000-D-TERM-WPD.                                               D6502100
02029      MOVE 0 TO TERM-SUB.                                          D6502100
02030      MOVE HEX-00 TO FIRST-BYTE-BASE.                              D6502100
02031      PERFORM 531000-CHECK-PLAN                                    D6502100
02032          VARYING TERM-SUB                                         D6502100
02033          FROM 1 BY 1                                              D6502100
               UNTIL (TERM-SUB > 5) OR                                    Q17189
02034**Q17189  UNTIL MCVCLASS (TERM-SUB) = 'C' AND                      D6502100
02034                MCVCLASS (TERM-SUB) = 'C' AND                        Q17189
     **Q17189         FIRST-BYTE-BASE = HEX-45 OR                       D6502100
02035                 FIRST-BYTE-BASE = HEX-45 .                          Q17189
02036**Q17189        (TERM-SUB > 5).                                    D6502100
02037      IF TERM-SUB NOT > 5                                          D6502100
02038          PERFORM 542000-CHECK-TERM.                               D6502100
02039  542000-CHECK-TERM.                                               D6502100
02040      MOVE MCVCLASS (TERM-SUB) TO PLANCODE-CLASS.                  D6502100
02041      MOVE MCVSERIES (TERM-SUB) TO PLANCODE-SERIES.                D6502100
02042      MOVE MCVNUMBER-OF-UNITS (TERM-SUB) TO R22-NUMBER-OF-UNITS.   D6502100
02043      MOVE X TO S.                                                 D6502100
02044      MOVE +0 TO D-PREM-WORK.                                      D6502100
02045      MOVE +0 TO D-PREM-WORK-2ND.                                  D6502100
02046      PERFORM 799999-DUMMY                                         D6502100
02047          VARYING WPD-SUB                                          D6502100
02048          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10) OR                                    Q17189
02049**Q17189  UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(TERM-SUB)) AND      D6502100
02049                ((MSBPHASE(WPD-SUB) = MCVPHASE(TERM-SUB)) AND        Q17189
02050                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
02051                 MSBSUB-TYPE (WPD-SUB) = '1' AND                   D6502100
02052**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
02052                 MSBACTIVE(WPD-SUB)) .                               Q17189
02053**Q17189        (WPD-SUB > 10).                                    D6502100
02054      IF WPD-SUB NOT > 10                                          D6502100
02055          COMPUTE TERM-PREMIUM = MSBNUMBER-UNITS (WPD-SUB) *       D6502100
02056              MSBANN-PREM-UNIT (WPD-SUB)                           D6502100
02057          MOVE +0 TO R22-DURATION                                  D6502100
02058          PERFORM 590000-CALL-R2200000                             D6502100
02059          MOVE R22-NX TO N5LO                                      D6502100
02060          PERFORM 543000-GET-TERM-WPD1 VARYING I FROM S BY 5       D6502100
02061              UNTIL I > 60                                         D6502100
02062          COMPUTE R22-DURATION = I - S                             D6502100
02063          PERFORM 591000-CALL-R2200000                             D6502100
02064          COMPUTE TERM-PREMIUM =                                   D6502100
02065              (((MALE-PREMIUM * MCVNUMBER-OF-UNITS (TERM-SUB)) /   D6502100
02066                  100)) * WPD-PREMIUM                              D6502100
02067          COMPUTE D-PREM-WORK = D-PREM-WORK +                      D6502100
02068              TERM-PREMIUM * (N5LO - N65).                         D6502100
02069       PERFORM 799999-DUMMY                                        D6502100
02070          VARYING WPD-SUB                                          D6502100
02071          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10) OR                                    Q17189
02072**Q17189  UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(TERM-SUB)) AND      D6502100
02072                ((MSBPHASE(WPD-SUB) = MCVPHASE(TERM-SUB)) AND        Q17189
02073                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
02074                 MSBSUB-TYPE (WPD-SUB) = '2' AND                   D6502100
02075**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
02075                 MSBACTIVE(WPD-SUB)) .                               Q17189
02076**Q17189         (WPD-SUB > 10).                                   D6502100
02077      IF WPD-SUB NOT > 10                                          D6502100
02078          COMPUTE TERM-PREMIUM = MSBNUMBER-UNITS (WPD-SUB) *       D6502100
02079              MSBANN-PREM-UNIT (WPD-SUB)                           D6502100
02080          MOVE +0 TO R22-DURATION                                  D6502100
02081          PERFORM 590000-CALL-R2200000                             D6502100
02082          MOVE R22-NX TO N5LO                                      D6502100
02083          MOVE Y TO S                                              D6502100
02084          MOVE +0 TO D-TERM-WPD-2ND                                D6502100
02085          PERFORM 543000-GET-TERM-WPD2 VARYING I FROM S BY 5       D6502100
02086              UNTIL I > 60                                         D6502100
02087          COMPUTE R22-DURATION = I - S                             D6502100
02088          MOVE X TO R22-AGE-PARM (2)                               D6502100
02089          PERFORM 591000-CALL-R2200000                             D6502100
02090          MOVE MALE-PREMIUM TO HOLD-MALE                           D6502100
02091          MOVE Y TO R22-AGE-PARM (2)                               D6502100
02092          PERFORM 591000-CALL-R2200000                             D6502100
02093          COMPUTE TERM-PREMIUM =                                   D6502100
02094              (((HOLD-MALE * MCVNUMBER-OF-UNITS (TERM-SUB)) /      D6502100
02095                  100)) * WPD-PREMIUM                              D6502100
02096          COMPUTE D-PREM-WORK-2ND = D-PREM-WORK-2ND +              D6502100
02097              TERM-PREMIUM * (N5LO - NY65).                        D6502100
02098      COMPUTE DLS-TERM-WPD ROUNDED =                               D6502100
02099          (D-PREM-WORK + D-PREM-WORK-2ND)/                         D6502100
02100          (7YRANNUITY-XT * DXT).                                   D6502100
02101  543000-GET-TERM-WPD1.                                            D6502100
02102      COMPUTE R22-DURATION = I - S.                                D6502100
02103      IF I > S                                                     D6502100
02104          PERFORM 591000-CALL-R2200000                             D6502100
02105          COMPUTE TERM-PREMIUM =                                   D6502100
02106              (((MALE-PREMIUM * MCVNUMBER-OF-UNITS (TERM-SUB)) /   D6502100
02107                  100)) * WPD-PREMIUM.                             D6502100
02108      ADD +5 TO R22-DURATION.                                      D6502100
02109      PERFORM 590000-CALL-R2200000.                                D6502100
02110      MOVE R22-NX TO N5HI.                                         D6502100
02111      COMPUTE D-PREM-WORK = D-PREM-WORK +                          D6502100
02112          TERM-PREMIUM * (N5LO - N5HI).                            D6502100
02113      MOVE N5HI TO N5LO.                                           D6502100
02114  543000-GET-TERM-WPD2.                                            D6502100
02115      COMPUTE R22-DURATION = I - S.                                D6502100
02116      IF I > S                                                     D6502100
02117          MOVE X TO R22-AGE-PARM (2)                               D6502100
02118          PERFORM 591000-CALL-R2200000                             D6502100
02119          MOVE MALE-PREMIUM TO HOLD-MALE                           D6502100
02120          MOVE Y TO R22-AGE-PARM (2)                               D6502100
02121          PERFORM 591000-CALL-R2200000                             D6502100
02122          COMPUTE TERM-PREMIUM =                                   D6502100
02123              (((HOLD-MALE * MCVNUMBER-OF-UNITS (TERM-SUB)) /      D6502100
02124                  100)) * WPD-PREMIUM.                             D6502100
02125      ADD +5 TO R22-DURATION.                                      D6502100
02126      MOVE X TO R22-AGE-PARM (2).                                  D6502100
02127      PERFORM 590000-CALL-R2200000.                                D6502100
02128      MOVE R22-NX TO N5HI.                                         D6502100
02129      COMPUTE D-PREM-WORK-2ND = D-PREM-WORK-2ND +                  D6502100
02130          TERM-PREMIUM * (N5LO - N5HI).                            D6502100
02131      MOVE N5HI TO N5LO.                                           D6502100
02132 ******************************************************************D6502100
02133 * COMPUTE THE ACCELERATOR AND ACCELERATOR ONE PORTION OF THE     *D6502100
02134 *    7-PAY PREMIUM--LAST SURVIVOR.                               *D6502100
02135 ******************************************************************D6502100
02136  550000-E-ACCEL.                                                  D6502100
02137      MOVE 0 TO ACCEL-SUB.                                         D6502100
           DISPLAY 'TRAX8-R22-POLICY-NUMBER=' R22-POLICY-NUMBER.
02138      PERFORM 551000-CHECK-PLAN                                    D6502100
02139          VARYING ACCEL-SUB                                        D6502100
02140          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL-SUB > 5) OR                                   Q17189
02141**Q17189  UNTIL (MCVCLLIFE(ACCEL-SUB) AND                          D6502100
02141                (MCVCLLIFE(ACCEL-SUB) AND                            Q17189
02142                (FIRST-BYTE-BASE = HEX-23) AND                     D6502100
02143**Q17189        (MCVMATEX-USE(ACCEL-SUB) = '0')) OR                D6502100
02143                (MCVMATEX-USE(ACCEL-SUB) = '0')) .                   Q17189
02144**Q17189        (ACCEL-SUB > 5).                                   D6502100
02145      IF ACCEL-SUB NOT > 5                                         D6502100
02146          COMPUTE E-ACCEL = (MCVNUMBER-OF-UNITS(ACCEL-SUB) *       D6502100
02147                            MCVVALUE-PER-UNIT(ACCEL-SUB)) / 1000.  D6502100
02148      MOVE 0 TO ACCEL1-SUB.                                        D6502100
02149      PERFORM 799999-DUMMY                                         D6502100
02150          VARYING ACCEL1-SUB                                       D6502100
02151          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL1-SUB > 2) OR                                  Q17189
02152**Q17189  UNTIL (((MPUFUNCTIONS(ACCEL1-SUB) = '8') OR              D6502100
02152                (((MPUFUNCTIONS(ACCEL1-SUB) = '8') OR                Q17189
02153                 (MPUFUNCTIONS(ACCEL1-SUB) = '9')) AND             D6502100
02154**Q17189         MPUACTIVE(ACCEL1-SUB)) OR                         D6502100
02154                 MPUACTIVE(ACCEL1-SUB)) .                            Q17189
02155**Q17189        (ACCEL1-SUB > 2).                                  D6502100
02156      IF ACCEL1-SUB NOT > 2                                        D6502100
02157          COMPUTE E-ACCEL = E-ACCEL +                              D6502100
02158                            (MPUADDITIONS-TOTAL(ACCEL1-SUB) /      D6502100
02159                             1000).                                D6502100
02160      COMPUTE ELS-ACCEL ROUNDED = E-ACCEL * 7PAYUNIT-XT.           D6502100
02161  551000-CHECK-PLAN.                                               D6502100
      *    DISPLAY 'MCVCLLIFE(ACCEL-SUB)=' MCVCLLIFE (ACCEL-SUB).
           DISPLAY 'TRAX7-FIRST-BYTE-BASE=' FIRST-BYTE-BASE '@@'.
           DISPLAY 'TRAX7-HEX-23=' HEX-23 '@@'.
           DISPLAY 'TRAX7-ACCEL-SUB=' ACCEL-SUB '@@'.
           DISPLAY 'TRAX7-HOLD-BASE=' HOLD-BASE '@@'.
           DISPLAY 'TRAX7-MCVBASE(ACCEL-SUB)='MCVBASE (ACCEL-SUB) '@@'.
02162      MOVE MCVBASE (ACCEL-SUB) TO HOLD-BASE                        D6502100
           DISPLAY 'TRAX7-HOLD-BASE=' HOLD-BASE '@@'.
02163      IF FIRST-BYTE-BASE = HEX-23                                  D6502100
02164          SUBTRACT +1 FROM ACCEL-SUB.                              D6502100
02165                                                                   D6502100
02166 ******************************************************************D6502100
02167 * COMPUTE THE WPD ON ACCELERATOR ONE PORTION OF THE 7-PAY        *D6502100
02168 *    PREMIUM.                                                    *D6502100
02169 ******************************************************************D6502100
02170  560000-F-ACCEL-WPD.                                              D6502100
02171      MOVE 0 TO ACCEL-SUB.                                         D6502100
02172      MOVE 0 TO F-PREM-WORK.                                       D6502100
02173      MOVE 0 TO F-PREM-WORK-2ND.                                   D6502100
02174      MOVE HEX-00 TO FIRST-BYTE-BASE                               D6502100
02175      PERFORM 551000-CHECK-PLAN                                    D6502100
02176          VARYING ACCEL-SUB                                        D6502100
02177          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL-SUB > 5) OR                                   Q17189
02178**Q17189  UNTIL (MCVCLLIFE(ACCEL-SUB) AND                          D6502100
02178                (MCVCLLIFE(ACCEL-SUB) AND                            Q17189
02179                (FIRST-BYTE-BASE = HEX-23) AND                     D6502100
02180**Q17189        (MCVMATEX-USE(ACCEL-SUB) = '0')) OR                D6502100
02180                (MCVMATEX-USE(ACCEL-SUB) = '0')) .                   Q17189
02181**Q17189        (ACCEL-SUB > 5).                                   D6502100
02182      IF ACCEL-SUB NOT > 5                                         D6502100
02183          MOVE 0 TO WPD-SUB                                        D6502100
02184          PERFORM 799999-DUMMY                                     D6502100
02185              VARYING WPD-SUB                                      D6502100
02186              FROM 1 BY 1                                          D6502100
                   UNTIL (WPD-SUB > 10)  OR                               Q17189
02187**Q17189      UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND D6502100
02187                    ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND   Q17189
02188                     MSBPREM-WAIVER(WPD-SUB) AND                   D6502100
02189                     MSBSUB-TYPE (WPD-SUB) = '1' AND               D6502100
02190**Q17189             MSBACTIVE(WPD-SUB)) OR                        D6502100
02190                     MSBACTIVE(WPD-SUB)) .                           Q17189
02191**Q17189            (WPD-SUB > 10).                                D6502100
02192      IF (ACCEL-SUB NOT > 5) AND                                   D6502100
02193         (WPD-SUB NOT > 10)                                        D6502100
02194          COMPUTE F-PREM-WORK = MSBANN-PREM-UNIT(WPD-SUB) *        D6502100
02195                                  MSBNUMBER-UNITS(WPD-SUB) *       D6502100
02196                                (NXT - N65).                       D6502100
02197      PERFORM 799999-DUMMY                                         D6502100
02198         VARYING WPD-SUB                                           D6502100
02199         FROM 1 BY 1                                               D6502100
              UNTIL (WPD-SUB > 10) OR                                     Q17189
02200**Q17189 UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND      D6502100
02200               ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND        Q17189
02201                MSBPREM-WAIVER(WPD-SUB) AND                        D6502100
02202                MSBSUB-TYPE (WPD-SUB) = '2' AND                    D6502100
02203**Q17189        MSBACTIVE(WPD-SUB)) OR                             D6502100
02203                MSBACTIVE(WPD-SUB)) .                                Q17189
02204**Q17189        (WPD-SUB > 10).                                    D6502100
02205      IF WPD-SUB NOT > 10                                          D6502100
02206          COMPUTE F-PREM-WORK-2ND = MSBANN-PREM-UNIT(WPD-SUB) *    D6502100
02207                                  MSBNUMBER-UNITS(WPD-SUB) *       D6502100
02208                                (NXT - NY65).                      D6502100
02209      COMPUTE FLS-ACCEL-WPD ROUNDED = (F-PREM-WORK +               D6502100
02210          F-PREM-WORK-2ND) / (7YRANNUITY-XT * DXT).                D6502100
02211                                                                   D6502100
02212  590000-CALL-R2200000.                                            D6502100
02213       CALL 'OSCALLOS' USING R2200000                              D6502100
02214                             RESULT-AREA-COMM                      D6502100
02215                             JOBMARK                               D6502100
02216                             R22-POLICY-NUMBER                     D6502100
02217                             PLANCODE-JOB13                        D6502100
02218                             R22-AGE-TABLE                         D6502100
02219                             R22-DURATION                          D6502100
02220                             R22-RESIDUAL-VALUE                    D6502100
02221                             R22-STATUS-CODE-TABLE                 D6502100
02222                             R22-NUMBER-OF-UNITS                   D6502100
02223                             R22-SPECIAL-TABLE                     D6502100
02224                             R22-CASH-VAL-T-1                      D6502100
02225                             R22-CASH-VAL-T                        D6502100
02226                             R22-PU-T                              D6502100
02227                             R22-JOINT                             D6502100
02228                             R22-ISSUEDATE                         D6502100
02229                             R22-SEX                               D6502100
02230                             R22-FLAT-EXTRA-CODE.                  D6502100
02231  591000-CALL-R2200000.                                            D6502100
02232       CALL 'OSCALLOS' USING R2200000                              D6502100
02233                             RESULT-AREA-PREM                      D6502100
02234                             JOB06                                 D6502100
02235                             R22-POLICY-NUMBER                     D6502100
02236                             PLANCODE-JOB6                         D6502100
02237                             R22-AGE-TABLE                         D6502100
02238                             R22-DURATION                          D6502100
02239                             R22-RESIDUAL-VALUE                    D6502100
02240                             R22-STATUS-CODE-TABLE                 D6502100
02241                             R22-NUMBER-OF-UNITS                   D6502100
02242                             R22-SPECIAL-TABLE                     D6502100
02243                             R22-CASH-VAL-T-1                      D6502100
02244                             R22-CASH-VAL-T                        D6502100
02245                             R22-PU-T                              D6502100
02246                             R22-JOINT                             D6502100
02247                             R22-ISSUEDATE                         D6502100
02248                             R22-SEX                               D6502100
02249                             R22-FLAT-EXTRA-CODE.                  D6502100
02250 /                                                                 D6502100
02251  600000-CONV-YYYYMMDD-YYYDDD.                                     D6502100
02252      MOVE YYYYMMDD-YEAR TO FORMAT-GREG-YYYY.                      D6502100
02253      MOVE YYYYMMDD-MONTH TO FORMAT-GREG-MM.                       D6502100
02254      MOVE YYYYMMDD-DAY TO FORMAT-GREG-DD.                         D6502100
02255      MOVE '2' TO OPTION-CODE IN DATE-CALC-AREA.                   D6502100
02256      MOVE FORMAT-GREG TO GREG-DATE-1.                             D6502100
02257                                                                   D6502100
02258      CALL 'D1006011' USING DATE-CALC-AREA.                        D6502100
02259                                                                   D6502100
02260      MOVE JUL-YEAR-2 TO YYYDDD-YEAR.                              D6502100
02261      MOVE JUL-DAY-2  TO YYYDDD-DAY.                               D6502100
02262      DIVIDE YYYDDD-YEAR BY 4 GIVING LEAP-YEAR-CHECK-QUOTIENT      D6502100
02263              REMAINDER LEAP-YEAR-CHECK-REMAINDER.                 D6502100
02264      IF (LEAP-YEAR AND YYYDDD-DAY > 59)                           D6502100
02265          COMPUTE YYYDDD-DAY = YYYDDD-DAY - 1.                     D6502100
02266 /                                                                 D6502100
02267  799999-DUMMY.                                                    D6502100
02268 /                                                                 D6502100
02269 ******************************************************************D6502100
02270 * THE MAIN PROCESSING PARAGRAPH FOR CALCULATING A 7-PAY PREMIUM  *D6502100
02271 *    FOR LEGACY.                                                 *D6502100
02272 *    IT INVOKES SELECTION OF THE APPROPRIATE COMMUTATION         *D6502100
02273 *    TABLES; CALCULATION OF AGE AND DURATIONAL FACTORS;          *D6502100
02274 *    RETREIVAL OF COMMUTATION VALUES; CALCULATION OF EACH        *D6502100
02275 *    PARTIAL VALUE IN THE TOTAL PREMIUM; AND COMPUTATION OF THE  *D6502100
02276 *    FINAL 7-PAY PREMIUM.                                        *D6502100
02277 ******************************************************************D6502100
02278  800000-CALCULATE-7-PAY-PREMIUM.                                  D6502100
02279      MOVE '1618000000' TO R22-POLICY-NUMBER.                      D6502100
02280      PERFORM 820000-INSURED-AGE.                                  D6502100
02281      PERFORM 830000-GET-COMMUTATION-VALUES THRU 830000-EXIT.      D6502100
02282      MOVE +0 TO BLG-CBR                                           D6502100
02283                 CLG-GIO                                           D6502100
02284                 DLG-ACCEL                                         D6502100
02285                 ELG-ACCEL-WPD                                     D6502100
02286                 FLG-TERM                                          D6502100
02287                 GLG-TERM-WPD                                      D6502100
02288                 BLG-CBR-W                                         D6502100
02289                 CLG-GIO-W                                         D6502100
02290                 DLG-ACCEL-W                                       D6502100
02291                 ELG-ACCEL-WPD-W                                   D6502100
02292                 FLG-TERM-W                                        D6502100
02293                 GLG-TERM-WPD-W                                    D6502100
02294                 1035-CV-FACTOR.                                   D6502100
02295      PERFORM 910000-A-BASE.                                       D6502100
02296      PERFORM 920000-B-CBR.                                        D6502100
02297      PERFORM 930000-C-GIO.                                        D6502100
02298      PERFORM 940000-D-ACCEL.                                      D6502100
02299      PERFORM 950000-E-ACCEL-WPD.                                  D6502100
02300      PERFORM 960000-F-TERM.                                       D6502100
02301      PERFORM 970000-G-TERM-WPD.                                   D6502100
02302      PERFORM 240000-GET-1035-OR-CV-FACTOR.                        D6502100
02303      PERFORM 850000-TOTAL-PARTS.                                  D6502100
02304                                                                   D6502100
02305 ******************************************************************D6502100
02306 * CALCULATE THE INSURED AGE AND DURATION.                        *D6502100
02307 ******************************************************************D6502100
02308  820000-INSURED-AGE.                                              D6502100
02309      MOVE LNK-7-PAY-START-DATE TO YYYYMMDD.                       D6502100
02310      PERFORM 600000-CONV-YYYYMMDD-YYYDDD.                         D6502100
02311      MOVE YYYDDD TO 7-PAY-START-DATE-YYYDDD.                      D6502100
02312      COMPUTE X = MCVAISSUE-AGE(1).                                D6502100
02313      COMPUTE INSURED-AGE = X.                                     D6502100
02314      MOVE MONTYPE-CODE TO HOLD-TYPE.                              D6502100
02315      IF MATERIAL-CHANGE                                           D6502100
02316          COMPUTE DURATION = 7-PAY-START-DATE-YYYDDD-YEAR -        D6502100
02317                             MCVISSUE-YEAR (1)                     D6502100
02318          IF 7-PAY-START-DATE-YYYDDD-DAY < MCVISSUE-DAY (1)        D6502100
02319          COMPUTE DURATION = DURATION - 1.                         D6502100
02320      IF MATERIAL-CHANGE                                           D6502100
02321          MOVE DURATION TO T                                       D6502100
02322          COMPUTE INSURED-ATTAINED-AGE = INSURED-AGE + T           D6502100
02323          COMPUTE XT = INSURED-ATTAINED-AGE                        D6502100
02324      ELSE                                                         D6502100
02325          MOVE +0 TO DURATION                                      D6502100
02326                     T                                             D6502100
02327          COMPUTE INSURED-ATTAINED-AGE = INSURED-AGE               D6502100
02328          COMPUTE XT = X.                                          D6502100
02329                                                                   D6502100
02330 ******************************************************************D6502100
02331 * THIS PARAGRAPH SELECTS THE APPROPRIATE COMMUTATION FUNCTIONS   *D6502100
02332 *    TO BE USED BASED ON AGE AND SEX.  ALSO THE 7-PAY PREMIUM    *D6502100
02333 *    USED IN SOME CALCULATIONS AND A SEVEN YEAR ANNUITY FACTOR   *D6502100
02334 *    ARE SELECTED BASED ON AGE AND SEX.                          *D6502100
02335 ******************************************************************D6502100
02336  830000-GET-COMMUTATION-VALUES.                                   D6502100
02337      MOVE +13 TO JOBMARK.                                         D6502100
02338      MOVE +0 TO R22-NUMBER-OF-UNITS.                              D6502100
02339      MOVE 'e11E' TO TABLECODE.                                    D6502100
02340      MOVE -1 TO R22-AGE-PARM (1).                                 D6502100
02341      MOVE MCVAISSUE-AGE (1) TO R22-AGE-PARM (2).                  D6502100
02342      MOVE -1 TO R22-STATUS-CODE-PARM (1).                         D6502100
02343      MOVE +0 TO R22-STATUS-CODE-PARM (2).                         D6502100
02344      IF MCVRATE-BOOK (1) = 'NT' OR 'NP' OR 'N4' OR 'N8'           D6502100
02345          MOVE +64 TO R22-STATUS-CODE-PARM (2).                    D6502100
02346      IF MCVRATE-BOOK (1) = 'NP' OR '0P' OR 'N8' OR '08'           D6502100
02347          ADD +4096 TO R22-STATUS-CODE-PARM (2).                   D6502100
AL8775*    MOVE '02' TO R22-SPECIAL-TABLE-PARM (1).                     D6502100
AL8775     MOVE '01' TO R22-SPECIAL-TABLE-PARM (1).                     D6502100
02349      MOVE FLAT-EXTRA-CODE-ZERO TO R22-FLAT-EXTRA-CODE.            D6502100
02350      PERFORM 799999-DUMMY VARYING I FROM 1 BY 1                   D6502100
02351          UNTIL I > 7 OR MELTRIDENT (I) = '  ' OR                  D6502100
02352          ((MELTABLE (I) NOT = '  ') AND MELPHASE (I) = '0').      D6502100
02353      IF  I > 7                                                    D6502100
02354          MOVE SPACES TO R22-SPECIAL-TABLE-PARM (2)                D6502100
02355      ELSE                                                         D6502100
02356          MOVE MELTABLE (I) TO R22-SPECIAL-TABLE-PARM (2).         D6502100
02357      MOVE '1' TO R22-SEX-PARM (1).                                D6502100
02358      MOVE MCVSEX (1) TO R22-SEX-PARM (2).                         D6502100
AL8775     COMPUTE R22-DURATION = DURATION.                             D6502100
AL8775     PERFORM 990000-CALL-R2200000.                                D6502100
02359      COMPUTE R22-DURATION = DURATION + 7.                         D6502100
02360      PERFORM 990000-CALL-R2200000.                                D6502100
02361      MOVE R22-NX TO NXT7.                                         D6502100
02362      MOVE DURATION TO R22-DURATION.                               D6502100
02363      PERFORM 990000-CALL-R2200000.                                D6502100
02364      MOVE R22-NX TO NXT.                                          D6502100
02365      COMPUTE 7PAYUNIT-XT-W = SMALLD-550 * 1000 * R22-MX /         D6502100
02366          (DELTA-550 * (NXT - NXT7)).                              D6502100
02367      COMPUTE 7PAYUNIT-XT =7PAYUNIT-XT-W.                          D6502100
02368      MOVE 'e10E' TO TABLECODE.                                    D6502100
02369      PERFORM 990000-CALL-R2200000.                                D6502100
02370      COMPUTE 7YRANNUITY-XT-W = DELTA-550 *                        D6502100
02371          (NXT - NXT7) / (R22-DX * SMALLD-550).                    D6502100
02372      COMPUTE 7YRANNUITY-XT = 7YRANNUITY-XT-W.                     D6502100
02373      MOVE R22-NX TO NXT.                                          D6502100
02374      MOVE R22-DX TO DXT.                                          D6502100
02375      COMPUTE R22-DURATION = DURATION + 7.                         D6502100
02376      PERFORM 990000-CALL-R2200000.                                D6502100
02377      MOVE R22-NX TO NXT7.                                         D6502100
02378      COMPUTE R22-DURATION = 65 - X.                               D6502100
02379      PERFORM 990000-CALL-R2200000.                                D6502100
02380      MOVE R22-NX TO N65.                                          D6502100
02381      MOVE +0 TO NXT20.                                            D6502100
02382      COMPUTE R22-DURATION = 65 - MCVAISSUE-AGE(1).                D6502100
02383      IF R22-DURATION > 20                                         D6502100
02384          MOVE +20 TO R22-DURATION.                                D6502100
02385      PERFORM 990000-CALL-R2200000.                                D6502100
02386      MOVE R22-NX TO NXT20.                                        D6502100
02387      COMPUTE R22-DURATION = 43 - X.                               D6502100
02388      PERFORM 990000-CALL-R2200000.                                D6502100
02389      MOVE R22-NX TO N43.                                          D6502100
02390      MOVE +5 TO R22-DURATION.                                     D6502100
02391      PERFORM 990000-CALL-R2200000.                                D6502100
02392      MOVE R22-NX TO NXT5.                                         D6502100
02393      PERFORM 961000-CHECK-PLAN                                    D6502100
02394          VARYING TERM-SUB                                         D6502100
02395          FROM 1 BY 1                                              D6502100
               UNTIL (TERM-SUB > 5) OR                                    Q17189
02396**Q17189  UNTIL (MCVCLASS (TERM-SUB) = '5' AND                     D6502100
02396                (MCVCLASS (TERM-SUB) = '5' AND                       Q17189
02397**Q17189      FIRST-BYTE-BASE = HEX-23) OR                         D6502100
02397              FIRST-BYTE-BASE = HEX-23) .                            Q17189
02398**Q17189        (TERM-SUB > 5).                                    D6502100
02399      MOVE +0 TO NXTPD.                                            D6502100
02400      IF TERM-SUB > 5                                              D6502100
02401          GO TO 830000-EXIT.                                       D6502100
02402      COMPUTE R22-DURATION = 65 - MCVAISSUE-AGE (TERM-SUB).        D6502100
02403      IF R22-DURATION > 20                                         D6502100
02404          MOVE +20 TO R22-DURATION.                                D6502100
02405      PERFORM 990000-CALL-R2200000.                                D6502100
02406      MOVE R22-NX TO NXTPD.                                        D6502100
02407      IF (65 - MCVAISSUE-AGE (1)) < R22-DURATION                   D6502100
02408          COMPUTE R22-DURATION = 65 - MCVAISSUE-AGE (1)            D6502100
02409          PERFORM 990000-CALL-R2200000.                            D6502100
02410      MOVE R22-NX TO NT523WPD.                                     D6502100
02411                                                                   D6502100
02412  830000-EXIT.                                                     D6502100
02413      EXIT.                                                        D6502100
02414                                                                   D6502100
02415  850000-TOTAL-PARTS.                                              D6502100
02416      COMPUTE LNK-7-PAY-PREMIUM ROUNDED = ALG-BASE +               D6502100
02417                                          BLG-CBR +                D6502100
02418                                          CLG-GIO +                D6502100
02419                                          DLG-ACCEL +              D6502100
02420                                          ELG-ACCEL-WPD +          D6502100
02421                                          FLG-TERM +               D6502100
02422                                          GLG-TERM-WPD -           D6502100
02423                                          1035-CV-FACTOR.          D6502100
02424 /                                                                 D6502100
02425 ******************************************************************D6502100
02426 * COMPUTE THE BASE COVERAGE (LEGACY) PORTION OF THE 7-PAY        *D6502100
02427 *    PREMIUM.                                                    *D6502100
02428 ******************************************************************D6502100
02429  910000-A-BASE.                                                   D6502100
02430      MOVE 0 TO WPD-SUB.                                           D6502100
02431      PERFORM 799999-DUMMY                                         D6502100
02432          VARYING WPD-SUB                                          D6502100
02433          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10)  OR                                   Q17189
02434**Q17189  UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND             D6502100
02434                ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND               Q17189
02435                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
02436**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
02436                 MSBACTIVE(WPD-SUB)) .                               Q17189
02437**Q17189        (WPD-SUB > 10).                                    D6502100
02438      IF WPD-SUB NOT > 10                                          D6502100
02439           COMPUTE WPD-BASE-PREMIUM = (MSBANN-PREM-UNIT(WPD-SUB) * D6502100
02440                                      MSBRATING-FACTOR (WPD-SUB) * D6502100
02441                                      1000) /                      D6502100
02442                                      MCVVALUE-PER-UNIT(1)         D6502100
02443      ELSE                                                         D6502100
02444          MOVE +0 TO WPD-BASE-PREMIUM.                             D6502100
02445      COMPUTE BASEFACE = ((MCVNUMBER-OF-UNITS(1) *                 D6502100
02446                          MCVVALUE-PER-UNIT(1)) / 1000).           D6502100
02447      MOVE BASEFACE TO NEWMINFACE.                                 D6502100
02448      MOVE 0 TO PU-SUB.                                            D6502100
02449      IF MATERIAL-CHANGE                                           D6502100
02450          PERFORM 311000-PU-ADDITIONS                              D6502100
02451              VARYING PU-SUB                                       D6502100
02452              FROM 1 BY 1                                          D6502100
02453              UNTIL PU-SUB > 2.                                    D6502100
02454      COMPUTE ALG-BASE-W ROUNDED = (NEWMINFACE *                   D6502100
02455                          7PAYUNIT-XT) +                           D6502100
02456                         (BASEFACE *                               D6502100
02457                         ((WPD-BASE-PREMIUM * (NXT - N65)) /       D6502100
02458                          (NXT - NXT7))).                          D6502100
02459      COMPUTE ALG-BASE ROUNDED = ALG-BASE-W.                       D6502100
02460                                                                   D6502100
02461 ******************************************************************D6502100
02462 * COMPUTE THE CBR PORTION OF THE 7-PAY PREMIUM INCLUDING WPD     *D6502100
02463 * --LEGACY.                                                      *D6502100
02464 ******************************************************************D6502100
02465  920000-B-CBR.                                                    D6502100
02466      MOVE 0 TO CBR-SUB.                                           D6502100
02467      PERFORM 799999-DUMMY                                         D6502100
02468          VARYING CBR-SUB                                          D6502100
02469          FROM 1 BY 1                                              D6502100
               UNTIL (CBR-SUB > 5) OR                                     Q17189
02470**Q17189  UNTIL (MCVCLFAMILY-PLAN(CBR-SUB)  AND                    D6502100
02470                (MCVCLFAMILY-PLAN(CBR-SUB)  AND                      Q17189
02471**Q17189        (MCVMATEX-USE(CBR-SUB) = '0')) OR                  D6502100
02471                (MCVMATEX-USE(CBR-SUB) = '0')) .                     Q17189
02472**Q17189        (CBR-SUB > 5).                                     D6502100
02473      IF CBR-SUB NOT > 5                                           D6502100
02474          MOVE 0 TO WPD-SUB                                        D6502100
02475          PERFORM 799999-DUMMY                                     D6502100
02476              VARYING WPD-SUB                                      D6502100
02477              FROM 1 BY 1                                          D6502100
                   UNTIL (WPD-SUB > 10) OR                                Q17189
02478**Q17189      UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(CBR-SUB)) AND   D6502100
02478                    ((MSBPHASE(WPD-SUB) = MCVPHASE(CBR-SUB)) AND     Q17189
02479                     MSBPREM-WAIVER(WPD-SUB) AND                   D6502100
02480**Q17189             MSBACTIVE(WPD-SUB)) OR                        D6502100
02480                     MSBACTIVE(WPD-SUB)) .                           Q17189
02481**Q17189            (WPD-SUB > 10).                                D6502100
02482      IF CBR-SUB NOT > 5                                           D6502100
02483          IF WPD-SUB NOT > 10                                      D6502100
02484            COMPUTE WPD-CBR-PREMIUM = MSBANN-PREM-UNIT(WPD-SUB)    D6502100
02485                                      * MSBRATING-FACTOR (WPD-SUB) D6502100
02486          ELSE                                                     D6502100
02487              MOVE +0 TO WPD-CBR-PREMIUM.                          D6502100
02488      IF CBR-SUB NOT > 5                                           D6502100
02489        COMPUTE BLG-CBR-W ROUNDED = MCVNUMBER-OF-UNITS(CBR-SUB) *  D6502100
02490                            (MCVANN-PREM-PER-UNIT(CBR-SUB) +       D6502100
02491                              WPD-CBR-PREMIUM) *                   D6502100
02492                             ((NXT - N65) /                        D6502100
02493                             (NXT - NXT7))                         D6502100
02494        COMPUTE BLG-CBR ROUNDED = BLG-CBR-W.                       D6502100
02495                                                                   D6502100
02496 ******************************************************************D6502100
02497 * COMPUTE THE GIO PORTION OF THE 7-PAY PREMIUM--LEGACY.          *D6502100
02498 ******************************************************************D6502100
02499  930000-C-GIO.                                                    D6502100
02500      MOVE 0 TO GIO-SUB.                                           D6502100
02501      PERFORM 799999-DUMMY                                         D6502100
02502          VARYING GIO-SUB                                          D6502100
02503          FROM 1 BY 1                                              D6502100
               UNTIL (GIO-SUB > 10) OR                                    Q17189
02504**Q17189  UNTIL ((MSBPHASE-TYPE(GIO-SUB) = '0B0') AND              D6502100
02504                ((MSBPHASE-TYPE(GIO-SUB) = '0B0') AND                Q17189
02505**Q17189         MSBACTIVE(GIO-SUB)) OR                            D6502100
02505                 MSBACTIVE(GIO-SUB)) .                               Q17189
02506**Q17189        (GIO-SUB > 10).                                    D6502100
02507      IF GIO-SUB NOT > 10                                          D6502100
02508          COMPUTE CLG-GIO-W ROUNDED = ((MSBNUMBER-UNITS(GIO-SUB) * D6502100
02509                                MCVVALUE-PER-UNIT(1)) /            D6502100
02510                                1000) *                            D6502100
02511                                ((MSBANN-PREM-UNIT(GIO-SUB) *      D6502100
02512                                 1000) /                           D6502100
02513                                 MCVVALUE-PER-UNIT(1)) *           D6502100
02514                                ((NXT - N43) /                     D6502100
02515                                 (NXT - NXT7))                     D6502100
02516          COMPUTE CLG-GIO ROUNDED = CLG-GIO-W.                     D6502100
02517                                                                   D6502100
02518 ******************************************************************D6502100
02519 * COMPUTE THE ACCELERATOR AND ACCELERATOR ONE PORTION OF THE     *D6502100
02520 *    7-PAY PREMIUM--LEGACY.                                      *D6502100
02521 ******************************************************************D6502100
02522  940000-D-ACCEL.                                                  D6502100
02523      MOVE 0 TO ACCEL-SUB.                                         D6502100
02524      MOVE +0 TO D-ACCEL.                                          D6502100
02525      PERFORM 941000-CHECK-PLAN                                    D6502100
02526          VARYING ACCEL-SUB                                        D6502100
02527          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL-SUB > 5) OR                                   Q17189
02528**Q17189  UNTIL (MCVCLLIFE(ACCEL-SUB) AND                          D6502100
02528                (MCVCLLIFE(ACCEL-SUB) AND                            Q17189
02529                (FIRST-BYTE-BASE = HEX-26) AND                     D6502100
02530**Q17189        (MCVMATEX-USE(ACCEL-SUB) = '0')) OR                D6502100
02530                (MCVMATEX-USE(ACCEL-SUB) = '0')) .                   Q17189
02531**Q17189        (ACCEL-SUB > 5).                                   D6502100
02532      IF ACCEL-SUB NOT > 5                                         D6502100
02533          COMPUTE D-ACCEL = (MCVNUMBER-OF-UNITS(ACCEL-SUB) *       D6502100
02534                            MCVVALUE-PER-UNIT(ACCEL-SUB)) / 1000.  D6502100
02535      MOVE 0 TO ACCEL1-SUB.                                        D6502100
02536      PERFORM 799999-DUMMY                                         D6502100
02537          VARYING ACCEL1-SUB                                       D6502100
02538          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL1-SUB > 2) OR                                  Q17189
02539**Q17189  UNTIL (((MPUFUNCTIONS(ACCEL1-SUB) = '8') OR              D6502100
02539                (((MPUFUNCTIONS(ACCEL1-SUB) = '8') OR                Q17189
02540                 (MPUFUNCTIONS(ACCEL1-SUB) = '9')) AND             D6502100
02541**Q17189         MPUACTIVE(ACCEL1-SUB)) OR                         D6502100
02541                 MPUACTIVE(ACCEL1-SUB)) .                            Q17189
02542**Q17189        (ACCEL1-SUB > 2).                                  D6502100
02543      IF ACCEL1-SUB NOT > 2                                        D6502100
02544          COMPUTE D-ACCEL = D-ACCEL +                              D6502100
02545                            (MPUADDITIONS-TOTAL(ACCEL1-SUB) /      D6502100
02546                             1000).                                D6502100
02547      COMPUTE DLG-ACCEL-W ROUNDED = D-ACCEL * 7PAYUNIT-XT.         D6502100
02548      COMPUTE DLG-ACCEL ROUNDED = DLG-ACCEL-W.                     D6502100
02549                                                                   D6502100
02550  941000-CHECK-PLAN.                                               D6502100
02551      MOVE MCVBASE (ACCEL-SUB) TO HOLD-BASE.                       D6502100
02552      IF FIRST-BYTE-BASE = HEX-26                                  D6502100
02553          IF MCVCLLIFE(ACCEL-SUB) AND                              D6502100
02554             MCVMATEX-USE(ACCEL-SUB) = '0'                         D6502100
02555              SUBTRACT +1 FROM ACCEL-SUB.                          D6502100
02556                                                                   D6502100
02557 ******************************************************************D6502100
02558 * COMPUTE THE WPD ON ACCELERATOR ONE PORTION OF THE 7-PAY        *D6502100
02559 *    PREMIUM--LEGACY.                                            *D6502100
02560 ******************************************************************D6502100
02561  950000-E-ACCEL-WPD.                                              D6502100
02562      MOVE 0 TO ACCEL-SUB.                                         D6502100
02563      MOVE HEX-00 TO FIRST-BYTE-BASE                               D6502100
02564      PERFORM 941000-CHECK-PLAN                                    D6502100
02565          VARYING ACCEL-SUB                                        D6502100
02566          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL-SUB > 5) OR                                   Q17189
02567**Q17189  UNTIL (MCVCLLIFE(ACCEL-SUB) AND                          D6502100
02567                (MCVCLLIFE(ACCEL-SUB) AND                            Q17189
02568                (FIRST-BYTE-BASE = HEX-26) AND                     D6502100
02569**Q17189        (MCVMATEX-USE(ACCEL-SUB) = '0')) OR                D6502100
02569                (MCVMATEX-USE(ACCEL-SUB) = '0')) .                   Q17189
02570**Q17189        (ACCEL-SUB > 5).                                   D6502100
02571      IF ACCEL-SUB NOT > 5                                         D6502100
02572          MOVE 0 TO WPD-SUB                                        D6502100
02573          PERFORM 799999-DUMMY                                     D6502100
02574              VARYING WPD-SUB                                      D6502100
02575              FROM 1 BY 1                                          D6502100
                   UNTIL (WPD-SUB > 10)  OR                               Q17189
02576**Q17189      UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND D6502100
02576                    ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND   Q17189
02577                     MSBPREM-WAIVER(WPD-SUB) AND                   D6502100
02578**Q17189             MSBACTIVE(WPD-SUB)) OR                        D6502100
02578                     MSBACTIVE(WPD-SUB)) .                           Q17189
02579**Q17189            (WPD-SUB > 10).                                D6502100
02580      IF (ACCEL-SUB NOT > 5) AND                                   D6502100
02581         (WPD-SUB NOT > 10)                                        D6502100
02582          COMPUTE ELG-ACCEL-WPD-W ROUNDED =                        D6502100
02583                         MSBNUMBER-UNITS(WPD-SUB) *                D6502100
02584                         MSBANN-PREM-UNIT(WPD-SUB) *               D6502100
02585                         MSBRATING-FACTOR(WPD-SUB) *               D6502100
02586                         ((NXT - N65) /                            D6502100
02587                          (NXT - NXT7))                            D6502100
02588          COMPUTE ELG-ACCEL-WPD ROUNDED = ELG-ACCEL-WPD-W.         D6502100
02589                                                                   D6502100
02590 ******************************************************************D6502100
02591 * COMPUTE THE TERM PORTION OF THE 7-PAY PREMIUM--LEGACY.         *D6502100
02592 ******************************************************************D6502100
02593  960000-F-TERM.                                                   D6502100
02594      MOVE +0 TO TERM-SUB.                                         D6502100
02595      MOVE +0 TO FLG-TERM.                                         D6502100
02596      PERFORM 961500-CHECK-PLAN                                    D6502100
02597          VARYING TERM-SUB                                         D6502100
02598          FROM 1 BY 1                                              D6502100
               UNTIL (TERM-SUB > 5) OR                                    Q17189
02599**Q17189  UNTIL (MCVCLASS (TERM-SUB) = '5' AND                     D6502100
02599                (MCVCLASS (TERM-SUB) = '5' AND                       Q17189
02600**Q17189      FIRST-BYTE-BASE = HEX-24) OR                         D6502100
02600              FIRST-BYTE-BASE = HEX-24) .                            Q17189
02601**Q17189        (TERM-SUB > 5).                                    D6502100
02602      IF TERM-SUB NOT > 5                                          D6502100
02603          PERFORM 962000-CHECK-TERM-BASIC.                         D6502100
02604                                                                   D6502100
02605      MOVE 0 TO TERM-SUB.                                          D6502100
02606      PERFORM 961000-CHECK-PLAN                                    D6502100
02607          VARYING TERM-SUB                                         D6502100
02608          FROM 1 BY 1                                              D6502100
               UNTIL (TERM-SUB > 5)  OR                                   Q17189
02609**Q17189  UNTIL (MCVCLASS (TERM-SUB) = '5' AND                     D6502100
02609                (MCVCLASS (TERM-SUB) = '5' AND                       Q17189
02610**Q17189      FIRST-BYTE-BASE = HEX-23) OR                         D6502100
02610              FIRST-BYTE-BASE = HEX-23) .                            Q17189
02611**Q17189        (TERM-SUB > 5).                                    D6502100
02612      IF TERM-SUB NOT > 5                                          D6502100
02613          PERFORM 965000-CHECK-TERM-OTHER.                         D6502100
02614                                                                   D6502100
02615  961000-CHECK-PLAN.                                               D6502100
02616      MOVE MCVBASE (TERM-SUB) TO HOLD-BASE.                        D6502100
02617      IF FIRST-BYTE-BASE = HEX-23                                  D6502100
02618          SUBTRACT +1 FROM TERM-SUB.                               D6502100
02619                                                                   D6502100
02620  961500-CHECK-PLAN.                                               D6502100
02621      MOVE MCVBASE (TERM-SUB) TO HOLD-BASE.                        D6502100
02622      IF FIRST-BYTE-BASE = HEX-24                                  D6502100
02623          SUBTRACT +1 FROM TERM-SUB.                               D6502100
02624                                                                   D6502100
02625  962000-CHECK-TERM-BASIC.                                         D6502100
02626      MOVE MCVCLASS (TERM-SUB) TO PLANCODE-CLASS.                  D6502100
02627      MOVE MCVSERIES (TERM-SUB) TO PLANCODE-SERIES.                D6502100
02628      MOVE MCVNUMBER-OF-UNITS (TERM-SUB) TO R22-NUMBER-OF-UNITS.   D6502100
02629      MOVE X TO S.                                                 D6502100
02630      COMPUTE TERM-PREMIUM =                                       D6502100
02631          MCVANN-PREM-PER-UNIT (TERM-SUB).                         D6502100
02632      MOVE NXT TO N5LO.                                            D6502100
02633      IF X < 60                                                    D6502100
02634          MOVE +5 TO R22-DURATION                                  D6502100
02635          PERFORM 991000-CALL-R2200000                             D6502100
02636      ELSE                                                         D6502100
02637          MOVE +0 TO MALE-PREMIUM.                                 D6502100
02638      MOVE NXT5 TO N5HI.                                           D6502100
02639      COMPUTE F-INIT-WORK ROUNDED =                                D6502100
02640          TERM-PREMIUM * (N5LO - N5HI).                            D6502100
02641      IF F-INIT-WORK < +0                                          D6502100
02642          MOVE +0 TO F-INIT-WORK.                                  D6502100
02643      MOVE N5HI TO N5LO.                                           D6502100
02644      COMPUTE TERM-PREMIUM = MALE-PREMIUM.                         D6502100
02645      MOVE NXT20 TO N5HI.                                          D6502100
02646      COMPUTE F-ULT-WORK ROUNDED =                                 D6502100
02647          TERM-PREMIUM * (N5LO - N5HI).                            D6502100
02648                                                                   D6502100
02649      COMPUTE FLG-TERM-W ROUNDED = (((F-INIT-WORK + F-ULT-WORK) *  D6502100
02650         MCVNUMBER-OF-UNITS (TERM-SUB)) /                          D6502100
02651         (NXT - NXT7)) + FLG-TERM.                                 D6502100
02652      COMPUTE FLG-TERM ROUNDED = FLG-TERM-W.                       D6502100
02653                                                                   D6502100
02654  965000-CHECK-TERM-OTHER.                                         D6502100
02655      MOVE MCVCLASS (TERM-SUB) TO PLANCODE-CLASS.                  D6502100
02656      MOVE MCVSERIES (TERM-SUB) TO PLANCODE-SERIES.                D6502100
02657      MOVE MCVNUMBER-OF-UNITS (TERM-SUB) TO R22-NUMBER-OF-UNITS.   D6502100
02658      MOVE MCVAISSUE-AGE (TERM-SUB) TO R22-AGE-PARM (2).           D6502100
02659      MOVE +0 TO R22-STATUS-CODE-PARM (2).                         D6502100
02660      IF MCVRATE-BOOK (TERM-SUB) = 'NT' OR 'NP' OR 'N4' OR 'N8'    D6502100
02661          MOVE +64 TO R22-STATUS-CODE-PARM (2).                    D6502100
02662      IF MCVRATE-BOOK (TERM-SUB) = 'NP' OR '0P' OR 'N8' OR '08'    D6502100
02663          ADD +4096 TO R22-STATUS-CODE-PARM (2).                   D6502100
02664      PERFORM 799999-DUMMY VARYING I FROM 1 BY 1                   D6502100
02665          UNTIL I > 7 OR MELTRIDENT (I) = '  ' OR                  D6502100
02666          ((MELTABLE (I) NOT = '  ') AND MELPHASE (I) =            D6502100
02667          MCVPHASE (TERM-SUB)).                                    D6502100
02668      IF  I > 7                                                    D6502100
02669          MOVE SPACES TO R22-SPECIAL-TABLE-PARM (2)                D6502100
02670      ELSE                                                         D6502100
02671          MOVE MELTABLE (I) TO R22-SPECIAL-TABLE-PARM (2).         D6502100
02672      MOVE MCVSEX (TERM-SUB) TO R22-SEX-PARM (2).                  D6502100
02673      MOVE X TO S.                                                 D6502100
02674      COMPUTE TERM-PREMIUM =                                       D6502100
02675          MCVANN-PREM-PER-UNIT (TERM-SUB).                         D6502100
02676      MOVE NXT TO N5LO.                                            D6502100
02677      IF X < 60                                                    D6502100
02678          MOVE +5 TO R22-DURATION                                  D6502100
02679          PERFORM 991000-CALL-R2200000                             D6502100
02680      ELSE                                                         D6502100
02681          MOVE +0 TO MALE-PREMIUM.                                 D6502100
02682      MOVE NXT5 TO N5HI.                                           D6502100
02683      COMPUTE F-INIT-WORK ROUNDED =                                D6502100
02684          TERM-PREMIUM * (N5LO - N5HI).                            D6502100
02685      IF F-INIT-WORK < +0                                          D6502100
02686          MOVE +0 TO F-INIT-WORK.                                  D6502100
02687      MOVE N5HI TO N5LO.                                           D6502100
02688      COMPUTE TERM-PREMIUM = MALE-PREMIUM.                         D6502100
02689      MOVE NXTPD TO N5HI.                                          D6502100
02690      COMPUTE F-ULT-WORK ROUNDED =                                 D6502100
02691          TERM-PREMIUM * (N5LO - N5HI).                            D6502100
02692                                                                   D6502100
02693      COMPUTE FLG-TERM ROUNDED = (((F-INIT-WORK + F-ULT-WORK) *    D6502100
02694         MCVNUMBER-OF-UNITS (TERM-SUB)) /                          D6502100
02695         (NXT - NXT7)) + FLG-TERM.                                 D6502100
02696                                                                   D6502100
02697 ******************************************************************D6502100
02698 * COMPUTE THE WPD TERM PORTION OF THE 7-PAY PREMIUM--LEGACY.     *D6502100
02699 ******************************************************************D6502100
02700  970000-G-TERM-WPD.                                               D6502100
02701      MOVE 0 TO TERM-SUB.                                          D6502100
02702      MOVE HEX-00 TO FIRST-BYTE-BASE.                              D6502100
02703      PERFORM 961000-CHECK-PLAN                                    D6502100
02704          VARYING TERM-SUB                                         D6502100
02705          FROM 1 BY 1                                              D6502100
               UNTIL (TERM-SUB > 5) OR                                    Q17189
02706**Q17189  UNTIL MCVCLASS (TERM-SUB) = '5' AND                      D6502100
02706                MCVCLASS (TERM-SUB) = '5' AND                        Q17189
02707**Q17189         FIRST-BYTE-BASE = HEX-23 OR                       D6502100
02707                 FIRST-BYTE-BASE = HEX-23 .                          Q17189
02708**Q17189        (TERM-SUB > 5).                                    D6502100
02709      IF TERM-SUB NOT > 5                                          D6502100
02710          PERFORM 972000-CHECK-TERM THRU 972100-EXIT.              D6502100
02711                                                                   D6502100
02712      MOVE 0 TO TERM-SUB.                                          D6502100
02713      MOVE HEX-00 TO FIRST-BYTE-BASE.                              D6502100
02714      PERFORM 961500-CHECK-PLAN                                    D6502100
02715          VARYING TERM-SUB                                         D6502100
02716          FROM 1 BY 1                                              D6502100
               UNTIL (TERM-SUB > 5) OR                                    Q17189
02717**Q17189  UNTIL MCVCLASS (TERM-SUB) = '5' AND                      D6502100
02717                MCVCLASS (TERM-SUB) = '5' AND                        Q17189
02718**Q17189         FIRST-BYTE-BASE = HEX-24 OR                       D6502100
02718                 FIRST-BYTE-BASE = HEX-24 .                          Q17189
02719**Q17189        (TERM-SUB > 5).                                    D6502100
02720      IF TERM-SUB NOT > 5                                          D6502100
02721          PERFORM 972000-CHECK-TERM THRU 972100-EXIT.              D6502100
02722                                                                   D6502100
02723  972000-CHECK-TERM.                                               D6502100
02724      MOVE X TO S.                                                 D6502100
02725      MOVE +0 TO NTWPD.                                            D6502100
02726      MOVE +0 TO TERM-PREMIUM.                                     D6502100
02727                                                                   D6502100
02728      PERFORM 799999-DUMMY                                         D6502100
02729          VARYING WPD-SUB                                          D6502100
02730          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10) OR                                    Q17189
02731**Q17189  UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(TERM-SUB)) AND      D6502100
02731                ((MSBPHASE(WPD-SUB) = MCVPHASE(TERM-SUB)) AND        Q17189
02732                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
02733**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
02733                 MSBACTIVE(WPD-SUB)) .                               Q17189
02734**Q17189        (WPD-SUB > 10).                                    D6502100
02735      IF WPD-SUB > 10                                              D6502100
02736          GO TO 972100-EXIT.                                       D6502100
02737      COMPUTE TERM-PREMIUM = MSBNUMBER-UNITS(WPD-SUB) *            D6502100
02738          MSBANN-PREM-UNIT(WPD-SUB) * MSBRATING-FACTOR(WPD-SUB).   D6502100
02739      IF FIRST-BYTE-BASE = HEX-24                                  D6502100
02740          MOVE NXT20 TO NTWPD                                      D6502100
02741      ELSE                                                         D6502100
02742          IF FIRST-BYTE-BASE = HEX-23                              D6502100
02743              MOVE NT523WPD TO NTWPD.                              D6502100
02744                                                                   D6502100
02745      COMPUTE GLG-TERM-WPD-W ROUNDED = (TERM-PREMIUM *             D6502100
02746                           ((NXT - NTWPD) / (NXT - NXT7))) +       D6502100
02747                           GLG-TERM-WPD.                           D6502100
02748      COMPUTE GLG-TERM-WPD ROUNDED = GLG-TERM-WPD-W.               D6502100
02749                                                                   D6502100
02750                                                                   D6502100
02751  972100-EXIT.                                                     D6502100
02752      EXIT.                                                        D6502100
02753                                                                   D6502100
02754  990000-CALL-R2200000.                                            D6502100
02755       CALL 'OSCALLOS' USING R2200000                              D6502100
02756                             RESULT-AREA-COMM                      D6502100
02757                             JOBMARK                               D6502100
02758                             R22-POLICY-NUMBER                     D6502100
02759                             PLANCODE-JOB13                        D6502100
02760                             R22-AGE-TABLE                         D6502100
02761                             R22-DURATION                          D6502100
02762                             R22-RESIDUAL-VALUE                    D6502100
02763                             R22-STATUS-CODE-TABLE                 D6502100
02764                             R22-NUMBER-OF-UNITS                   D6502100
02765                             R22-SPECIAL-TABLE                     D6502100
02766                             R22-CASH-VAL-T-1                      D6502100
02767                             R22-CASH-VAL-T                        D6502100
02768                             R22-PU-T                              D6502100
02769                             R22-JOINT                             D6502100
02770                             R22-ISSUEDATE                         D6502100
02771                             R22-SEX                               D6502100
02772                             R22-FLAT-EXTRA-CODE.                  D6502100
02773  991000-CALL-R2200000.                                            D6502100
02774       CALL 'OSCALLOS' USING R2200000                              D6502100
02775                             RESULT-AREA-PREM                      D6502100
02776                             JOB06                                 D6502100
02777                             R22-POLICY-NUMBER                     D6502100
02778                             PLANCODE-JOB6                         D6502100
02779                             R22-AGE-TABLE                         D6502100
02780                             R22-DURATION                          D6502100
02781                             R22-RESIDUAL-VALUE                    D6502100
02782                             R22-STATUS-CODE-TABLE                 D6502100
02783                             R22-NUMBER-OF-UNITS                   D6502100
02784                             R22-SPECIAL-TABLE                     D6502100
02785                             R22-CASH-VAL-T-1                      D6502100
02786                             R22-CASH-VAL-T                        D6502100
02787                             R22-PU-T                              D6502100
02788                             R22-JOINT                             D6502100
02789                             R22-ISSUEDATE                         D6502100
02790                             R22-SEX                               D6502100
02791                             R22-FLAT-EXTRA-CODE.                  D6502100
02792 /                                                                 D6502100
02793 ******************************************************************D6502100
02794 * THE MAIN PROCESSING PARAGRAPH FOR CALCULATING A 7-PAY PREMIUM  *D6502100
02795 *    FOR SELECTAUL.                                              *D6502100
02796 *    IT INVOKES SELECTION OF THE APPROPRIATE COMMUTATION         *D6502100
02797 *    TABLES; CALCULATION OF AGE AND DURATIONAL FACTORS;          *D6502100
02798 *    RETREIVAL OF COMMUTATION VALUES; CALCULATION OF EACH        *D6502100
02799 *    PARTIAL VALUE IN THE TOTAL PREMIUM; AND COMPUTATION OF THE  *D6502100
02800 *    FINAL 7-PAY PREMIUM.                                        *D6502100
02801 ******************************************************************D6502100
02802  A00000-CALCULATE-7-PAY-PREMIUM.                                  D6502100
02803      MOVE '1618000000' TO R22-POLICY-NUMBER.                      D6502100
02804      PERFORM 820000-INSURED-AGE.                                  D6502100
02805      PERFORM A30000-GET-COMMUTATION-VALUES THRU A30000-EXIT.      D6502100
02806      MOVE +0 TO BLG-CBR                                           D6502100
02807                 CLG-GIO                                           D6502100
02808                 DLG-ACCEL                                         D6502100
02809                 ELG-ACCEL-WPD                                     D6502100
02810                 BLG-CBR-W                                         D6502100
02811                 CLG-GIO-W                                         D6502100
02812                 DLG-ACCEL-W                                       D6502100
02813                 ELG-ACCEL-WPD-W                                   D6502100
02814                 1035-CV-FACTOR.                                   D6502100
02815      PERFORM B10000-A-BASE.                                       D6502100
02816      PERFORM 920000-B-CBR.                                        D6502100
02817      PERFORM B30000-C-GIO.                                        D6502100
02818      PERFORM B40000-D-ACCEL.                                      D6502100
02819      PERFORM B50000-E-ACCEL-WPD.                                  D6502100
02820      PERFORM 240000-GET-1035-OR-CV-FACTOR.                        D6502100
02821      PERFORM A50000-TOTAL-PARTS.                                  D6502100
02822                                                                   D6502100
02823 ******************************************************************D6502100
02824 * THIS PARAGRAPH SELECTS THE APPROPRIATE COMMUTATION FUNCTIONS   *D6502100
02825 *    TO BE USED BASED ON AGE AND SEX.  ALSO THE 7-PAY PREMIUM    *D6502100
02826 *    USED IN SOME CALCULATIONS AND A SEVEN YEAR ANNUITY FACTOR   *D6502100
02827 *    ARE SELECTED BASED ON AGE AND SEX.                          *D6502100
02828 ******************************************************************D6502100
02829  A30000-GET-COMMUTATION-VALUES.                                   D6502100
02830      MOVE +13 TO JOBMARK.                                         D6502100
02831      MOVE +0 TO R22-NUMBER-OF-UNITS.                              D6502100
02832      IF FIRST-BYTE-BASE = HEX-28                                  D6502100
02833          MOVE 'h118' TO TABLECODE                                 D6502100
02834      ELSE                                                         D6502100
02835          IF FIRST-BYTE-BASE = HEX-42                              D6502100
02836              MOVE 'i118' TO TABLECODE.                            D6502100
02837      MOVE -1 TO R22-AGE-PARM (1).                                 D6502100
02838      MOVE MCVAISSUE-AGE (1) TO R22-AGE-PARM (2).                  D6502100
02839      MOVE -1 TO R22-STATUS-CODE-PARM (1).                         D6502100
02840      MOVE +0 TO R22-STATUS-CODE-PARM (2).                         D6502100
02841      IF MCVRATE-BOOK (1) = 'NT' OR 'NP' OR 'N4' OR 'N8'           D6502100
02842          MOVE +64 TO R22-STATUS-CODE-PARM (2).                    D6502100
02843      IF MCVRATE-BOOK (1) = 'NP' OR '0P' OR 'N8' OR '08'           D6502100
02844          ADD +4096 TO R22-STATUS-CODE-PARM (2).                   D6502100
AL8775*    MOVE '02' TO R22-SPECIAL-TABLE-PARM (1).                     D6502100
AL8775     MOVE '01' TO R22-SPECIAL-TABLE-PARM (1).                     D6502100
02846      MOVE FLAT-EXTRA-CODE-ZERO TO R22-FLAT-EXTRA-CODE.            D6502100
02847      PERFORM 799999-DUMMY VARYING I FROM 1 BY 1                   D6502100
02848          UNTIL I > 7 OR MELTRIDENT (I) = '  ' OR                  D6502100
02849          ((MELTABLE (I) NOT = '  ') AND MELPHASE (I) = '0').      D6502100
02850      IF  I > 7                                                    D6502100
02851          MOVE SPACES TO R22-SPECIAL-TABLE-PARM (2)                D6502100
02852      ELSE                                                         D6502100
02853          MOVE MELTABLE (I) TO R22-SPECIAL-TABLE-PARM (2).         D6502100
02854      MOVE '1' TO R22-SEX-PARM (1).                                D6502100
02855      MOVE MCVSEX (1) TO R22-SEX-PARM (2).                         D6502100
02856      COMPUTE R22-DURATION = DURATION + 7.                         D6502100
02857      PERFORM 990000-CALL-R2200000.                                D6502100
02858      MOVE R22-NX TO NXT7.                                         D6502100
02859      MOVE DURATION TO R22-DURATION.                               D6502100
02860      PERFORM 990000-CALL-R2200000.                                D6502100
02861      MOVE R22-NX TO NXT.                                          D6502100
02862      COMPUTE 7PAYUNIT-XT-W = SMALLD-400 * 1000 * R22-MX /         D6502100
02863          (DELTA-400 * (NXT - NXT7)).                              D6502100
02864      COMPUTE 7PAYUNIT-XT =7PAYUNIT-XT-W.                          D6502100
02865      IF FIRST-BYTE-BASE = HEX-28                                  D6502100
02866          MOVE 'h108' TO TABLECODE                                 D6502100
02867      ELSE                                                         D6502100
02868          IF FIRST-BYTE-BASE = HEX-42                              D6502100
02869              MOVE 'i108' TO TABLECODE.                            D6502100
02870      PERFORM 990000-CALL-R2200000.                                D6502100
02871      COMPUTE 7YRANNUITY-XT-W = DELTA-400 *                        D6502100
02872          (NXT - NXT7) / (R22-DX * SMALLD-400).                    D6502100
02873      COMPUTE 7YRANNUITY-XT = 7YRANNUITY-XT-W.                     D6502100
02874      MOVE R22-NX TO NXT.                                          D6502100
02875      MOVE R22-DX TO DXT.                                          D6502100
02876      COMPUTE R22-DURATION = DURATION + 7.                         D6502100
02877      PERFORM 990000-CALL-R2200000.                                D6502100
02878      MOVE R22-NX TO NXT7.                                         D6502100
02879      COMPUTE R22-DURATION = 65 - X.                               D6502100
02880      PERFORM 990000-CALL-R2200000.                                D6502100
02881      MOVE R22-NX TO N65.                                          D6502100
02882      MOVE PREM-PAY-PERIOD TO PP-FIRST-BYTE.                       D6502100
02883      MOVE +0 TO PP-SECOND-BYTE.                                   D6502100
02884      COMPUTE R22-DURATION = PP-PERIOD / 10.                       D6502100
02885      PERFORM 990000-CALL-R2200000.                                D6502100
02886      MOVE R22-NX TO NP.                                           D6502100
02887      MOVE +0 TO NXT20.                                            D6502100
02888      COMPUTE R22-DURATION = 65 - MCVAISSUE-AGE(1).                D6502100
02889      IF R22-DURATION > 20                                         D6502100
02890          MOVE +20 TO R22-DURATION.                                D6502100
02891      PERFORM 990000-CALL-R2200000.                                D6502100
02892      MOVE R22-NX TO NXT20.                                        D6502100
02893      COMPUTE R22-DURATION = 43 - X.                               D6502100
02894      PERFORM 990000-CALL-R2200000.                                D6502100
02895      MOVE R22-NX TO N43.                                          D6502100
02896                                                                   D6502100
02897  A30000-EXIT.                                                     D6502100
02898      EXIT.                                                        D6502100
02899                                                                   D6502100
02900  A50000-TOTAL-PARTS.                                              D6502100
02901      COMPUTE LNK-7-PAY-PREMIUM ROUNDED = ALG-BASE +               D6502100
02902                                          BLG-CBR +                D6502100
02903                                          CLG-GIO +                D6502100
02904                                          DLG-ACCEL +              D6502100
02905                                          ELG-ACCEL-WPD +          D6502100
02906                                          1035-CV-FACTOR.          D6502100
02907 /                                                                 D6502100
02908 ******************************************************************D6502100
02909 * COMPUTE THE BASE COVERAGE (SELECTAUL) PORTION OF THE 7-PAY     *D6502100
02910 *    PREMIUM.                                                    *D6502100
02911 ******************************************************************D6502100
02912  B10000-A-BASE.                                                   D6502100
02913      MOVE 0 TO WPD-SUB.                                           D6502100
02914      PERFORM 799999-DUMMY                                         D6502100
02915          VARYING WPD-SUB                                          D6502100
02916          FROM 1 BY 1                                              D6502100
               UNTIL (WPD-SUB > 10) OR                                    Q17189
02917**Q17189  UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND             D6502100
02917                ((MSBPHASE(WPD-SUB) = MCVPHASE(1)) AND               Q17189
02918                 MSBPREM-WAIVER(WPD-SUB) AND                       D6502100
02919**Q17189         MSBACTIVE(WPD-SUB)) OR                            D6502100
02919                 MSBACTIVE(WPD-SUB)) .                               Q17189
02920**Q17189        (WPD-SUB > 10).                                    D6502100
02921      IF WPD-SUB NOT > 10                                          D6502100
02922           COMPUTE WPD-BASE-PREMIUM = (MSBANN-PREM-UNIT(WPD-SUB) * D6502100
02923                                      MSBRATING-FACTOR (WPD-SUB) * D6502100
02924                                      1000) /                      D6502100
02925                                      MCVVALUE-PER-UNIT(1)         D6502100
02926      ELSE                                                         D6502100
02927          MOVE +0 TO WPD-BASE-PREMIUM.                             D6502100
02928      COMPUTE BASEFACE = ((MCVNUMBER-OF-UNITS(1) *                 D6502100
02929                          MCVVALUE-PER-UNIT(1)) / 1000).           D6502100
02930      MOVE BASEFACE TO NEWMINFACE.                                 D6502100
02931      MOVE 0 TO PU-SUB.                                            D6502100
02932      IF MATERIAL-CHANGE                                           D6502100
02933          PERFORM 311000-PU-ADDITIONS                              D6502100
02934              VARYING PU-SUB                                       D6502100
02935              FROM 1 BY 1                                          D6502100
02936              UNTIL PU-SUB > 2.                                    D6502100
02937      IF PP-PERIOD < 65 - X                                        D6502100
02938          MOVE NP TO N                                             D6502100
02939      ELSE                                                         D6502100
02940          MOVE N65 TO N.                                           D6502100
02941      COMPUTE ALG-BASE-W ROUNDED = (NEWMINFACE *                   D6502100
02942                          7PAYUNIT-XT) +                           D6502100
02943                         (BASEFACE *                               D6502100
02944                         ((WPD-BASE-PREMIUM * (NXT - N)) /         D6502100
02945                          (NXT - NXT7))).                          D6502100
02946      COMPUTE ALG-BASE ROUNDED = ALG-BASE-W.                       D6502100
02947                                                                   D6502100
02948 ******************************************************************D6502100
02949 * COMPUTE THE GIO PORTION OF THE 7-PAY PREMIUM--SELECTAUL        *D6502100
02950 ******************************************************************D6502100
02951  B30000-C-GIO.                                                    D6502100
02952      MOVE 0 TO GIO-SUB.                                           D6502100
02953      PERFORM 799999-DUMMY                                         D6502100
02954          VARYING GIO-SUB                                          D6502100
02955          FROM 1 BY 1                                              D6502100
               UNTIL (GIO-SUB > 10) OR                                    Q17189
02956**Q17189  UNTIL ((MSBPHASE-TYPE(GIO-SUB) = '0B0') AND              D6502100
02956                ((MSBPHASE-TYPE(GIO-SUB) = '0B0') AND                Q17189
02957**Q17189         MSBACTIVE(GIO-SUB)) OR                            D6502100
02957                 MSBACTIVE(GIO-SUB)) .                               Q17189
02958**Q17189        (GIO-SUB > 10).                                    D6502100
02959      IF PP-PERIOD < 43 - X                                        D6502100
02960          MOVE NP TO N                                             D6502100
02961      ELSE                                                         D6502100
02962          MOVE N43 TO N.                                           D6502100
02963      IF GIO-SUB NOT > 10                                          D6502100
02964          COMPUTE CLG-GIO-W ROUNDED = ((MSBNUMBER-UNITS(GIO-SUB) * D6502100
02965                                MCVVALUE-PER-UNIT(1)) /            D6502100
02966                                1000) *                            D6502100
02967                                ((MSBANN-PREM-UNIT(GIO-SUB) *      D6502100
02968                                 1000) /                           D6502100
02969                                 MCVVALUE-PER-UNIT(1)) *           D6502100
02970                                ((NXT - N) /                       D6502100
02971                                 (NXT - NXT7))                     D6502100
02972          COMPUTE CLG-GIO ROUNDED = CLG-GIO-W.                     D6502100
02973                                                                   D6502100
02974 ******************************************************************D6502100
02975 * COMPUTE THE ACCELERATOR AND ACCELERATOR ONE PORTION OF THE     *D6502100
02976 *    7-PAY PREMIUM--SELECTAUL.                                   *D6502100
02977 ******************************************************************D6502100
02978  B40000-D-ACCEL.                                                  D6502100
02979      MOVE 0 TO ACCEL-SUB.                                         D6502100
02980      MOVE +0 TO D-ACCEL.                                          D6502100
02981      PERFORM B41000-CHECK-PLAN                                    D6502100
02982          VARYING ACCEL-SUB                                        D6502100
02983          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL-SUB > 5)    OR                                Q17189
02984**Q17189  UNTIL (MCVCLLIFE(ACCEL-SUB) AND                          D6502100
02984                (MCVCLLIFE(ACCEL-SUB) AND                            Q17189
02985                (FIRST-BYTE-BASE = HEX-29 OR HEX-43) AND           D6502100
02986**Q17189        (MCVMATEX-USE(ACCEL-SUB) = '0')) OR                D6502100
02986                (MCVMATEX-USE(ACCEL-SUB) = '0')) .                   Q17189
     **Q17189        (ACCEL-SUB > 5).                                   D6502100
02988      IF ACCEL-SUB NOT > 5                                         D6502100
02989          COMPUTE D-ACCEL = (MCVNUMBER-OF-UNITS(ACCEL-SUB) *       D6502100
02990                            MCVVALUE-PER-UNIT(ACCEL-SUB)) / 1000.  D6502100
02991      MOVE 0 TO ACCEL1-SUB.                                        D6502100
02992      PERFORM 799999-DUMMY                                         D6502100
02993          VARYING ACCEL1-SUB                                       D6502100
02994          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL1-SUB > 2) OR                                  Q17189
02995**Q17189  UNTIL (((MPUFUNCTIONS(ACCEL1-SUB) = '8') OR              D6502100
02995                (((MPUFUNCTIONS(ACCEL1-SUB) = '8') OR                Q17189
02996                 (MPUFUNCTIONS(ACCEL1-SUB) = '9')) AND             D6502100
02997**Q17189         MPUACTIVE(ACCEL1-SUB)) OR                         D6502100
02997                 MPUACTIVE(ACCEL1-SUB)) .                            Q17189
02998**Q17189        (ACCEL1-SUB > 2).                                  D6502100
02999      IF ACCEL1-SUB NOT > 2                                        D6502100
03000          COMPUTE D-ACCEL = D-ACCEL +                              D6502100
03001                            (MPUADDITIONS-TOTAL(ACCEL1-SUB) /      D6502100
03002                             1000).                                D6502100
03003      COMPUTE DLG-ACCEL-W ROUNDED = D-ACCEL * 7PAYUNIT-XT.         D6502100
03004      COMPUTE DLG-ACCEL ROUNDED = DLG-ACCEL-W.                     D6502100
03005                                                                   D6502100
03006  B41000-CHECK-PLAN.                                               D6502100
03007      MOVE MCVBASE (ACCEL-SUB) TO HOLD-BASE.                       D6502100
03008      IF FIRST-BYTE-BASE = HEX-29 OR HEX-43                        D6502100
03009          IF MCVCLLIFE(ACCEL-SUB) AND                              D6502100
03010             MCVMATEX-USE(ACCEL-SUB) = '0'                         D6502100
03011              SUBTRACT +1 FROM ACCEL-SUB.                          D6502100
03012                                                                   D6502100
03013 ******************************************************************D6502100
03014 * COMPUTE THE WPD ON ACCELERATOR ONE PORTION OF THE 7-PAY        *D6502100
03015 *    PREMIUM--SELECTAUL.                                         *D6502100
03016 ******************************************************************D6502100
03017  B50000-E-ACCEL-WPD.                                              D6502100
03018      MOVE 0 TO ACCEL-SUB.                                         D6502100
03019      MOVE HEX-00 TO FIRST-BYTE-BASE                               D6502100
03020      PERFORM B41000-CHECK-PLAN                                    D6502100
03021          VARYING ACCEL-SUB                                        D6502100
03022          FROM 1 BY 1                                              D6502100
               UNTIL (ACCEL-SUB > 5) OR                                   Q17189
03023**Q17189  UNTIL (MCVCLLIFE(ACCEL-SUB) AND                          D6502100
03023                (MCVCLLIFE(ACCEL-SUB) AND                            Q17189
03024                (FIRST-BYTE-BASE = HEX-29 OR HEX-43) AND           D6502100
03025**Q17189        (MCVMATEX-USE(ACCEL-SUB) = '0')) OR                D6502100
03025                (MCVMATEX-USE(ACCEL-SUB) = '0')) .                   Q17189
89026**Q17189        (ACCEL-SUB > 5).                                   D6502100
03027      IF ACCEL-SUB NOT > 5                                         D6502100
03028          MOVE 0 TO WPD-SUB                                        D6502100
03029          PERFORM 799999-DUMMY                                     D6502100
03030              VARYING WPD-SUB                                      D6502100
03031              FROM 1 BY 1                                          D6502100
                   UNTIL (WPD-SUB > 10) OR                                Q17189
03032**Q17189      UNTIL ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND D6502100
03032                    ((MSBPHASE(WPD-SUB) = MCVPHASE(ACCEL-SUB)) AND   Q17189
03033                     MSBPREM-WAIVER(WPD-SUB) AND                   D6502100
03034**Q17189             MSBACTIVE(WPD-SUB)) OR                        D6502100
03034                     MSBACTIVE(WPD-SUB)) .                           Q17189
03035**Q17189            (WPD-SUB > 10).                                D6502100
03036      IF PP-PERIOD < 65 - X                                        D6502100
03037          MOVE NP TO N                                             D6502100
03038      ELSE                                                         D6502100
03039          MOVE N65 TO N.                                           D6502100
03040      IF (ACCEL-SUB NOT > 5) AND                                   D6502100
03041         (WPD-SUB NOT > 10)                                        D6502100
03042          COMPUTE ELG-ACCEL-WPD-W ROUNDED =                        D6502100
03043                         MSBNUMBER-UNITS(WPD-SUB) *                D6502100
03044                         MSBANN-PREM-UNIT(WPD-SUB) *               D6502100
03045                         MSBRATING-FACTOR(WPD-SUB) *               D6502100
03046                         ((NXT - N) /                              D6502100
03047                          (NXT - NXT7))                            D6502100
03048          COMPUTE ELG-ACCEL-WPD ROUNDED = ELG-ACCEL-WPD-W.         D6502100
03049 /                                                                 D6502100
